{"Massachusetts top court to hear challenges to gig worker ballot measures":{"img":null,"link":"https://www.reuters.com/legal/massachusetts-top-court-hear-challenges-gig-worker-ballot-measures-2024-05-06/","content":"The Massachusetts Supreme Judicial Court first will hear arguments in a labor-backed challenge to a ballot proposal by an industry-supported group that would ask voters to declare that the drivers for the companies are not employees but rather independent contractors entitled to some new benefits.If the industry-backed ballot measure passes but the state wins in the trial, Campbell's office has said the new law would control for the future but that Uber and Lyft could be subject to penalties for the past misclassification of their drivers.The same court in 2022 blocked a similar industry-backed ballot measure, finding that it contained an unrelated proposal that ran afoul of a state constitutional requirement that ballot questions be limited to related subjects.O)New Tab, opens new tab, have spent millions of dollars to support the ballot proposal that would cement the status of their drivers as contractors under state law."},"NY Fed survey finds Americans bracing for higher housing costs":{"img":null,"link":"https://www.reuters.com/markets/us/ny-fed-survey-finds-americans-bracing-higher-housing-costs-2024-05-06/","content":"As part of its latest Survey of Consumer ExpectationsNew Tab, opens new tab, the regional Fed bank found that respondents at the start of the year saw higher near-term increases for both rent and home prices, although they do see some relief over the longer haul for home prices.The New York Fed report also noted that high mortgage rates now are locking homeowners into houses that currently enjoy the low rates seen during the coronavirus pandemic.May 6 (Reuters) - Americans are once again bracing for another round of higher housing costs, amid rising expectations by renters that they'll never be able to buy a house, the Federal Reserve Bank of New York said on Monday.Households also see no relief on home borrowing costs and are in fact bracing for the highest levels of mortgage rates in a survey that dates back to 2014."},"Wall Street climbs on renewed hopes of Fed rate cuts":{"img":null,"link":"https://www.reuters.com/markets/us/futures-edge-higher-rate-cut-bets-2024-05-06/","content":"IXIC)New Tab, opens new tab were trading at three-week highs after data on Friday showed U.The S&P 500 posted 26 new 52-week highs and no new lows, while the Nasdaq recorded 110 new highs and 29 new lows.DJI)New Tab, opens new tab rose 57.N)New Tab, opens new tab and Arm Holdings this week."},"Focus: Denny's faces proxy vote over pig gestation crate pledge":{"img":null,"link":"https://www.reuters.com/business/dennys-faces-proxy-vote-over-pig-gestation-crate-pledge-2024-05-06/","content":"In exchange for the Humane Society’s withdrawal of the 2022 proposal, Denny’s published language on its website disclosing that roughly a third of its pork came from suppliers that at least limit the use of gestation crates.Known for its inexpensive breakfast menu, Denny’s in 2012 pledged to eliminate from its pork supply chain the use of gestation crates, which the Humane Society describes as solitary cages that “confine pigs so restrictively, they can’t even turn around.Denny’s amended its website’s language again following the 2024 Humane Society proposal to now read that it believes half of its pork could come from suppliers that limit gestation crates by 2028.The ISS said this is the first time Denny's had received a proposal regarding disclosing the percentage of group-housed pork in its supply chain, and phasing out gestation crates."},"Tyson Foods shares sink on worries over consumer demand, third quarter":{"img":null,"link":"https://www.reuters.com/business/retail-consumer/tyson-foods-beats-profit-estimates-cost-control-efforts-sales-slip-2024-05-06/","content":"Improvement in the chicken business on Monday prompted Tyson to lift its estimate for total adjusted operating income in fiscal year 2024 to $1.High commodity costs could weigh on results in the third quarter, Boulden added.chicken plants since the start of last year, laid off corporate employees and announced plans to close a pork plant, in an attempt to boost results and rein in costs.Tyson later sought to calm investor concerns over the third quarter as shares sank."},"Fewer low-income Americans took out mortgages in 2023, study says":{"img":null,"link":"https://www.reuters.com/markets/us/fewer-low-income-americans-took-out-mortgages-2023-study-says-2024-05-06/","content":"May 6 (Reuters) - Fewer low-income Americans took out mortgage loans last year than 2020, real estate broker Redfin (RDFN.6% of new mortgages issued last year went to low-income Americans, down from 23.The median household income in the HMDA data for low-income households was $64,000.\"Somewhat ironically, the continued strength of the economy has made it harder to afford a home and widened the real-estate wealth gap between rich and poor Americans,\" Redfin Senior Economist Elijah de la Campa said."},"Nio on track to unveil its first mass-market car in May, executive says":{"img":null,"link":"https://www.reuters.com/business/autos-transportation/nio-track-unveil-its-first-mass-market-car-may-executive-says-2024-05-06/","content":"PARIS, May 6 (Reuters) - China's premium electric vehicle maker Nio is on track to unveil a new model under a mass-market brand by the end of this month and a second smaller EV to be sold in Europe next year for less than $30,000, a senior executive told Reuters on Monday.Nio has created the sub-brand Onvo to launch a new EV that Chief Executive William Li has said will take aim at the Tesla Model Y, the world's best-selling EV.With sales slowing at home, Several Chinese EV makers are expanding in Europe and they look to capitalise on their cost advantage against European rivals.\"Nio is currently working on the launch of new car brands, that would be less premium, still obviously 100% electric, and more suited for the European market needs,\" Nicolas Vincelot, general manager for France, said during a France-China business forum in Paris."},"EU clears $14.9 bln purchase of U.S. Steel by Japan's Nippon":{"img":null,"link":"https://www.reuters.com/markets/deals/eu-clears-nippon-steels-149-bln-purchase-us-steel-2024-05-06/","content":"T)New Tab, opens new tab on Monday, allaying competition concerns from a deal that has drawn political opposition in the United States.Steel should remain domestically owned, Republican front runner for the presidential race, Donald Trump said he would block the deal if elected.The European Commission said on Monday it cleared the deal given the companies' \"limited market positions resulting from the proposed transaction\".Steel shareholders voted in favor of the deal in April."},"Warren Buffett's successor Greg Abel seen preserving Berkshire's culture":{"img":null,"link":"https://www.reuters.com/business/warren-buffetts-successor-greg-abel-seen-preserving-berkshires-culture-2024-05-06/","content":"According to Berkshire’s succession planNew Tab, opens new tab, Abel will replace Buffett in making all major investment and capital allocation decisions.\"We have a very special company in Berkshire, but it's that culture that makes it special, and that's not going to change,\" Abel, who was designated Buffett's successor as chief executive in 2021, said at the shareholder meeting.Dan Sheridan, chief executive of Brooks Running, a maker of running shoes that is owned by Berkshire, said Abel advises his executives broadly, but keeps an eye on the bottom line.A 25-year Berkshire veteran, Vice Chairman Abel, 61, is expected by investors and analysts to uphold the $865 billion conglomerate's track record of investing in companies for the long haul and eschewing dividend payments to shareholders."},"Tesla lays off more staff in software, service teams, Electrek reports":{"img":null,"link":"https://www.reuters.com/business/autos-transportation/tesla-lays-off-more-staff-software-service-teams-electrek-reports-2024-05-06/","content":"Tesla disclosed last month that it expects to book more than $350 million in costs in the second quarter for the mass layoffs.May 6 (Reuters) - Electric-vehicle maker Tesla (TSLA.The move comes after the Elon Musk-led automaker disbanded its EV charging department following Tesla's announcement last month that it was reducing its global workforce by more than 10%.Tesla said in April it was working on \"new models\" that would use its current platforms and production lines - a move that is expected to let it better control capital expenditures."},"Microsoft readies new AI model to compete with Google, OpenAI, The Information reports":{"img":null,"link":"https://www.reuters.com/technology/microsoft-readies-new-ai-model-compete-with-google-openai-information-reports-2024-05-06/","content":"O)New Tab, opens new tab graphic processing units along with large amounts of data to improve the model, according to the report.The new model, internally referred to as MAI-1, is being overseen by recently hired Mustafa Suleyman, the Google DeepMind co-founder and former CEO of AI startup Inflection, the report said, citing two Microsoft employees with knowledge of the effort.O)New Tab, opens new tab is training a new, in-house AI language model large enough to compete with those from Alphabet's Google (GOOGL.The new model is not carried over from Inflection, although it may build on training data from the startup, the report added."},"Synopsys to sell software unit to Clearlake, Francisco in $2.1 bln deal":{"img":null,"link":"https://www.reuters.com/markets/deals/synopsys-sell-software-unit-clearlake-francisco-21-bln-deal-2024-05-06/","content":"O)New Tab, opens new tab will sell its software integrity (SIG) unit to a private equity consortium led by Clearlake Capital and Francisco Partners in a deal valued at $2.The SIG deal is expected to close in the second half of 2024 and will create a new standalone entity that provides application security testing software.Reuters reported last week that the private equity firms had prevailed over rivals and that their consortium was in advanced talks to acquire the SIG unit, which provides application security testing for software developers.O)New Tab, opens new tab for $35 billion, its largest-ever deal."},"Spirit Airlines forecasts weak Q2 revenue on slow growth in domestic demand":{"img":null,"link":"https://www.reuters.com/business/aerospace-defense/spirit-airlines-forecasts-weak-q2-revenue-slow-growth-domestic-demand-2024-05-06/","content":"N)New Tab, opens new tab forecast weak second-quarter revenue on Monday due to sluggish improvement in domestic demand and grounding of dozens of its aircraft, sending the company's shares down about 9% in early trade.PA)New Tab, opens new tab to postpone all aircraft deliveries scheduled from the second quarter of 2025 and planned to furlough about 260 pilots.The airline believes along with compensation for its grounded aircraft, deferred jet deliveries and cost savings will improve its cash levels by $450 million to $550 million in 2024, Spirit said on Monday.N)New Tab, opens new tab Pratt & Whitney Geared Turbofan engines, which have forced it to ground multiple aircraft and resulted in high labor expenses and reduced capacity."},"Etihad CEO considers buying small number of Airbus, Boeing jets":{"img":null,"link":"https://www.reuters.com/business/aerospace-defense/etihad-ceo-considers-buying-small-number-airbus-boeing-jets-2024-05-06/","content":"DUBAI, May 6 (Reuters) - Etihad Airways would consider buying a small number of aircraft from Airbus and Boeing over the next five years if delivery slots opened up, its chief executive said on Monday.The Abu Dhabi's carrier plans to grow its fleet of narrow and wide-body aircraft to 150 over the next five years, up from around 80 jets today, which would mean adding around 10-15 new aircraft each year.Most of those new aircraft will be added through existing orders for Airbus A320s and A350s and Boeing 787s but some would need to be sourced from the leasing market and planemakers.He said the airline was interested in buying new aircraft directly from planemakers through delivery slots that had been cancelled or rescheduled by other carriers."},"US utility Allete goes private in $6.2 bln deal":{"img":null,"link":"https://www.reuters.com/markets/deals/us-utility-allete-goes-private-62-bln-deal-2024-05-06/","content":"3 billion in clean energy initiatives and transmission projects by 2027.2 billion deal.\"This is a modest premium on several angles,\" said Guggenheim utilities research analysts, adding that this \"unique\" deal would not set a precedent for other go-private deals in the sector.investment management company Global Infrastructure Partners and Canadian pension fund CPP Investments were taking the clean energy company private in a $6."},"Robinhood Crypto gets Wells notice from US SEC":{"img":null,"link":"https://www.reuters.com/business/finance/robinhood-crypto-gets-wells-notice-us-sec-2024-05-06/","content":"The company said it received a so-called \"Wells notice,\" which the SEC issues when it is planning to bring enforcement action against them.Securities and Exchange Commission (SEC) on May 4 over crypto tokens traded on its platform.\"We firmly believe that the assets listed on our platform are not securities and we look forward to engaging with the SEC to make clear just how weak any case against Robinhood Crypto would be,\" Dan Gallagher, chief legal, compliance and corporate affairs officer at Robinhood, said.The SEC is engaged in a legal fight against Coinbase."},"Canada's Brookfield to invest $1.5 bln in private credit manager Castlelake":{"img":null,"link":"https://www.reuters.com/markets/deals/canadas-brookfield-invest-15-bln-private-credit-manager-castlelake-2024-05-06/","content":"Minneapolis-based Castlelake, which specializes in asset-based private credit, will continue to operate its business independently and retain its current leadership structure.This multi-trillion market has significant tailwinds that will help drive the growth of our $300 billion credit business over the next decade, Brookfield Credit CEO Craig Noble said in a statement.-based private credit manager Castlelake, the companies said on Monday.Private credit firms have become an increasingly popular source of capital for they do not face the tighter regulatory scrutiny as traditional lenders."},"Novavax's top shareholder Shah Capital ramps up efforts for board shakeup":{"img":null,"link":"https://www.reuters.com/business/healthcare-pharmaceuticals/novavaxs-top-shareholder-shah-capital-ramps-up-efforts-board-shakeup-2024-05-06/","content":"In April, Shah Capital nominated Suresh Katta, founder and CEO of biotech firm Saama, and Venkat Peri, CEO of Quantiva Health, to Novavax's eight-member board, saying the duo had the experience required to set the company's strategic direction.Shah Capital also plans to vote against three other proposals, including one related to the compensation of some of Novavax's executives.Last month, the top shareholder expressed concerns over mismanagement at the Maryland-based biotech and nominated two of its own candidates for the board.May 6 (Reuters) - Hedge fund Shah Capital on Monday urged Novavax (NVAX."},"EU approves $14.9 bln purchase of U.S. Steel by Japan's Nippon":{"img":null,"link":"https://www.reuters.com/markets/deals/road-nippons-149-billion-acquisition-us-steel-2023-12-18/","content":"Here's a timeline of recent events leading up to the deal between Japan's largest steelmaker and the company whose steel was used to build iconic structures such as the United Nations building in New York City and the New Orleans Superdome.T)New Tab, opens new tab, allaying competition worries, even as the deal faces regulatory scrutiny and political opposition in the U.N)New Tab, opens new tab $14.The deal, however, has been opposed by several U."}}