{"Massachusetts top court to hear challenges to gig worker ballot measures":{"img":null,"link":"https://www.reuters.com/legal/massachusetts-top-court-hear-challenges-gig-worker-ballot-measures-2024-05-06/","content":"The Massachusetts Supreme Judicial Court first will hear arguments in a labor-backed challenge to a ballot proposal by an industry-supported group that would ask voters to declare that the drivers for the companies are not employees but rather independent contractors entitled to some new benefits.The same court in 2022 blocked a similar industry-backed ballot measure, finding that it contained an unrelated proposal that ran afoul of a state constitutional requirement that ballot questions be limited to related subjects.If the industry-backed ballot measure passes but the state wins in the trial, Campbell's office has said the new law would control for the future but that Uber and Lyft could be subject to penalties for the past misclassification of their drivers.BOSTON, May 6 (Reuters) - The top Massachusetts court on Monday is set to consider whether the state's voters will get to decide two ballot proposals in November that would redefine the relationship between app-based companies like Uber Technologies (UBER."},"Focus: Denny's faces proxy vote over pig gestation crate pledge":{"img":null,"link":"https://www.reuters.com/business/dennys-faces-proxy-vote-over-pig-gestation-crate-pledge-2024-05-06/","content":"In exchange for the Humane Society’s withdrawal of the 2022 proposal, Denny’s published language on its website disclosing that roughly a third of its pork came from suppliers that at least limit the use of gestation crates.Known for its inexpensive breakfast menu, Denny’s in 2012 pledged to eliminate from its pork supply chain the use of gestation crates, which the Humane Society describes as solitary cages that “confine pigs so restrictively, they can’t even turn around.Denny’s amended its website’s language again following the 2024 Humane Society proposal to now read that it believes half of its pork could come from suppliers that limit gestation crates by 2028.The ISS said this is the first time Denny's had received a proposal regarding disclosing the percentage of group-housed pork in its supply chain, and phasing out gestation crates."},"Spirit Airlines forecasts weak Q2 revenue on slow growth in domestic demand":{"img":null,"link":"https://www.reuters.com/business/aerospace-defense/spirit-airlines-forecasts-weak-q2-revenue-slow-growth-domestic-demand-2024-05-06/","content":"N)New Tab, opens new tab forecast weak second-quarter revenue on Monday due to sluggish improvement in domestic demand and grounding of dozens of its aircraft.PA)New Tab, opens new tab to postpone all aircraft deliveries scheduled from the second quarter of 2025 and planned to furlough about 260 pilots.The airline believes along with compensation for its grounded aircraft, deferred jet deliveries and cost savings will improve its cash levels by $450 million to $550 million in 2024, Spirit said on Monday.It forecast second-quarter revenue between $1."},"Tyson Foods beats profit estimates on cost control efforts, sales slip":{"img":null,"link":"https://www.reuters.com/business/retail-consumer/tyson-foods-beats-profit-estimates-cost-control-efforts-sales-slip-2024-05-06/","content":"The company raised its adjusted operating income forecast for chicken to $700 million to $900 million from a previous outlook of $500 million to $700 million.That helped it post adjusted earnings of 62 cents per share for the second quarter, compared with analysts' average estimate of 39 cents, based on LSEG data.Tyson's total second-quarter net sales fell 0.meat company by sales has shuttered six chicken plants in four states since the start of last year, laid off corporate employees and announced plans to close a pork plant, in an attempt to rein in costs."},"EU clears Nippon Steel's $14.9 bln purchase of U.S. Steel":{"img":null,"link":"https://www.reuters.com/markets/deals/eu-clears-nippon-steels-149-bln-purchase-us-steel-2024-05-06/","content":"9 billion buyout by Japan's Nippon Steel (5401.Steel shareholders voted in favor of the deal in April.Steel will help Nippon, the world's fourth-largest steel maker, move toward 100 million metric tons of global crude steel capacity.Steel shares rose about 2% before the bell."},"Warren Buffett's successor Greg Abel seen preserving Berkshire's culture":{"img":null,"link":"https://www.reuters.com/business/warren-buffetts-successor-greg-abel-seen-preserving-berkshires-culture-2024-05-06/","content":"According to Berkshire’s succession planNew Tab, opens new tab, Abel will replace Buffett in making all major investment and capital allocation decisions.Dan Sheridan, chief executive of Brooks Running, a maker of running shoes that is owned by Berkshire, said Abel advises his executives broadly, but keeps an eye on the bottom line.\"We have a very special company in Berkshire, but it's that culture that makes it special, and that's not going to change,\" Abel, who was designated Buffett's successor as chief executive in 2021, said at the shareholder meeting.OMAHA, Nebraska, May 6 (Reuters) - When Greg Abel succeeds Warren Buffett at the helm of Berkshire Hathaway (BRKa."},"US utility Allete goes private in $6.2 bln deal":{"img":null,"link":"https://www.reuters.com/markets/deals/us-utility-allete-goes-private-62-bln-deal-2024-05-06/","content":"7 billion market valuation in December when Reuters reported that the company was exploring a sale, citing sources.3 billion in clean energy initiatives and transmission projects by 2027.2 billion deal.86 billion, marginally above its $3."},"Canada's Brookfield to invest $1.5 bln in private credit manager Castlelake":{"img":null,"link":"https://www.reuters.com/markets/deals/canadas-brookfield-invest-15-bln-private-credit-manager-castlelake-2024-05-06/","content":"Minneapolis-based Castlelake, which specializes in asset-based private credit, will continue to operate its business independently and retain its current leadership structure.This multi-trillion market has significant tailwinds that will help drive the growth of our $300 billion credit business over the next decade, Brookfield Credit CEO Craig Noble said in a statement.-based private credit manager Castlelake, the companies said on Monday.Private credit firms have become an increasingly popular source of capital for they do not face the tighter regulatory scrutiny as traditional lenders."},"Novavax's top shareholder Shah Capital ramps up efforts for board shakeup":{"img":null,"link":"https://www.reuters.com/business/healthcare-pharmaceuticals/novavaxs-top-shareholder-shah-capital-ramps-up-efforts-board-shakeup-2024-05-06/","content":"In April, Shah Capital nominated Suresh Katta, founder and CEO of biotech firm Saama, and Venkat Peri, CEO of Quantiva Health, to Novavax's eight-member board, saying the duo had the experience required to set the company's strategic direction.Shah Capital also plans to vote against three other proposals, including one that deals with the compensation of some of Novavax's executives.May 6 (Reuters) - Hedge fund Shah Capital on Monday urged Novavax (NVAX.The top shareholder had expressed concerns about mismanagement at the Maryland-based biotech and nominated two of its own candidates for the board last month."},"Trump Media dismisses auditor BF Borgers amid SEC fraud charges":{"img":null,"link":"https://www.reuters.com/technology/trump-media-dismisses-auditor-bf-borgers-amid-sec-fraud-charges-2024-05-06/","content":"Trump Media & Technology Group said in a filing with the SEC on Monday that it had switched to Semple, Marchal & Cooper on Saturday.Securities and Exchange Commission (SEC) charged the accounting firm with \"massive fraud\" on Friday.According to the SEC, Borgers did not properly maintain and audit documentation, fabricated audit planning meetings and in some cases, passed off previous audits for the current audit period.Borgers, the auditor of the Truth Social parent since 2022, agreed to a $12 million civil penalty and to discontinue practicing as accountants on SEC filings, the agency said."},"Explainer: What is at stake for sovereign debt bill as New York legislature reconvenes":{"img":null,"link":"https://www.reuters.com/business/finance/new-york-lawmakers-tackle-sovereign-debt-reworks-again-2024-03-11/","content":"NEW YORK, May 6 (Reuters) - New York State lawmakers return from a two-week break on Monday with a month left to decide the fate of a controversial bill that aims to streamline sovereign debt restructurings, with hundreds of billions of dollars in bond contracts on the line.The bill aims to strengthen \"the role of New York State as a primary location for the issuing and trading of sovereign debt.The proposed billNew Tab, opens new tab looks to \"provide effective mechanisms for restructuring sovereign and subnational debt\" and the rewrite of this state law would retroactively affect sovereign debt contracts and its holders across the world.The bill could also trigger legal challenges and lead to the migration of sovereign debt away from New York to other jurisdictions according to law firm Cleary GottliebNew Tab, opens new tab, which has advised both sovereigns and creditors in debt restructurings."},"Kretinsky and Layani face off on Atos restructuring as board ditches Bain offer":{"img":null,"link":"https://www.reuters.com/markets/deals/atos-says-it-received-four-restructuring-offers-2024-05-06/","content":"PARIS, May 6 (Reuters) - Czech billionaire Daniel Kretinsky, French investor David Layani, and a consortium of banks have all filed bids to restructure the debt of French IT company Atos, it said on Monday, adding it had already rejected an offer from Bain Capital.Deep-pocketed Kretinsky, who recently took over French supermarket chain Casino in a similar debt restructuring deal, has teamed up with investment fund Attestor, offering to inject 600 million euros in equity and provide a total of 1.The offer would allow for a total new capital injection of up to 500 million euros.The company said in a statement issued before the Paris stock exchange opened that it would decide which offer to pursue by the end of the month, while also negotiating the planned takeover of its cybersecurity, military communication and supercomputing assets by the French state."},"Maersk says Red Sea disruption could cut Asia-Europe capacity by 20%":{"img":null,"link":"https://www.reuters.com/business/red-sea-disruption-cuts-q2-capacity-by-15-20-maersk-says-2024-05-06/","content":"The disruptions cause ripple effects across several other container freight routes, particularly from Asia to the east and west coasts of South America, Maersk's spokesperson said, adding that the Red Sea situation was complex and continued to evolve.CO)New Tab, opens new tab said on Monday, forecasting this will cut the industry's capacity between Asia and Europe by up to 20% in the second quarter.By routing traffic away from the Suez Canal, Maersk estimated that the container industry's capacity between Asia and northern Europe and the Mediterranean would be cut by between 15% and 20% in the second quarter.COPENHAGEN, May 6 (Reuters) - Disruption to Red Sea container shipping is rising, Maersk (MAERSKb."},"VP Harris announces more than $100 mln to support auto workers":{"img":null,"link":"https://www.reuters.com/world/us/vp-harris-announces-more-than-100-mln-support-auto-workers-2024-05-06/","content":"Historic contracts secured by the United Auto Workers with the Big Three Detroit automakers and recent organizing victories ensure that these jobs will provide comparable wages, retirement security and respect at work, the office of the VP said in a statement.Vice President Kamala Harris on Monday announced more than $100 million in funding and resources to support American auto workers and small auto suppliers."},"KKR to buy India's Healthium Medtech at $839 mln valuation, sources say":{"img":null,"link":"https://www.reuters.com/markets/deals/kkr-buy-indias-healthium-medtech-839-mln-valuation-sources-say-2024-05-06/","content":"N)New Tab, opens new tab will buy Indian medical devices maker Healthium Medtech (HEAT.NS)New Tab, opens new tab from UK-based Apax Partners in a deal that three sources with direct knowledge of the matter say is valued at 70 billion rupees ($838.The acquisition marks KKR's latest investment in the Indian healthcare sector, with the firm already holding stakes in Indian drugmaker J B Chemicals and Pharmaceuticals (JBCH.NS)New Tab, opens new tab and generic injectables maker Gland Pharma (GLAD."},"Exclusive: Colombia's Ecopetrol exploring participation in offshore wind auction":{"img":null,"link":"https://www.reuters.com/business/energy/colombias-ecopetrol-exploring-participation-offshore-wind-auction-2024-05-06/","content":"\"Ecopetrol is carrying out the technical, economic and legal analyses of its potential participation in the offshore wind auction process,\" the company told Reuters in a statement in response to questions about its participation.CN)New Tab, opens new tab is analyzing its potential direct participation in the Andean country's first-ever offshore wind auction, the company said in a statement to Reuters.Public or mixed-ownership companies that later join private company bids are not subject to evaluation at the qualification stage under the terms of the auction.\"Participating in the offshore wind auction will allow us to access reliable renewable energy to leverage the entry of green hydrogen projects and their derivatives,\" the statement added."},"Volvo Cars April sales rise on strong EV demand":{"img":null,"link":"https://www.reuters.com/business/autos-transportation/volvo-cars-april-sales-rise-27-year-on-year-2024-05-06/","content":"ST)New Tab, opens new tab sales rose 27% in April from a year earlier to 65,838 cars, boosted by demand for electric and hybrid vehicles, the Sweden-based group said on Monday.Sales in Europe, Volvo Cars' biggest market, jumped 65% compared to the same period last year, reaching 34,238 cars, with the company's fully electric small SUV, EX30, driving sales, Volvo Cars added.In the United States, total sales rose 10%, primarily driven by an 89% increase in plug-in hybrid car sales, Volvo Cars said.Meanwhile, sales in China were down 3% compared to the same period last year."},"Loews reports higher profit on strong returns on investment income":{"img":null,"link":"https://www.reuters.com/business/loews-reports-higher-profit-strong-returns-investment-income-2024-05-06/","content":"Investment income for the New York-based company rose to $669 million in the quarter ended March 31, from $569 million a year earlier.The income attributable to Loews in the reported quarter was $457 million, or $2.N)New Tab, opens new tab on Monday reported a near 22% jump in first-quarter profit compared with the previous year, helped by higher premiums and strong returns on its investments.\"CNA continues to experience strong profitable growth, reporting its highest ever first-quarter core income,\" said James S."},"Shipping firms respond to Houthi attacks in Red Sea":{"img":null,"link":"https://www.reuters.com/world/middle-east/shipping-firms-avoid-red-sea-houthi-attacks-increase-2023-12-18/","content":"DE)New Tab, opens new tabThe German container shipping line said on March 14 the Red Sea disruptions and global vessel oversupply would force it to cut expenses in 2024, including adapting sailings.S)New Tab, opens new tabSwiss logistics group Kuehne + Nagel said on March 1 it expects the impact from the Red Sea crisis to last into the coming quarters and impact its Q2 EBIT in a low double-digit million Swiss francs range.T)New Tab, opens new tabJapan's biggest shipper by sales suspended navigation through the Red Sea for all vessels it operates, a spokesperson told Reuters on Jan.The French shipping group has suspended most Red Sea voyages but is still sending some cargoes on a case by case basis when French navy escorts were possible, Chairman and CEO Rodolphe Saade said on Feb."}}