{"Exclusive: Disney and Comcast seek advisor to resolve Hulu valuation, sources say":{"img":null,"link":"https://www.reuters.com/business/media-telecom/disney-comcast-seek-advisor-resolve-hulu-valuation-sources-say-2024-05-06/","content":"\"In regulatory filings last year, Disney and Comcast had outlined that if the valuation reached by their two banks were within 10% of each other, a deal will be consummated at a valuation that is the average of the two appraisals.As per the terms of the agreement, if the third appraisal is closest to the valuation of that produced by Disney's bank, the average of those two valuations will be the value at which the deal gets done.Similarly, if the third appraisal is closest to the valuation of that produced by Comcast's bank, the average of those two valuations is the value at which the deal gets done.Since the two appraisals are more than 10% apart, Comcast and Disney are jointly in talks to pick a third bank to do an independent appraisal, the sources said."},"Warren Buffett's fans plot their own course for when he leaves":{"img":null,"link":"https://www.reuters.com/business/warren-buffetts-fans-plot-their-own-course-when-he-leaves-2024-05-06/","content":"OMAHA, Nebraska, May 6 (Reuters) - Warren Buffett, the 93-year-old billionaire chief of Berkshire Hathaway, mulled his future in telling shareholders on Saturday that if he were lucky, he would have another six or seven years but added that \"it could end tomorrow.\"Tens of thousands of shareholders, who over the weekend made their pilgrimage to see the Oracle of Omaha in person at Berkshire's annual shareholder meeting, hope it doesn't end that soon.\"Yes, I will be back if Warren Buffett isn't here because I will wonder about Berkshire Hathaway's future,\" said Gyuhwan Kim, 26, a software engineer from South Korea who got in line at 3:30 a.\"The crowds will be smaller when Buffett isn't here, but the company will still do well,\" said Jason Garner, a 20-year-old student from Queens University in Kingston, Ontario."},"NY Fed survey finds Americans bracing for higher housing costs":{"img":null,"link":"https://www.reuters.com/markets/us/ny-fed-survey-finds-americans-bracing-higher-housing-costs-2024-05-06/","content":"As part of its latest Survey of Consumer ExpectationsNew Tab, opens new tab, the regional Fed bank found that respondents at the start of the year saw higher near-term increases for both rent and home prices, although they do see some relief over the longer haul for home prices.The New York Fed report also noted that high mortgage rates now are locking homeowners into houses that currently enjoy the low rates seen during the coronavirus pandemic.Households also see no relief on home borrowing costs and are in fact bracing for the highest levels of mortgage rates in a survey that dates back to 2014.May 6 (Reuters) - Americans are once again bracing for another round of higher housing costs, amid rising expectations by renters that they'll never be able to buy a house, the Federal Reserve Bank of New York said on Monday."},"Boeing's Starliner capsule set for first crewed space flight, to compete with SpaceX":{"img":null,"link":"https://www.reuters.com/science/boeings-new-starliner-capsule-set-first-crewed-flight-space-station-2024-05-06/","content":"The gumdrop-shaped capsule and its crew are headed for a rendezvous with the International Space Station (ISS), two years after the Starliner completed its first test voyage to the orbital laboratory without astronauts aboard.N)New Tab, opens new tab new Starliner astronaut capsule was poised for launch on Monday night on a much-delayed first crewed test flight to orbit, as the company scrambles to compete with Elon Musk's SpaceX for a greater share of lucrative NASA business.At a pre-flight briefing with NASA officials on Friday, Boeing vice president Mark Nappi said the company and the space agency were \"in total agreement\" that the Starliner was ready to fly with crew, adding, \"we can't be more confident.While Boeing has struggled, SpaceX has become a dependable taxi to orbit for NASA, which is backing a new generation of privately built spacecraft that can ferry its astronauts and other customers to the ISS and, under the space agency's more ambitious Artemis program, to the moon and eventually Mars."},"Tesla lays off more staff in software, service teams, Electrek reports":{"img":null,"link":"https://www.reuters.com/business/autos-transportation/tesla-lays-off-more-staff-software-service-teams-electrek-reports-2024-05-06/","content":"The company disclosed in notices last month that it will lay off more than 6,700 employees across its locations in Texas, California, Nevada and New York.Tesla disclosed last month it expects to book more than $350 million in costs in the second quarter for the mass layoffs.The move comes after the Elon Musk-led automaker disbanded its EV charging department following Tesla's announcement last month that it was reducing its global workforce by more than 10%.O)New Tab, opens new tab has laid off staff from the software, service and engineering departments, tech publication Electrek reported on Monday, citing sources familiar with the matter."},"EU clears $14.9 bln purchase of U.S. Steel by Japan's Nippon":{"img":null,"link":"https://www.reuters.com/markets/deals/eu-clears-nippon-steels-149-bln-purchase-us-steel-2024-05-06/","content":"T)New Tab, opens new tab on Monday, allaying competition concerns from a deal that has drawn political opposition in the United States.Steel should remain domestically owned, Republican front runner for the presidential race, Donald Trump said he would block the deal if elected.Steel shareholders voted in favor of the deal in April.The European Commission said on Monday it cleared the deal given the companies' \"limited market positions resulting from the proposed transaction\"."},"US financial markets watchdog to collect data on bilateral repo":{"img":null,"link":"https://www.reuters.com/markets/us/us-financial-markets-watchdog-collect-data-bilateral-repo-2024-05-06/","content":"The OFR's permanent data collection will shine a spotlight into this opaque corner of the financial market, provide high-quality data on (non-centrally cleared bilateral repo) transactions, and remove a significant blind spot for financial regulators,\" it said.By establishing data collection for non-centrally cleared bilateral transactions, regulators want to improve visibility into this opaque but vital funding market for Wall Street.Treasury Department-based research powerhouse, said on Monday it has adopted a final rule that will allow it to collect data on certain transactions in the repurchase agreement (repo) market.\"The collected data will be used to support the work of the Financial Stability Oversight Council, its member agencies, and the OFR to identify and monitor risks to financial stability,\" the OFR said in a statement.\""},"Tyson Foods shares sink on worries over consumer demand, third quarter":{"img":null,"link":"https://www.reuters.com/business/retail-consumer/tyson-foods-beats-profit-estimates-cost-control-efforts-sales-slip-2024-05-06/","content":"Tyson raised the chicken unit's income outlook in the first such increase after the second quarter in seven years, JP Morgan said in a note.Improvement in the chicken business on Monday prompted Tyson to lift its estimate for total adjusted operating income in fiscal year 2024 to $1.Tyson has worked to turn around its chicken business for years but struggled with excess supply in 2023.High commodity costs could weigh on third-quarter results in prepared foods, said Melanie Boulden, the unit's president."},"Aldi urges suppliers to cut costs and go green amid U.S. expansion":{"img":null,"link":"https://www.reuters.com/business/retail-consumer/aldi-urges-suppliers-cut-costs-go-green-amid-us-expansion-2024-05-06/","content":"Over 90% of productsNew Tab, opens new tab sold by Aldi are private-label, placing the supermarket chain in intense competition with rival grocers expanding their own private-label food brands.N)New Tab, opens new tab is adding hundreds of new items to its \"Favorite Day\" and \"Good & Gather\" private-label food brands.N)New Tab, opens new tab last week debuted a private-label food line of 300 items with 70% priced under $5.N)New Tab, opens new tab in March said it planned to add more than 800 items to its \"Our Brands\" private-label products, while Target (TGT."},"US financial regulators restart work on long-delayed compensation rules":{"img":null,"link":"https://www.reuters.com/business/finance/us-financial-regulators-restart-work-long-delayed-compensation-rules-2024-05-06/","content":"financial regulators have resumed work on a long-delayed rule-writing project to make executive compensation plans at financial firms more sensitive to risk.A Fed spokesperson said on Monday the central bank is committed to working with regulators on a joint rule, but it should be considered with updated information reflecting current industry practices.\"When poor compensation practices involve the largest financial institutions, the negative impacts of inappropriate risk-taking can have broader consequences for the financial system,\" FDIC Chairman Martin Gruenberg said in a statement, noting that poor compensation practices were among issues identified in the failure of Silicon Valley Bank last year.The renewed effort, which is a repeat of a 2016 proposal, marks the latest attempt in a years-long effort to adopt new rules prescribed as part of the 2010 Dodd-Frank financial reform law."},"Fewer low-income Americans took out mortgages in 2023, study says":{"img":null,"link":"https://www.reuters.com/markets/us/fewer-low-income-americans-took-out-mortgages-2023-study-says-2024-05-06/","content":"May 6 (Reuters) - Fewer low-income Americans took out mortgage loans last year than 2020, real estate broker Redfin (RDFN.6% of new mortgages issued last year went to low-income Americans, down from 23.The median household income in the HMDA data for low-income households was $64,000.\"Somewhat ironically, the continued strength of the economy has made it harder to afford a home and widened the real-estate wealth gap between rich and poor Americans,\" Redfin Senior Economist Elijah de la Campa said."},"Fed's Williams says next Fed move likely to be lower rates":{"img":null,"link":"https://www.reuters.com/markets/rates-bonds/feds-williams-says-next-fed-move-likely-be-lower-rates-2024-05-06/","content":"May 6 (Reuters) - Federal Reserve Bank of New York President John Williams said Monday that at some undefined point the U.Williams did not offer a time table for action but he said the economy was overall moving back into better balance, amid a shift to a slower rate of growth.\"Eventually we'll have rate cuts\" but for now monetary policy is in a \"very good place,\" Williams said in comments made before the Milken Institute 2024 Global Conference in Beverly Hills, California.The comments Monday followed last week's Federal Open Market Committee meeting."},"Nio on track to unveil its first mass-market car in May, executive says":{"img":null,"link":"https://www.reuters.com/business/autos-transportation/nio-track-unveil-its-first-mass-market-car-may-executive-says-2024-05-06/","content":"PARIS, May 6 (Reuters) - China's premium electric vehicle maker Nio is on track to unveil a new model under a mass-market brand by the end of this month and a second smaller EV to be sold in Europe next year for less than $30,000, a senior executive told Reuters on Monday.Nio has created the sub-brand Onvo to launch a new EV that Chief Executive William Li has said will take aim at the Tesla Model Y, the world's best-selling EV.With sales slowing at home, Several Chinese EV makers are expanding in Europe and they look to capitalise on their cost advantage against European rivals.On Monday, the new website for the Onvo brand went live in China with a message to \"stay tuned\" for details on the new model, the L60."},"Focus: Denny's faces proxy vote over pig gestation crate pledge":{"img":null,"link":"https://www.reuters.com/business/dennys-faces-proxy-vote-over-pig-gestation-crate-pledge-2024-05-06/","content":"In exchange for the Humane Society’s withdrawal of the 2022 proposal, Denny’s published language on its website disclosing that roughly a third of its pork came from suppliers that at least limit the use of gestation crates.Known for its inexpensive breakfast menu, Denny’s in 2012 pledged to eliminate from its pork supply chain the use of gestation crates, which the Humane Society describes as solitary cages that “confine pigs so restrictively, they can’t even turn around.Denny’s amended its website’s language again following the 2024 Humane Society proposal to now read that it believes half of its pork could come from suppliers that limit gestation crates by 2028.The ISS said this is the first time Denny's had received a proposal regarding disclosing the percentage of group-housed pork in its supply chain, and phasing out gestation crates."},"Fed's Barkin: Ending inflation likely to require a hit to demand":{"img":null,"link":"https://www.reuters.com/markets/rates-bonds/feds-barkin-current-rate-level-will-cool-demand-doesnt-see-overheating-2024-05-06/","content":"\"We got a lot of benefit last year on the supply side,\" Barkin said, noting a rise in immigration and a jump in productivity as forces that allowed the economy to grow fast and add jobs while allowing inflation to fall quickly.Barkin said he still viewed demand in the economy as strong, but added that the sort of slowdown needed to finish the Fed's inflation battle needn't be all that deep.COLUMBIA, South Carolina, May 6 (Reuters) - Finishing the battle against inflation will likely require a hit to demand, after a year in which U.But with the pace of price increases possibly stalled at a rate above the Fed's target, \"I do tend to imagine that we're going to need a little more edge off of demand to get all the way\" back to target, Barkin said in comments to reporters after an event at the Columbia Rotary Club."},"Warren Buffett's successor Greg Abel seen preserving Berkshire's culture":{"img":null,"link":"https://www.reuters.com/business/warren-buffetts-successor-greg-abel-seen-preserving-berkshires-culture-2024-05-06/","content":"According to Berkshire’s succession planNew Tab, opens new tab, Abel will replace Buffett in making all major investment and capital allocation decisions.Dan Sheridan, chief executive of Brooks Running, a maker of running shoes that is owned by Berkshire, said Abel advises his executives broadly, but keeps an eye on the bottom line.\"We have a very special company in Berkshire, but it's that culture that makes it special, and that's not going to change,\" Abel, who was designated Buffett's successor as chief executive in 2021, said at the shareholder meeting.OMAHA, Nebraska, May 6 (Reuters) - When Greg Abel succeeds Warren Buffett at the helm of Berkshire Hathaway (BRKa."},"Massachusetts top court hears challenges to gig worker ballot measures":{"img":null,"link":"https://www.reuters.com/legal/massachusetts-top-court-hear-challenges-gig-worker-ballot-measures-2024-05-06/","content":"\"The state high court in 2022 blocked a similar industry-backed ballot measure over a provision it deemed unrelated to the proposal.O)New Tab, opens new tab, have spent millions of dollars to support the ballot proposal that would cement the status of their drivers as contractors under state law.Massachusetts Supreme Judicial Court justices expressed concern, during oral arguments in Boston, over parts of an industry-supported group's proposal to ask voters to affirm that under state law, drivers are independent contractors with some new benefits but cannot be considered company employees.\"The justices appeared likely to reject a conservative group's argument that the state attorney general wrongly certified a competing measure for inclusion on the ballot."},"Microsoft readies new AI model to compete with Google, OpenAI, The Information reports":{"img":null,"link":"https://www.reuters.com/technology/microsoft-readies-new-ai-model-compete-with-google-openai-information-reports-2024-05-06/","content":"O)New Tab, opens new tab graphic processing units along with large amounts of data to improve the model, according to the report.The new model is not carried over from Inflection, although it may build on training data from the startup, the report added.The new model, internally referred to as MAI-1, is being overseen by recently hired Mustafa Suleyman, the Google DeepMind co-founder and former CEO of AI startup Inflection, the report said, citing two Microsoft employees with knowledge of the effort.O)New Tab, opens new tab is training a new, in-house AI language model large enough to compete with those from Alphabet's Google (GOOGL."},"Synopsys to sell software unit to Clearlake, Francisco in $2.1 bln deal":{"img":null,"link":"https://www.reuters.com/markets/deals/synopsys-sell-software-unit-clearlake-francisco-21-bln-deal-2024-05-06/","content":"O)New Tab, opens new tab will sell its software integrity (SIG) unit to a private equity consortium led by Clearlake Capital and Francisco Partners in a deal valued at $2.The SIG deal is expected to close in the second half of 2024 and will create a new standalone entity that provides application security testing software.Reuters reported last week that the private equity firms had prevailed over rivals and that their consortium was in advanced talks to acquire the SIG unit, which provides application security testing for software developers.O)New Tab, opens new tab for $35 billion, its largest-ever deal."}}