{"Apple working on AI chips for data centers, WSJ reports":{"img":null,"link":"https://www.reuters.com/technology/apple-working-ai-chips-data-centers-wsj-reports-2024-05-07/","content":"The project, internally codenamed as Project ACDC (Apple Chips in Data Center), aims to leverage Apple's chip design expertise for its server infrastructure, the report said.For Apple's server chip, the component will likely be focused on running AI models, also known as inference, rather than in training AI models, the report said.O)New Tab, opens new tab is developing its own chip to run artificial intelligence software in data centers, the Wall Street Journal reported on Monday, citing people familiar with the matter.Apple, which has been falling behind its competitors on AI, has been evading questions about its plans for the technology."},"Asia shares rise on rate cut bets; Aussie slips on RBA":{"img":null,"link":"https://www.reuters.com/markets/global-markets-wrapup-1-2024-05-07/","content":"interest rate cuts, while a weaker yen and a small dip in the Australian dollar kept the dollar steady.4% and the Australian stock market rose as policymakers did not strengthen guidance around the risk of another rate hike.Demand will be tested at a $58 billion three-year note auction on Tuesday, which is followed by $42 billion in 10-year sales on Wednesday and $25 billion of 30-year sales on Thursday.N225)New Tab, opens new tab rose 1."},"Boeing Starliner capsule's first crewed test flight postponed over Atlas rocket glitch":{"img":null,"link":"https://www.reuters.com/science/boeings-new-starliner-capsule-set-first-crewed-flight-space-station-2024-05-06/","content":"Selected to ride aboard Starliner for its first crewed flight were two NASA veterans who have logged a combined 500 days in space over the course of two previous missions each to the space station.Its latest flight was scrubbed with less than two hours left in the countdown as the capsule stood poised for blastoff from NASA's Kennedy Space Center in Florida atop an Atlas V rocket furnished by United Launch Alliance (ULA), a Boeing-Lockheed Martin (LMT.It comes two years after the gumdrop-shaped capsule completed its first test flight to the orbital laboratory without humans aboard.Ironically, the flight would mark the first crewed voyage to space using an Atlas rocket since the storied series of launch vehicles first sent astronauts, including John Glenn, on orbital flights for NASA's Mercury program in the 1960s."},"Exclusive: Disney and Comcast seek advisor to resolve Hulu valuation, sources say":{"img":null,"link":"https://www.reuters.com/business/media-telecom/disney-comcast-seek-advisor-resolve-hulu-valuation-sources-say-2024-05-06/","content":"\"In regulatory filings last year, Disney and Comcast had outlined that if the valuation reached by their two banks were within 10% of each other, a deal will be consummated at a valuation that is the average of the two appraisals.As per the terms of the agreement, if the third appraisal is closest to the valuation of that produced by Disney's bank, the average of those two valuations will be the value at which the deal gets done.Similarly, if the third appraisal is closest to the valuation of that produced by Comcast's bank, the average of those two valuations is the value at which the deal gets done.Since the two appraisals are more than 10% apart, Comcast and Disney are jointly in talks to pick a third bank to do an independent appraisal, the sources said."},"Exclusive: China's Nio turns to rival BYD to power new EV brand, sources say":{"img":null,"link":"https://www.reuters.com/business/autos-transportation/chinas-nio-turns-rival-byd-power-new-ev-brand-sources-say-2024-05-07/","content":"HK)New Tab, opens new tab, already a Nio supplier, will supply the brand with a larger battery pack of 85 kilowatt hours, one of the people said.BYD will join CATL to supply a smaller battery pack for one version of the new Onvo EV, two of the people said.O)New Tab, opens new tab Berlin plant and state-owned Chinese automakers including FAW (SASAJC.Chinese EV buyers have been more willing than car buyers in other markets to opt for lower-range batteries in exchange for lower cost, in part because of the availability of battery swapping stations of the kind run by Nio and charging locations."},"Morning Bid: Rates relief; harvest gloom":{"img":null,"link":"https://www.reuters.com/markets/europe/global-markets-view-europe-2024-05-07/","content":"Chicago corn climbed for a fifth session in a row, touching its highest for the year so far and wheat touched a nine-month high as adverse weather roils the outlook.MIAPJ0000PUS)New Tab, opens new tab hit a 15-month high.Australia's central bank left interest rates on hold, as expected, though it said the inflation rate remains high and is falling slower than expected.HSI)New Tab, opens new tab was set to snap a 10-day winning streak on Tuesday with a modest drop, it is nearly 15% above last month's lows."},"UBS reports first profit since taking over Credit Suisse":{"img":null,"link":"https://www.reuters.com/business/finance/ubs-reports-first-profit-since-taking-over-credit-suisse-2024-05-07/","content":"The group's wealth management arm reported $27 billion in net new assets for the first quarter of the year, compared to $22 billion for the three months prior.The net income attributable to shareholders for Switzerland's largest bank was better than a company-provided consensus estimate of $602 million and compares with a profit of $1 billion in the same period a year earlier.8 billion for January-March, its first quarterly profit since it took over fallen rival Credit Suisse.\"In the second quarter of 2024, we expect a low-to-mid single-digit decline in net interest income in Global Wealth Management,\" the bank said in a statement."},"US FAA opens probe into Boeing 787 inspections":{"img":null,"link":"https://www.reuters.com/business/aerospace-defense/faa-opens-new-investigation-into-boeing-wsj-reports-2024-05-06/","content":"Stocker said in the email that after receiving the report, \"we quickly reviewed the matter and learned that several people had been violating Company policies by not performing a required test, but recording the work as having been completed.In the email, Stocker said that an employee saw what appeared to be an irregularity in a required 787 conformance test.Asked for comment, Boeing provided an April 29 email from Scott Stocker, who leads the company's 787 program, to employees in South Carolina where the 787 is assembled.\"Boeing said in April it expects a slower increase in the production rate and deliveries of its 787 Dreamliner widebody jets as the company wrestles with supplier shortages \"on a few key parts.”"},"Amazon to spend nearly $9 bln to expand cloud infra in Singapore":{"img":null,"link":"https://www.reuters.com/technology/amazon-spend-9-bln-expand-cloud-infra-singapore-bloomberg-news-reports-2024-05-07/","content":"88 billion) over the next four years to expand its cloud computing infrastructure in Singapore, Amazon Web Services (AWS) said on Tuesday.The company had previously announced a $5 billion investment in Thailand and a $6 bln spend in Malaysia.5 billion the company has poured into the Asia Pacific Region until 2023, bringing its total planned spend to more than S$23 billion by 2028, AWS said in a statement.\"AWS is doubling down on its cloud infrastructure investments in Singapore from 2024 to 2028 to support customer demand, and help reinforce Singapore’s status as an attractive regional innovation launchpad,\" AWS Country Manager Priscilla Chong said."},"Tesla lays off more staff in software, service teams, Electrek reports":{"img":null,"link":"https://www.reuters.com/business/autos-transportation/tesla-lays-off-more-staff-software-service-teams-electrek-reports-2024-05-06/","content":"The company disclosed in notices last month that it will lay off more than 6,700 employees across its locations in Texas, California, Nevada and New York.Tesla disclosed last month it expects to book more than $350 million in costs in the second quarter for the mass layoffs.The move comes after the Elon Musk-led automaker disbanded its EV charging department following Tesla's announcement last month that it was reducing its global workforce by more than 10%.The company said in April it was working on \"new models\" that would use its current platforms and production lines - a move that is expected to let it better control capital expenditures."},"UBS reports $1.76 billion profit attributable to shareholders in Q1":{"img":null,"link":"https://www.reuters.com/business/finance/ubs-reports-176-billion-profit-attributable-shareholders-q1-2024-05-07/","content":"S)New Tab, opens new tab on Tuesday reported a profit of $1.76 billion attributable to shareholders in the first quarter, more than double the expected profit of $602 million forecast by analysts in a company-provided poll."},"Warren Buffett's fans plot their own course for when he leaves":{"img":null,"link":"https://www.reuters.com/business/warren-buffetts-fans-plot-their-own-course-when-he-leaves-2024-05-06/","content":"OMAHA, Nebraska, May 6 (Reuters) - Warren Buffett, the 93-year-old billionaire chief of Berkshire Hathaway, mulled his future in telling shareholders on Saturday that if he were lucky, he would have another six or seven years but added that \"it could end tomorrow.\"Tens of thousands of shareholders, who over the weekend made their pilgrimage to see the Oracle of Omaha in person at Berkshire's annual shareholder meeting, hope it doesn't end that soon.\"The crowds will be smaller when Buffett isn't here, but the company will still do well,\" said Jason Garner, a 20-year-old student from Queens University in Kingston, Ontario.\"Yes, I will be back if Warren Buffett isn't here because I will wonder about Berkshire Hathaway's future,\" said Gyuhwan Kim, 26, a software engineer from South Korea who got in line at 3:30 a."},"Wall Street closes higher for third session on rate cut optimism":{"img":null,"link":"https://www.reuters.com/markets/us/futures-edge-higher-rate-cut-bets-2024-05-06/","content":"Meanwhile, Federal Reserve Bank of New York President John Williams said while rate cuts would happen, monetary policy was currently in a very good place.Richmond Fed President Thomas Barkin said the current interest rate level should cool the economy enough to return inflation to the central bank's 2% target, with the strength of the job market giving officials time to wait.stock indexes closed higher on Monday, their third straight session of advances, as investors continued to gain hope that there was a greater chance of the Federal Reserve cutting interest rates this year.After the Fed last week signaled it was leaning towards eventual reductions in borrowing costs, but wanted to gain \"greater confidence\" that inflation will continue to fall before cutting rates, policymakers reiterated that message on Monday."},"Federal judge sends FedEx contractor's racketeering claim to arbitration":{"img":null,"link":"https://www.reuters.com/legal/federal-judge-sends-fedex-contractors-racketeering-claim-arbitration-2024-05-07/","content":"PYNQ asked the court to determine that its relationship with FedEx Ground is that of an employee rather than a contractor, and reserved the right to pursue the case as a class action.14 in federal court in Northern California, alleging that it engages in a systemic pattern of illegal and wrongful business practices that violate U.The case appeared to be the first where a former FedEx Ground contractor has sued the global delivery giant under the U.If the court had determined that FedEx Ground's roughly 6,000 contractors are employees, it could have driven up its labor costs and threatened the delivery giant's ongoing efforts to slash costs."},"Boeing Starliner capsule's first crewed flight delayed over rocket glitch":{"img":null,"link":"https://www.reuters.com/science/boeings-new-starliner-set-first-crewed-flight-space-station-2024-05-06/","content":"N> long-awaited first crewed test flight of the new Starliner space capsule was called off for at least 24 hours over a technical issue that launch teams could not resolve in time for the planned Monday night lift-off.May 20, 2022 - The new Starliner crew capsule docked for the first time with the International Space Station.N)New Tab, opens new tab new Starliner astronaut capsule was set for its first crewed test flight on Monday night, following numerous delays.June 1, 2023 - Boeing says it is standing down from late preparations for its first crewed Starliner test flight to space, which was planned for July 2023, after it discovered two safety-critical issues with the spacecraft."},"Macquarie eyes rise of protectionism in upcoming US, EU elections":{"img":null,"link":"https://www.reuters.com/business/finance/macquarie-eyes-rise-protectionism-upcoming-us-eu-elections-2024-05-07/","content":"Wikramanayake said it was likely incumbent Indian Prime Minister Narendra Modi would win re-election but European Parliament elections next month and U.and European Union elections this year is a risk for business and is being closely watched by global financial conglomerate Macquarie Group (MQG.\"The outcomes there could impact what we're seeing in the world, whether people are focused on multilateral relationships and trade or more inwardly focused,\" she said at the Macquarie Australia Conference in Sydney.\"SYDNEY, May 7 (Reuters) - The potential for protectionist policies to win out in U."},"Coty posts Q3 revenue beat, aims for upper end of 2024 targets on strong demand":{"img":null,"link":"https://www.reuters.com/business/retail-consumer/coty-beats-q3-revenue-estimates-eyes-high-end-annual-targets-strong-demand-2024-05-06/","content":"N)New Tab, opens new tab beat Wall Street expectations for third-quarter revenue on Monday and said it expects to achieve the high end of its annual targets, riding on steady global demand for its luxury and mass-market products.PA)New Tab, opens new tab, which reported a rise in first-quarter like-for-like sales on the back of strong demand for mass market and dermatological products, had flagged weakness in the luxury segment.Total third-quarter net revenue at Coty rose 7.Coty's third-quarter e-commerce revenue growth was nearly 20%, helped by new launches such as Cosmic Kylie Jenner and Marc Jacobs Daisy."},"Oil climbs after Israel strikes Gaza, truce talks continue":{"img":null,"link":"https://www.reuters.com/business/energy/oil-edges-up-after-israel-strikes-gaza-while-truce-talks-continue-2024-05-07/","content":"crude oil and product stockpiles were expected to have fallen last week, a preliminary Reuters poll showed on Monday.A lack of settlement between the parties in the now seven-month long conflict has supported oil prices, as investors worry regional escalation of the war will disrupt Middle Eastern crude supplies.The world's top exporter hiked its flagship Arab Light crude oil price to Asia to $2.Meanwhile, a stronger dollar capped gains in oil futures as it makes crude more expensive for traders holding other currencies."},"Yen weakens despite intervention threat, Aussie eases after RBA":{"img":null,"link":"https://www.reuters.com/markets/currencies/yen-eases-despite-intervention-threat-aussie-steady-before-rba-2024-05-07/","content":"TOKYO, May 7 (Reuters) - The yen continued to drift lower against the dollar on Tuesday as gaping interest rate differentials weighed on the currency, despite fresh warnings from Japanese officials following two rounds of suspected dollar-selling intervention last week.At the same time, DBS analysts estimate that even after last week's bounce, the yen is still the most undervalued currency in the G-10 grouping, while the dollar remains \"highly overvalued\".The carry trade remains a draw, with a Federal Reserve rate cut likely to take some time and the BOJ following a cautious approach to tightening after its first rate hike since 2007 in March, leaving a vast gap of 370 basis points between ultra-low Japanese long-term yields and their U.Japan's finance ministry has refrained from commenting on whether it was behind the dollar selling, but top currency diplomat Masato Kanda repeated on Tuesday that the government \"will continue to take the same firm approach\" to disorderly yen moves."}}