{"Kevin Spacey slams new documentary on alleged abuse: I won't sit back and be attacked":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/11/29/314274-kevin-spacey.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-kevin-spacey-slams-new-documentary-on-alleged-abuse-i-wont-sit-back-and-be-attacked-717673","content":"”While Kevin has been given access to the documentary prior to it airing, Kevin recently took to X and accused broadcasting partner of not giving him enough time to “respond to allegations made against me dating back 48 years.Kevin Spacey is not taking light of a new documentary that has detailed the alleged abuse that he has been accused of over the past few years.” He also said that he would “not sit back and be attacked by a dying network’s one-side ‘documentary’ about me in their desperate attempt for ratings,” adding that “each time I have been given the time and a proper forum to defend myself, the allegations have failed under scrutiny and I have been exonerated.Due to air next week, Kevin Spacey fired at the makers of the upcoming documentary titled Spacey Unmasked.The documentary will premiere on May 6 and 7 and is described as featuring “never-seen-before interviews and archive” to examine the actor’s life “from childhood to early success on Broadway and subsequent meteoric rise to stardom."},"Did Tarak Mehta actor Gurucharan Singh plan his own disappearance? New report claims so":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/27/427798-untitled-design-2024-04-27t145053669.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/did-tarak-mehta-actor-gurucharan-singh-plan-his-own-disappearance-new-report-claims-717655","content":"Sharing more updates regarding Gurucharan's disappearance, the police source said that the actor had left his phone, due to which it's difficult to trace him.As per Indian news channel New18, a police source has said that the actor left his phone in Delhi's Palam area and ''moved out of'' the city.We are trying to find but it only makes it more difficult for us to trace Gurucharan Singh, because this means that the phone is not with the actor,\" Delhi police sources said, as per News18.”Gurucharan Singh went missing on April 22 when he left his Delhi home to catch a flight to Mumbai.While there are no updates on Gurucharan's whereabouts, recent reports are claiming that the Indian actor likely planned his own disappearance."},"'It's not something to be ashamed of': Halle Berry confronts stigma around menopause":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/26/420853-halle-berry-lead-d643c107d3794ad890de9fb4975174cf.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/its-not-something-to-be-ashamed-of-halle-berry-confronts-stigma-around-menopause-717630","content":"Berry, the first woman of colour and still the only Black woman to win a best actress Oscar, has been vocal about her own experiences with menopause and said the issue needed to be \"destigmatized.Academy Award-winning actress Halle Berry joined a group of US senators on Thursday to announce new legislation that would provide tens of millions of dollars towards menopause research and education.\"The actress -- whose films include the \"X-Men\" series, the 2002 James Bond movie \"Die Another Day\" and the mercilessly mocked \"Catwoman\" (2004) -- told reporters her doctor refused to use the word \"menopause\" in front of her.The bill, Advancing Menopause Care and Mid-Life Women's Health Act, is sponsored by senators from both parties and would divert $275 million to research, raising awareness and training health care professionals to deal with the hormone shift that women go through, mainly in middle age.\"Menopause is not a bad word."},"Were Neanderthals spiritual and religious? Netflix documentary has some answers":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429047-secrets-of-the-neanderthals.png?imwidth=400","link":"https://www.wionews.com/science/were-neanderthals-spiritual-and-religious-netflix-documentary-secrets-of-the-neanderthals-explores-717631","content":"The documentary later moves to Zagreb, Croatia, where archaeologists found only fragments of Neanderthal skeletons and not whole bodies.The documentary moves to the Mediterranean, specifically Gibraltar, where a row of caves exists that was inhabited by the Neanderthals till as recently as 40,000 years ago.At Shanidar, archaeologists recently found remains of another Neanderthal, leading them to wonder if the cave was being used as a burial ground by the species.It seems strange to think that a species that lived for so many years suddenly vanished.The documentary shows how they might have been eating each other to keep a part of the deceased alive or take on a quality of the dead."},"Britney Spears hotel drama: Singer blames mother for 'setting her up'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429035-screenshot-wwwgooglecom-20240503-115208.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-britney-spears-hotel-drama-singer-blames-mother-for-setting-her-up-717620","content":"In a post, she wrote about not talking to her mother for 6 months and her suddenly reaching out to her after this hotel drama episode.The hotel drama started an online thread on the status of her mental health and if she was back to the old days of partying, drug abuse and mental health breakdowns when she would indulge in the most bizarre things.It was a wild night for Britney Spears as the singer looked disoriented and visibly shaken, leaving the premises of a posh hotel in Los Angeles in what is reported to be an ugly fight between her and her boyfriend.As per Britney, however, her mother escalated it, and there wasn’t much drama about what was being reported.She then also posted on Instagram blaming her mother for escalating all that drama."},"When Drew Barrymore left her past lovers' list at a famous actor's house":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429022-drewbarrymore-b783a585eb3844c78bf85c5eb556fb51.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-when-drew-barrymore-left-her-past-lovers-list-at-a-famous-actors-house-717596","content":"Drew Barrymore used to keep a “sex list” and there was a time when the actress accidentally left it at a famous actor’s house.Wondering if he had ever found out the list, Drew told the actor when he was a guest on her talk show.On the show, Drew said, \"I made a list.He came on the show and I was like, 'I left my sex list at your house.Drew chimed in and said she was guilty of the same and while she didn’t make it on her phone, she did have a list back in the day."},"Meryl Streep to receive Honorary Palme d’Or at Cannes Film Festival":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429033-47-facts-about-meryl-streep-1689051704.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-meryl-streep-to-receive-honorary-palme-d’or-at-cannes-film-festival-717568","content":"It’s going to be a big night for Meryl Streep at the Cannes Film Festival.”Cannes Film Festival president Iris Knobloch and general delegate Thierry Frémaux said, “We all have something in us of Meryl Streep!This will be the 77th edition of Cannes Film festival which will run from May 14-25.On the opening night of the film festival, the multiple Oscar-winner will receive the honorary Palme d’Or.This honourary tribute will mark Meryl Streep’s return to Cannes after decades."},"Britney Spears walks out of posh hotel barefoot after heated fight with boyfriend, then says...":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429030-horizons-2.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-britney-spears-walks-out-of-posh-hotel-barefoot-after-heated-fight-with-boyfriend-717552","content":"She reportedly had a showdown in a hotel with her boyfriend that left fans wondering if the wild days are back in the American pop star’s life.com/YcmNFVGWbPAfter the argument, Britney Spears left their hotel room in a dishevelled state and an ambulance was called to the scene.Britney left the hotel barefoot, with her hair all over the place as she held onto a pillow.After the whole fiasco, Britney took to her Instagram to call all the hotel drama “fake news”.She wrote, \"Just to let people know … the news is fake !!!"},"Gippy Grewal praises Chamkila's singing, recalls watching his live performance":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428932-happy-30th-birthday-2024-05-02t213428186.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-gippy-grewal-praises-chamkilas-singing-recalls-watching-his-live-performance-717482","content":"Talking further, the singer recalled attending Chamkila's live performance as he said that the singer introduced Swaran Sivia to the audience as he sang his first devotional song ''Baba Tera Nankana'' even before he recorded it.Starring Diljit Dosanjh and Parineet Chopra, the biographical drama is based on the life of a famous Punjabi singer who was known as the 'Elvis of Punjab'.The movie has brought the life of the singer to the limelight again.The Netflix movie tells the story of Chamkila, one of the most famous Punjabi singers of all time.Amid this, singer Gippy Grewal has shared the time when he attended Chamkila's life performance."},"Chris Hemsworth says rumours around his retirement due to Alzheimer's were upsetting":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/06/15/359593-horizons-2023-06-15t085055913.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-chris-hemsworth-says-rumours-around-his-retirement-due-to-alzheimers-were-upsetting-717459","content":"People put the two things together and soon news started floating that actor was retiring or that he had already developed the disease.The actor learned in 2022 that he has a high genetic predisposition to Alzheimer's, and shortly after the news was made public, he took a break from acting.The actor also revealed that his grandfather suffered from the disease.’\"\n\nDiscovering genetic predisposition to Alzheimer's \n\nChris recalls he originally discovered the higher likelihood of him developing Alzheimer's on his Disney+ series, Limitless- a show that talked about health and longevity.In one episode, he underwent a number of blood tests."},"Release date out! Jitendra Kumar's Panchayat Season 3 to premiere in May":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428910-happy-30th-birthday-2024-05-02t190258092.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-release-date-out-jitendra-kumars-panchayat-season-3-to-premiere-in-may-717455","content":"Season 1 shows Abhishek's struggle as he tries to adjust to his new life and do his mundane job.Directed by Deepak Kumar Mishra, the new season will take us back to the world of Phulera.Starring Jitendra Kumar, the anticipated new season will be released on May 28 on Amazon Prime.Season 2 gets more heartwarming, as we see Abhishek battle new and hilarious obstacles in Phulera as his bond with villagers like Vikas and Pradhan ji gets stronger and deeper.🤍''Set in a remote Indian village, the show follows the life of an engineering graduate Abhishek, who has settled with a low-paying government job and has moved to a village Phulera."},"Harry Potter star Tom Felton joins the cast of Hansal Mehta's web series Gandhi":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428907-your-paragraph-text-2024-05-02t185556250.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/harry-potter-star-tom-felton-joins-the-cast-of-hansal-mehtas-web-series-gandhi-717435","content":"#Gandhi #GandhiFilmingNow\n\nCast - Tom Felton, Libby Mai, Molly Wright, Ralph Adeniyi, James Murray, Lindon Alexander, Jonno Davies, Simon Lennon@applausesocial @nairsameer @mehtahansal… pic.com/77d1c0NHulApart from Tom Felton, Libby Mai, Molly Wright, Ralph Adeniyi, James Murray, Lindon Alexander, Jonno Davies, Simon Lennon will be seen in the show.The show has Pratik Gandhi collaborating with Hansal Mehta once again after their popular web series Scam 1992 which made the actor an overnight star.The show is based on Ramachandra Guha’s books Gandhi Before India and Gandhi – The Years that Changed the World.The new series also stars Pratik Gandhi's wife, actress Bhamini Oza as Kasturba Gandhi."},"Baahubali animation series Crown of Blood trailer out, to release on Disney+ Hotstar":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428870-baahubali-crown-of-blood-poster.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/baahubali-animation-film-crown-of-blood-trailer-out-to-release-on-disney-hotstar-717389","content":"SS Rajamouli is bringing his Baahubali film to life again with a new animation series titled Baahubali: Crown of Blood.Meanwhile, the new series will take place before the timeline of the events of the film.Based on the hugely successful Baahubali film franchise, the show will release on Disney+Hotstar.At the event of trailer premiere, SS Rajamouli said, “The world of Baahubali is vast, and the film franchise was the perfect introduction to the same.”He added, “We are extremely happy to introduce this new chapter to Baahu’s fans and to bring this story in an animated format, which brings a new, exciting look to the world of Baahubali."},"Jubilee star Sidhant Gupta transforms himself to play Pandit Nehru in Freedom at Midnight":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428866-your-paragraph-text-2024-05-02t164316467.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/jubilee-star-sidhant-gupta-transforms-himself-to-play-pandit-nehru-in-freedom-at-midnight-717381","content":"According to the makers, Freedom at Midnight is an epic political thriller drama that highlights “several incidents from the year of India’s independence and interconnected stories about crucial events and personalities who played a significant role in writing the country’s history as we know today.Freedom at Midnight is produced by Monisha Advani and Madhu Bhojwani in association with StudioNext and Sony LIV.\" \n\nAdvani said Freedom at Midnight is a profound tribute to the “luminaries of our freedom movement — Mahatma Gandhi, Jawaharlal Nehru, and Sardar Vallabhbhai Patel”.While writing on cinema remains her first love, her other interest lies in"},"Prachi Desai on her equation with Manoj Bajpayee on the sets of Silence 2":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428860-silence-2-trailer-1712128831.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-prachi-desai-on-her-equation-with-manoj-bajpayee-on-the-sets-of-silence-2-717373","content":"Playing a cop yet again in the second season of the popular show, the actress spoke about her character, how the role has evolved with time and her equation with Manoj Bajpayee.”When asked how Sanjana reacts to more ownership to the story in second season of the show,  Prachi said, “I enjoyed the unspoken subtle sense of maturity in her as well.Talking to WION, Prachi spoke about her fuss-free role in Silence 2 as inspector Sanjana Bhatia.Prachi Desai was most recently seen in Manoj Bajpayee led show Silence 2.Reflecting on how it changes in both seasons, Prachi said, “In the first part we were new to ACP Avinash so there was a sense of rawness to the equation, and slight hesitation which is purely out of respect whilst getting acquainted with a superior who is highly looked up to."},"Princess Charlotte turns 9! Young royal is all smiles in the new photo released by Kate, William":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428857-happy-30th-birthday-2024-05-02t161120013.png?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-princess-charlotte-turns-9-young-royal-is-all-smiles-in-the-new-photo-released-717368","content":"On Thursday (May 2), a new photo of Charlotte was shared on the social media handle of the Prince and Princess of Wales.On the special day of Prince William and Kate Middleton's little princess, the palace shared a new picture of the young royal.The new photo of Charlotte comes a few days after Kate and William celebrated their 13th wedding anniversary.Marking the big day, the palace released a never-before-seen photo of the couple from their wedding day.Since the Mother's Day photo goof-up, every family photo that has been released of Kate and William's family has gone through scrutiny."},"Richa Chadha reveals she was offered another role in Heeramandi before she chose to play Lajjo":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428854-your-paragraph-text-2024-05-02t153825651.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/richa-chadha-reveals-she-was-offered-another-role-in-heeramandi-before-she-chose-to-play-lajjo-717360","content":"Reveling in the amazingly glorious reviews for Heeramandi: The Diamond Bazaar, especially for her character Lajjo, Richa Chadha has revealed that she had been offered a different role in Sanjay Leela Bhansali's web series earlier.In her review of the show, Shomini Sen of Wion stated that Richa Chadha created an impact despite limited screen time.Despite being initially offered a bigger role, Richa deliberately chose the character of Lajjo, recognising its potential to make a profound impact.\"As a trained Kathak dancer, bringing Lajjo's dance number to life was a fulfilling experience for me, adding another layer of authenticity to the character.\"Reflecting on her decision, Richa shares, \"When I was approached for Heeramandi, at the time Sanjay sir was the showrunner and i had been offered another part, one with more screentime for sure."},"'I was foul-mouthed and smoking': Eva Mendes is glad to have become a mother in her 40s":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/11/19/312041-untitled-design-2022-11-19t183126079.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-eva-mendes-is-glad-being-a-mother-in-her-40s-717323","content":"As people found the role odd at first, Eva defended her “husband”, attributing that label to Ryan for the first time in public.And then I was 42 and I was pregnant with my second one and people were like, ‘Oh my God, you’re going to be so tired.She’s happy raising kids, the first of whom she had three years after she met her now-husband Ryan Gosling.In a new interview with People, Eva Mendes revealed that she couldn’t have imagined being a mother at any other point in her life than now.Eva Mendes said, “When I was 40, it was a big deal for people when I was pregnant, and it wasn’t for me."},"Sofía Vergara doesn't want more kids. Here's why":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/08/24/208087-new-410.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-sofía-vergara-doesnt-want-more-kids-heres-why-717313","content":"Conscious of her age and the phase of life she’s in at the moment, Sofia doesn’t want to be an old mom.Speaking to People for its cover issue this week, Sofia said that now she’s broken up with Joe, she is okay trying her hand at love again but the man will have to get his own kids because she’s not interested in being an old mom in the age of her being a grandmom.”She has no problems with women who want to be a mom at the age of 50 but she doesn’t want to be in that club, for sure.In a recent interview, she revealed that her relationship with ex Joe Manganiello broke up for this very reason, since he’s a young man and wanted kids but Sofia doesn’t want any of her own.Sofia Vergara doesn’t want more kids."}}