{"Prince Harry attends Invictus Games event 2 miles away from the royal family's garden party ":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/03/28/341572-untitled-design-2023-03-28t153928712.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-prince-harry-attends-invictus-games-event-2-miles-away-from-the-royal-familys-garden-party-719733","content":"At Buckingham's first garden party of the season, Charles was joined by Queen Camilla; Anne, Princess Royal; Prince Edward, Duke of Edinburgh; Sophie, Duchess of Edinburgh; Birgitte, Duchess of Gloucester; and Prince Richard, Duke of Gloucester.Meanwhile, Charles and senior royal family members attended a garden party at Buckingham Palace just two miles away.Charles' son Prince William and his wife Kate Middleton did not attend the garden party.Harry celebrated the 10th anniversary of the Invictus Games at an event in London on Wednesday (May 8) but the royal family was not in attendance.The Prince of Wales conducted an investiture ceremony at Windsor earlier on Wednesday while his wife is taking time off from official royal duties while she undergoes cancer treatment."},"Ranveer Singh squashes divorce rumours as he flaunts his wedding ring at an event":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/10/26/389080-your-paragraph-text-2023-10-26t092539466.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-ranveer-singh-squashes-divorce-rumours-as-he-flaunts-his-wedding-ring-at-an-event-719719","content":"“One of the rings that are very dear to me is this one — it’s my wedding ring, presented to me by my wife,” Ranveer said as he held his hand up and showed the massive diamond wedding ring.Singh was present at the store launch of Tiffany &Co where he proudly flaunted his wedding ring and called it the most treasured jewellery piece in his collection.Ranveer admitted his wedding and engagement ring presented by Deepika Padukone are his most favourite jewellery pieces.“Personal, sentimental value attached to them are my favourite most dear pieces,” he said, before speaking about his wedding ring.In an interview with Vogue India at the store launch, Ranveer Singh was asked to name a piece of jewellery that he is most fond of."},"Shakira tax fraud case: Prosecutors move to dismiss second investigation":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/02/422384-horizons-2024-04-02t124049963.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/shakira-tax-fraud-case-prosecutors-move-to-dismiss-second-investigation-719711","content":"6 million) in addition to a suspended three-year sentence.7 million euros ($7.4 million.Shakira was given a fine of 7 million euros ($7.2 million) in taxes on her 2018 income."},"On Vijay Deverakonda's birthday, makers announce pan-India project featuring the actor":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/01/09/324126-untitled-design-2023-01-09t172406999.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/on-vijay-deverakondas-birthday-makers-announce-pan-india-project-featuring-the-actor-719707","content":"com/EkbKMAqQgqThe makers took to social media platform Instagram and shared an artwork poster along with the caption that read, “In blood, He'll rise, reign & Ignite the Mass Ripples all over!In blood, He'll rise, reign & Ignite the Mass Ripples all over!❤️‍🔥#SVC59 - @TheDeverakonda's\nMass Incarnation 🔥\n\nA @storytellerkola's Film 🎯#HBDTheVijayDeverakonda 💫\n\nProduced by #DilRaju - #Shirish @SVC_official pic.#SVC59- @thedeverakondas Mass Incarnation.On Thursday morning, the makers shared a riveting poster of the project."},"Mr And Mrs Mahi poster: We love how great Rajkummar and Janhvi look together":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430359-screenshot-wwwndtvcom-20240509-151900.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-mr-and-mrs-mahi-poster-we-love-how-great-rajkummar-and-janhvi-look-together-719718","content":"The first poster captures Janhvi and Rajkummar wearing their Indian jerseys and standing close to each other.Janhvi Kapoor and Rajkummar Rao starrer Mr and Mrs Mahi teased the first official posters from their film together and we must say their chemistry looks crackling.Sharing the posters, Janhvi wrote, \"Miliye Mr aur Mrs Mahi se, inke liye life is cricket aur cricket is life cricket se badh ke, Mr Mahi only loves his dear wife #MrAndMrsMahi in cinemas on 31st May, 2024.In the second poster, Janhvi and RajKummar are seen screaming with joy and cheering in the stands of the cricket stadium.\"The film is pegged as a sports drama."},"Katherine Schwarzenegger takes an indirect dig at Met Gala 2024: 'When the gala was..'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2019/06/09/97848-untitled-design-15.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/katherine-schwarzenegger-takes-an-indirect-dig-at-met-gala-2024-looks-when-the-gala-was-719690","content":"In her caption of the post, Maria wrote, “It’s the first Monday in May and the Met Gala is underway!On May 6, Katherine's mother Maria Shriver shared her Met Gala 2001 look, recalling the time she attended the charity gala.Held annually on the first Monday of May, the charity gala saw some of the biggest stars walk up the stairs in their best attire.After Maria shared the post, Katherine went on to re-share it on her Instagram story with a message that led many to think that she did not like the looks this year's guests sported.”In 2001, Maria attended the event wearing a lavender dress."},"Taylor Swift European dates kick off in Paris":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/02/422526-wion-images-2024-04-02t233040732.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-taylor-swift-european-dates-kick-off-in-paris-719659","content":"Swifties in Paris are especially excited to hear songs off her new album, \"The Tortured Poets Society\", being performed for the first time.\"But it's my birthday and it's Paris and it's the first night of the tour, and I thought why not?The highest-grossing tour in history finally arrived in Europe on Thursday as Taylor Swift kicked off her European dates with four nights in Paris.By the end of the year, it had already become the first to sell more than $1 billion in tickets and is on track to more than double that by the time it concludes in Vancouver this December.\"  - Record-breaker -Some 42,000 people will see Swift in Paris before she heads on for dates in Sweden, Portugal, Spain, Britain, Ireland, Netherlands, Switzerland, Italy, Germany, Poland and Austria."},"Cannes 2024: Aishwarya Rai Bachchan and Aditi Rao Hydari all set to walk the red carpet":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430320-your-paragraph-text-2024-05-09t120033402.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/cannes-2024-aishwarya-rai-bachchan-and-aditi-rao-hydari-all-set-to-walk-the-red-carpet-719631","content":"So far, It is unclear whether Sonam Kapoor, another regular at Cannes, will be walking the red carpet this year.Aishwarya Rai Bachchan and Aditi Rao Hydari will return to the Cannes red carpet this year.The two beauties will be walking the red carpet with a bevvy of celebrities, representing a beauty brand that they both are a part of.India at Cannes 2024\n\nAditi made her red carpet debut in 2022, whereas Aishwarya Rai has been a regular fixture on the Cannes red carpet since 2000.Considered one of the biggest film festivals, Cannes this year has a considerable Indian representation."},"Trailer of Payal Kapadia's Cannes film All We Imagine As Light out":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/11/424439-your-paragraph-text-2024-04-11t171938733.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/trailer-of-payal-kapadias-cannes-film-all-we-imagine-as-light-out-719615","content":"All We Imagine As Light is the first Indian film in competition at Cannes since 1994 and is one of only four female-directed features in the lineup this year.The trailer of All We Imagine As Light, the highly anticipated film by Payal Kapadia, is out.The film is Kapadia's debut feature film and has been selected in the competition section of the upcoming 77th Cannes Film Festival, scheduled to take place later this month.While writing on cinema remains her first love, her other interest lies in"},"Lady Gaga's concert film, Chromatica Ball to release on this date after a two-year wait":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430306-horizons-2024-05-09t110300391.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-lady-gagas-concert-film-chromatica-ball-to-release-on-this-date-after-a-two-year-wait-719604","content":"The concert film which was originally announced in 2022 will feature footage from Lady Gaga’s global Chromatica Ball stadium tour.”Lady Gaga took to Instagram to share what fans can expect from her concert film as she wrote, “This film chronicles a time of immense creativity… the fashion, the dance, the music.Lady Gaga’s concert film Chromatica Ball finally has a release date.In the trailer of Chromatica Ball, you can hear Lady Gaga shout, “Put your hands up, come on!I hope you will feel seen when you watch this film."},"Gisele Bündchen urges fans to donate for Brazil floods in an emotional message":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2018/09/11/33429-untitled%25252520design%25252520%25252861%252529-20171122064343.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/gisele-bundchen-urges-fans-to-donate-for-brazil-floods-in-an-emotional-message-719598","content":"Gisele Bündchen is trying to make a difference as her home state of Rio Grande do Sul, Brazil has been ravaged by devastating flooding.The model also said that people near the affected area could help by donating \"mattresses and pillows, all types of bedding, toiletries, cleaning products, all types of clothing for all ages, furniture, appliances, pet food, and general daily living items.The model referred to the flooding as \"the worst tragedy in its history.Bundchen shared an Instagram Reel containing photos and video of the damage in southern Brazil.The supermodel made an emotional plea to her fans on Wednesday, May 8, asking her followers to consider donating to the Luz Alliance Fund, an initiative she created in partnership with the Brazil Foundation to provide humanitarian pandemic relief to families in Brazil."},"Deepika Padukone smacks phone out of fan's hand while hiding baby bump, video goes viral":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430303-horizons-2024-05-09t104405204.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-deepika-padukone-smacks-phone-out-of-fans-hand-hiding-baby-bump-video-goes-viral-719597","content":"When she spotted the camera, Deepika did not pay attention to it at first.Currently expecting her first child with Ranveer Singh, Deepika Padukone has been keeping a low profile and hasn’t been spotted as much in public.This is the first time that Deepika Padukone was spotted after divorce rumours started circulating.Mother-to-be Deepika Padukone recently became a meme on social media after she was spotted smacking a phone away from a fan’s hand while they filmed her on the move with her husband Ranveer Singh.It's not clear whether she did it playfully or was genuinely disturbed by the phone camera being in her face."},"Ali Fazal joins Kamal Haasan in Mani Ratnam's Thug Life":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430294-horizons-2024-05-09t101645606.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-ali-fazal-joins-kamal-haasan-in-mani-ratnams-thug-life-719583","content":"This would be the first full-fledged role for Ali Fazal in the South Indian film industry alongside Kamal Haasan.Mani Ratnam’s next film Thug Life is finally taking shape.The film has roped in Kamal Haasan and Ali Fazal in pivotal roles.The film was a massive blockbuster and was the country’s entry to the 1988 Oscars.”The film falls under the bracket of the gangster genre and is written by Ratnam and Haasan and produced by Raaj Kamal Films International, Madras Talkies and Red Giant Movies."},"Miss Teen USA 2023 UmaSofia Srivastava steps down days after Miss USA 2023 Noelia Voigt's resignation":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430282-your-paragraph-text-2024-05-09t093424448.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-miss-teen-usa-2023-umasofia-srivastava-steps-down-days-after-miss-usa-2023-noelia-voigts-resignation-719553","content":"”“After months of grappling with this decision, I have chosen to resign from the title of Miss Teen USA 2023,” she wrote.Srivastava’s resignation came days after Miss USA 2023 Noelia Voigt announced that she was resigning from the title in order to focus on her mental health\"I realize this may come as a large shock to many,\" Voigt, 24, said in an Instagram post announcing the decision, which was shared on Monday, May 6.I will always look back on my time as Miss NJ Teen USA fondly, and the experience of representing my state as a first generation, Mexican-Indian American at the national level was fulfilling in itself.\"Following her announcement, the Miss USA organisation thanked Voigt for her service, saying in a statement that they \"respect and support Noelia’s decision to step down from her duties.\"Srivastava's decision comes two days after Miss USA 2023 Noelia Voigt announced her resignation."},"Alec Baldwin files motions seeking dismissal of Rust trial again":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/21/353293-untitled-design-2023-05-21t172027366.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-alec-baldwin-files-motions-seeking-dismissal-of-rust-trail-again-719544","content":"In another update on the Rust firing case, Alec Baldwin’s lawyers have filed two more motions to throw out his manslaughter indictment.Meanwhile, Rory Kennedy is making a documentary about Alec Baldwin and the Rust shooting.Alec Baldwin maintains that he did not pull the trigger and argues that the government’s actions did not let them show that the gun was not working properly at the time of the shooting.Her company Moxie Films has been working on a documentary about the case for more than a year.In their latest motions, the actor's lawyers argue that the charge is not legally justified and that he has been deprived of a fair trial because the FBI broke the gun in the case during testing."},"Demon Slayer: Hashira Training arc: What all could go wrong with season 4?":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/28/427999-demon-slayerr.png?imwidth=400","link":"https://www.wionews.com/entertainment/demon-slayer-hashira-training-arc-what-all-could-go-wrong-with-season-4-719504","content":"However, the Demon Slayer: Hashira Training arc contains no big fight scenes, and demons will not appear until the end of the season.The downward trend continues, as the Demon Slayer: Hashira Training Arc will end on June 30.The Demon Slayer: Hashira Training Arc would be the shortest in the series, with only eight episodes.So here are some of the things that could go wrong with Demon Slayer: Hashira Training arc.Demon Slayer has always met fans' high expectations because of Ufotable's excellent animation, but Demon Slayer Season 3: Swordsmith's Village arc fell short."},"My Hero Academia Season 7 Episode 2: Exact release date and time, where to watch":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/07/423548-my-hero-academia-season-7.png?imwidth=400","link":"https://www.wionews.com/entertainment/my-hero-academia-season-7-episode-2-exact-release-date-and-time-where-to-watch-719492","content":"The first episode of the seventh season introduces viewers to Star and Stripe, the well-known superhero from America.Here's all you need to know about My Hero Academia Episode 2.According to official sources, the next My Hero Academia episode will be out on Saturday, May 11, 2024, at 5:30 pm JST.My Hero Academia is back on screen with its seventh season and the premiere was nothing less than amazing.The first episode of Season 7, \"In the Nick of Time!"},"Alia Bhatt becomes the ‘most visible attendee’ at Met Gala 2024; beats Kendall Jenner, Kim Kardashian":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429723-untitled-design-2024-05-07t055631738.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-alia-bhatt-becomes-the-most-visible-attendee-at-met-gala-2024-beats-kendall-jenner-kim-kadashian-719472","content":"Bhatt revealed that her couture saree was crafted by 163 artisans and paid homage to the official dress code for the 2024 Met Gala – The Garden of Time.In her second outing at the prestigious fashion gala, Alia grabbed attention with her elegant saree which extended into a 30-foot-trail.The most influential of them all\n\nAs per a report on the influencer marketing platform Lefty, Alia and Sabyasachi topped the list of brands and most visible star at Met this year and beat the biggest celebrities, influencers and brands when it came to visibility.This was Alia's second appearance at the Met Gala after making a debut last year.Bollywood's favourite girl made heads turn on Monday evening as she walked the red carpet at the Met Gala 2024."}}