{"Jewish star Ben Stiller breaks silence on Israel-Hamas war: 'I want the violence to end'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/02/07/330612-untitled-design-36.png?imwidth=400","link":"https://www.wionews.com/entertainment/jewish-star-ben-stiller-breaks-silence-on-israel-hamas-war-i-want-the-violence-to-end-734057","content":"“I believe, as many people in Israel and around the world do, in the need for a two-state solution, one that ensures that the Israeli people can live in peace and safety alongside a homeland for the Palestinian people that provides them the same benefits.””Saying that he stands with the Israeli people, the actor wrote against Israel's attack on Gaza, which had claimed the lives of innocent Palestinians.It's been more than nine months since the Hamas-led terrorist attack shocked the entire world on Israel on October 7, 2023.As the war between Israel and Gaza intensifies, Jewish actor Ben Stiller has written an opinion piece published in Time magazine in which expresses his views on the situation and the rise of antisemitism and urges for global peace.How does one express the complicated and very real feelings in this scary world of social media, where it seems any sentiment opens you to online vitriol from one side or another?"},"Sonakshi Sinha-Zaheer Iqbal's wedding festivities begin: First pic from mehendi ceremony is out":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/22/439280-happy-30th-birthday-2024-06-22t102055995.png?imwidth=400","link":"https://www.wionews.com/entertainment/sonakshi-sinha-zaheer-iqbals-wedding-festivities-begun-first-pic-from-mehandi-ceremony-is-out-734048","content":"On Friday, Shatrugan Sinha's close friend Shashi Ranjan revealed that they will register their marriage at Zaheer Iqbal's house.The picture shared by the couple's friend Jafer Ali Munshi, shows the Double XL actors posing with their close friends inside the venue.Ahead of the impending nuptials, inside details about the marriage have been coming out.\"\n\nPhotos from Sonakshi's mahndi ceremony come a couple of days after the couple had a fun bachelorette with their close friends in Dubai.Ahead of the big day, the wedding festivities have begun."},"Box Office: Inside Out 2 inches close to $500 million mark worldwide":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/11/09/392226-inside-out-2.png?imwidth=400","link":"https://www.wionews.com/entertainment/box-office-inside-out-2-inches-close-to-500-million-mark-worldwide-734035","content":"The sequel to the 2015 hit movie is shattering all records to attain the top spot at the box office.Released on June 14, the animated drama is in its second week and is poised to surpass Timothee Chalamet's Dune: Part 2 to become the highest-grossing movie of 2024 at the North American box office.1 million earned by The Dune sequel domestically.Shattering summer box office records, Pixar's movie has emerged as 2024’s biggest theatrical debut so far.In the first eight days of release, the movie earned more than $283 million in ticket sales, as per THR, surpassing the $282."},"'Genocide of Native Americans not over': Killers of the Flower Moon star Lily Gladstone":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/01/30/408840-horizons-81.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/genocide-of-native-americans-not-over-killers-of-the-flower-moon-star-lily-gladstone-734021","content":"Oscar-nominated actress Lily Gladstone is pleased that Indigenous people are getting better representation on the silver screen, including in her new film Fancy Dance, but warns there is an \"ongoing genocide\" of Native Americans that must be addressed.She is now starring in Fancy Dance, about the epidemic of missing and murdered Indigenous people in America, most of them women.She says the film's strength is in showcasing \"the needs that we have as Indigenous women, especially in the face of epidemics like missing murdered Indigenous people\" and children being placed in foster care with non-Native families.Investigate West, citing official estimates, puts the number of unsolved cases of Indigenous people missing or murdered across the United States in the thousands.\"As an Indigenous person, I can't go online without being, you know, without seeing a missing poster, without people, like, looking for someone who is missing,\" 44-year-old Tremblay told AFP at the premiere.\""},"Kalki 2898 AD new trailer: Amitabh Bachchan, Deepika Padukone, Prabhas prepare for final war":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/09/436740-happy-30th-birthday-2024-06-09t151016917.png?imwidth=400","link":"https://www.wionews.com/entertainment/kalki-2898-ad-new-trailer-amitabh-bachchan-deepika-padukone-prabhas-prepare-for-final-war-733975","content":"While the first glimpse introduced audiences to the extraordinary Kalki 2898 AD cinematic universe rooted in Indian mythology, the latest trailer delves deeper, hinting at the epic narrative that awaits.Kalki 2898 AD release trailer: Amitabh Bachchan fights Prabhas to protect Deepika Padukone.The trailer introduces three distinct worlds of Kalki 2898 AD: Kashi, depicted as the last remaining city struggling for survival; the Complex, a paradise in the sky controlled by the elite; and Shambala, a mystical land serving as a refuge for those persecuted by the Complex.Before the film's release, the makers of the upcoming sci-fi epic Kalki 2898 AD gave a last surprise to cinephiles.Nag Ashwin’s sci-fi film Kalki 2898 AD will hit theatres soon."},"Vikrant Massey starrer 12th Fail to screen at Shanghai Film Festival":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/10/26/389198-happy-30th-birthday-2023-10-26t190227628.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-vikrant-massey-starrer-12th-fail-to-screen-at-shanghai-film-festival-733947","content":"The 2024 edition of the film festival kicked off on June 14.One of 2023's most loved films, 12th Fail, is all set to screen at the Shanghai Film Festival.The film will be screened at the closing night of the festival on Sunday.\" Read the full review of the film hereShomini has written on entertainment and lifestyle for the most part of her career.Directed by Vidhu Vinod Chopra, the film narrated the story of Manoj Kumar Sharma, who overcame poverty and became an IPS officer."},"Travis Scott releases new merch featuring his viral mugshot hours after arrest in Miami":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/21/439196-untitled-design-2024-06-21t201052390.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/travis-scott-releases-new-merch-featuring-his-viral-mugshot-hours-after-arrest-in-miami-733924","content":"This phrase, according to the official police report, was something Scott said to officers following his arrest.In an arrest affidavit obtained by PEOPLE, it was documented that Scott \"walked backwards yelling obscenities to the occupants of the vessel\" during the incident.Public records reveal that Scott was found \"yelling at the vessel occupants\" after authorities were alerted to fighting on a yacht.Despite the chaotic scene, the complainant did not press charges but requested that Scott leave the vessel.Travis Scott made headlines on Thursday as he got arrested in Florida on charges of disorderly intoxication and trespassing on a property despite warning."},"Gujarat court lifts stay on Maharaj; says Netflix film doesn't hurt sentiments":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/14/437692-your-paragraph-text-2024-06-14t100646803.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/gujarat-court-lifts-stay-on-maharaj-says-netflix-film-doesnt-hurt-sentiments-733907","content":"On Wednesday (June 19), the Gujarat High Court said it would take a call on whether Maharaj hurts religious sentiments or not, as alleged in a complaint.The Gujarat High Court has lifted its temporary stay on the movie's premiere, stating that the film \"is yet to be released for public viewing, thus on mere presumption, the freedom of expression guaranteed under Article 19 (1)(a) of the Constitution cannot be curtailed\".The 1862 libel case was centred on a clash between a Vaishnavite religious leader and social reformer, Karsandas Mulji, who, in an article in a Gujarati weekly, had alleged that the godman had sexual liaisons with his female devotees.Treating this incident as an exception the Vaishnav sect and its followers continued to grow and remained a proud and integral part of the social, cultural and religious fabric of India.“The film in no manner affects or hurts religious feelings."},"Exclusive: Kartik Aaryan's fitness trainer Tridev Pandey on training actor for Chandu Champion":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/21/439173-horizons-2024-06-21t173528452.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-exclusive-kartik-aaryans-fitness-trainer-tridev-pandey-on-training-actor-for-chandu-champion-733897","content":"Playing Chandu Champion in a film directed by Kabir Khan, Kartik underwent a massive transformation for the role, without having used any artificial supplements.A: We focused on overall fitness, not just muscle building, to ensure he had the necessary strength, agility, speed, accuracy, and focus for boxing.Recently, Kartik Aaryan has been wooing audiences with his role in Chandu Champion as Murlikant Petkar, India's first Paralympics gold medallist.Read WION's review of Chandu Champion hereA: Kartik Aaryan is very grounded, respectful, and fun.It’s a tricky world of fitness for celebrities who have to constantly monitor their weight and diet and work on their bodies according to the demands of the character they have to play next."},"Inside Out 2: Why is Pixar’s emotional adventure a treat for both kids and adults?":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/11/09/392226-inside-out-2.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-inside-out-2-why-is-pixar’s-emotional-adventure-a-treat-for-both-kids-and-adults-733888","content":"While an animated movie with laughing, crying, and glowing ‘characters’ may seem like a kids’ movie, Inside Out 2 goes much beyond that.The reactions to Inside Out 2 on social media have been fantastic, with people saying that the movie ‘healed their inner child’ and wishing that they had grown up watching movies like this one.The first movie introduced us to the idea of our emotions and feelings having faces with stuff like ‘personality islands’ and ‘imagination land’ being in the forefront.Many parents have even appreciated the fun take on mental health the movie provides.Intense symbolism and metaphors are back in Inside Out 2, with Riley (the protagonist) going through teenage and puberty."},"Jane Fonda, Will Smith share touching tributes for late actor Donald Sutherland":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/21/439174-untitled-design-2024-06-21t174320321.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/jane-fonda-will-smith-share-touching-tributes-for-late-actor-donald-sutherland-733892","content":"Oscar winner Will Smith shared his sorrow via social media and posted a touching message alongside two photos of himself with Sutherland from the set of their 1993 film Six Degrees of Separation.She posted a photo of herself and Sutherland on the set of their 1971 film Klute and wrote, \"We loved working together.Canadian-born Sutherland is survived by his five children, including actor Kiefer Sutherland, whom he shared with ex-wife Shirley Douglas.\"Rest in Peace, Donald,\" Smith captioned the Instagram carousel, commemorating their time working together on the mystery film.The news of legendary actor Donald Sutherland's passing sent shockwaves across the film fraternity."},"World Music Day Special: Indian artists on touching hearts with their music":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/21/439166-horizons-2024-06-21t170924045.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/world-music-day-special-indian-artists-on-touching-hearts-with-their-music-733882","content":"On a day when musicians globally come together to perform in public spaces, sharing their united passion for music, we got in touch with a few Indian artists on what music means in their lives, how it has shaped their personalities and is more than just a career.For me, music isn’t just a passion but a calling, guiding me through life’s complexities and celebrating its beautiful momentsIkka: \nHappy World Music Day to all my fans!Fardidkot: \nOn this World Music Day, we are deeply grateful for the unwavering support and love you’ve shown us.Tulsi Kumar: \nTo all my incredible fans, on this special day dedicated to music, I want to express my heartfelt thanks for your unwavering support and love.Let’s cherish the melodies that bind us together and celebrate the universal language that is music."},"Here's why Diljit Dosanjh wears traditional Punjabi attire at international shows":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/18/438439-untitled-design-2024-06-18t131223856.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/heres-why-diljit-dosanjh-wears-traditional-punjabi-attire-at-international-shows-733869","content":"\"From Coachella to his Dil-Luminati Tour stops in Canada and Jimmy Fallon's show, the Chamkila actor has been seen rocking kurta, Tamba (traditional dress for Punjabi men), and turban in various colours.During the interaction, the actor said, “The Jimmy Fallon show, I had told my friend a long time ago.After making history at the Coachella Film Festival, the actor delivered a rocking performance on the acclaimed host and comedian Jimmy Fallon's show.Dosanjh's appearance at Jimmy Fallon's show comes at a time when the singer is busy with his ground-breaking Dil-Luminati Tour and promotions of his next movie Jatt & Juliet 3.Diljit Dosanjh On His Late Night Show AppearanceDuring the same interview, Diljit shared that he had always manifested his appearance on The Tonight Show with Jimmy Fallon."},"Kevin Costner confirms departure from Yellowstone: 'Not be able to continue...'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/01/02/322549-untitled-design-2023-01-02t142441812.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/kevin-costner-confirms-departure-from-yellowstone-not-be-able-to-continue-733843","content":"The actor says,'' I just, want to reach out and let you know that after this long year and a half of working on Horizon and doing all the things that that’s required.”Saying that Yellowstone “was something that really changed me,” Costner added, “I loved it and I know you loved it, and I just wanted to let you know that I won’t be returning.”He added, “Thinking about Yellowstone, that beloved series that I love, that I know you love.Actor Kevin Costner has waved goodbye to his role and the show Yellowstone.''In January 2023, the first part of Yellowstone season 1 ended on a cliffhanger."},"Isha Koppikar opens up about shocking casting couch experience, claims A-lister asked her to meet alone":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/21/439131-untitled-design-2024-06-21t141033953.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/isha-koppikar-opens-up-about-shocking-casting-couch-experience-claims-a-lister-asked-her-to-meet-alone-733837","content":"Speaking in Hindi, she recounted, \"One actor asked me to meet him alone, without my driver or anyone else, because there were rumours about him being involved with other actresses.\"A secretary and an actor approached me, suggesting that to get work, I had to be ‘friendly’ with actors.He was an A-list actor from the Hindi film industry.In the interview, Isha recalled an encounter with an A-list actor who insisted on meeting her alone.Isha spoke about how many would touch her inappropriately and suggested she needed to be friendly with the heroes in a sleazy manner."},"Ye's wife Bianca Censori wears nothing but body tape for her Paris outing; gets brutally trolled":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/21/439120-untitled-design-2024-06-21t132033367.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-yes-wife-bianca-censori-wears-nothing-but-body-tape-for-her-paris-outing-gets-brutally-trolled-733822","content":"Kanye West aka Ye's wife Bianca Censori stepped out on Thursday night in Paris, France and visited the celebrity hotspot Gigi Paris, wearing an outfit that left little to the imagination.com/b083ZQb0r7Kanye West and his wife Bianca Censori seen in Paris 🇫🇷 pic.com/3Rayg2r23dFor her night out in Paris, Censori was without her husband, Kanye West.Every photo of her looks like she's a sex slave pleading with her eyes for somebody to save her with a pinpoint hostage extraction.Every photo of her looks like she's a s** slave pleading with her eyes for somebody to save her with a pinpoint hostage extraction."},"Sonakshi Sinha-Zaheer Iqbal wedding: Happy family photo before nupitals takes internet by storm":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/21/439117-happy-30th-birthday-2024-06-21t131159756.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-sonakshi-sinha-zaheer-iqbal-wedding-family-selfie-with-parents-takes-internet-by-storm-733803","content":"Ever since Sonakshi and Zaheer's wedding invitation went viral, confirming the couple's nuptials, a lot of rumours about a rift between Sonakshi and her family made headlines, suggesting that her father Shatrughan, mother Poonam Sinha and brothers were not happy with the marriage and would presumably skip the ceremony.The public appearance comes hours after the actor debunked all rumours and confirmed that he will attend his daughter's wedding.However, on Thursday night, all the rumours were debunked when the two families came together before the wedding festivities began.The couple will have a court wedding on June 23, followed by an intimate reception at Bastian in Mumbai.The veteran actor posed happily with Zaheer as he made his first public appearance with him outside his residence in Mumbai."},"Jonathan Majors to star in supernatural thriller Merciless":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/12/19/400228-jonathan-majors-mcu.png?imwidth=400","link":"https://www.wionews.com/entertainment/jonathan-majors-to-star-in-supernatural-thriller-merciless-733798","content":"Embattled American actor Jonathan Majors has found his first feature film role after being convicted in a case of domestic assault.In Merciless, Majors will play the role of a top CIA interrogator who, after the woman he loves is overtaken by a malevolent force, is forced to go even darker to defeat it.The actor will star in Merciless, an upcoming movie from Martin Villeneuve, the younger brother of Dune filmmaker Denis Villeneuve, reported Variety.Villeneuve, best known for the sci-fi film Mars et Avril, will direct the project from a script by Frank Hannah.Following the guilty verdict, Majors was dropped by Marvel Studios, which had cast him as Kang the Conqueror, the supervillain character he was supposed to reprise in future Marvel Cinematic Universe (MCU) movies."},"Remember Corsica from Tamasha? A mysterious sonic boom has rattled French island":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/06/21/439102-sonicboomcorsica.png?imwidth=400","link":"https://www.wionews.com/science/remember-corsica-from-tamasha-mysterious-sonic-boom-has-rattled-french-island-733778","content":"Experts said that the sonic boom heard in Italy's Tuscany and the French island of Corsica may have been a meteorite.Corsica is back in the news with a bang, quite literally, as the authorities reported a sonic boom on the picturesque island on Thursday (June 20).The sonic boom was initially mistaken by holidaymakers, locals and officials for an earthquake.The Italian Air Force told Giani it had nothing to do with the sonic boom.Notably, it's not the first time a mysterious sonic boom has been registered."}}