{"Pankaj Tripathi's international film Mango Dreams to release in India on May 16":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429577-horizons-1.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-pankaj-tripathis-international-film-mango-dreams-to-release-in-india-on-may-16-718462","content":"Pankaj Tripathi starrer Mango Dreams will finally be released in India after travelling to a series of film festivals.The award-winning international film is helmed by American director John Upchurch.The film will get its India release on May 16 and it will release on the OTT platform, Open Theatre.The original story was set in America, but the film could be set anywhere in the world where divisions exist."},"Love and respect I get second only to Amitabh Bachchan, says Kangana Ranaut; netizens react":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429557-your-paragraph-text-87.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/kangana-ranaut-says-after-amitabh-bachchan-she-gets-similar-love-and-respect-internet-says-joke-of-the-year-718426","content":"The video of her speech has since gone viral and has led to multiple comments on social media with many making sarcastic jibes about her comparison to one of Bollywood’s most revered icons, despite her recent string of box office failures.Bollywood star-turned-politician Kangana Ranaut compared herself to Indian icon Amitabh Bachchan during her recent speech while campaigning for the Lok Sabha Elections 2024.The actress, who is contesting on a Bhartiya Janata Party (BJP) ticket from the Mandi constituency of Himachal Pradesh, has likened herself to Big B which has led to considerable chatter on the internet."},"Kareena Kapoor has the cheekiest comment for stepson Ibrahim Ali Khan and F1 racer Charles Leclerc's viral pic":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429568-untitled-design-2.png?imwidth=400","link":"https://www.wionews.com/entertainment/kareena-kapoor-has-the-cheekiest-comment-for-stepson-ibrahim-ali-khan-and-f1-racer-charles-leclercs-viral-pic-718445","content":"Saif and Amrita share two children, daughter Sara Ali Khan and son Ibrahim Ali Khan.Bollywood actor Saif Ali Khan's eldest son Ibrahim Ali Khan also reached the venue as the Puma brand ambassador.While sharing some pictures of his first meeting with the Monacan motorsports racing driver, Ibrahim wrote, \"I know, even Charles confused me for a Ferrari driver (emojis) @charles_leclerc @pumaindia.At the Grand Prix, Ibrahim met racing star Charles LeClerc, who confused the star kid for a Ferrari driver."},"Pavail Gulati to reunite with Saiyami Kher for second season of Ashwiny Iyer Tiwari's Faadu":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429530-untitled-design-2024-05-06t112541117.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/pavail-gulati-to-reunite-with-saiyami-kher-for-second-season-of-ashwini-iyer-tiwaris-faadu-718382","content":"Following the resounding success of the first season of the gripping series Faadu, rumours are swirling around the potential involvement of acclaimed actor Pavail Gulati in its highly anticipated sequel.\"  A source closer to the series expressed enthusiasm about the possibility of reuniting with the talented cast, adding, \"The chemistry between Pavail and Saiyami was a highlight of the first season, and we would love to explore their dynamic further in a potential sequel.In response to inquiries about his potential involvement in the sequel, Pavail remained tight-lipped, stating, \"I am humbled by the love and support we received for Faadu.I’m sure we can bring the magic of season 1 to the story to take it forward from where it was left off earlier."},"No bra, tiniest thong and bedsheet! Doja Cat's risqué date look causes uproar online":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429514-untitled-design-2024-05-06t102052494.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-no-bra-tiniest-thong-and-bedsheet-doja-cats-risqué-date-look-causes-uproar-online-718365","content":"American singer and rapper Doja Cat, who loves to stir pots every now and then, is taking social media by storm, all because of her bold look for a quick shopping spree with her new beau Brett Nelson.Viral photos show the singer walking across the streets wearing just a thong and a bedsheet, which she wrapped around her body like a cover dress.Several viral photos and videos from the show caught Doja smoking inside the Met Gala venue, which is strictly prohibited.Last year, Doja transformed into Karl Lagerfeld’s cat, Choupette, to honour the great fashion designer at the 2023 Met Gala."},"Met Gala 2024: Indian philanthropist Sudha Reddy to attend fashion event, collaborates with Met Museum":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429503-horizons.png?imwidth=400","link":"https://www.wionews.com/entertainment/met-gala-2024-indian-philanthropist-sudha-reddy-to-attend-fashion-event-collaborates-with-met-museum-718348","content":"She is among the few Indians we will see at the Met Gala red carpet this year.Hyderabad-based philanthropist and businesswoman Sudha Reddy has partnered with the Metropolitan Museum of Art and will be walking the red carpet.Apart from the collaboration, Sudha will also grace the red carpet.Sudha was first seen on the Met Gala red carpet in 2021 when she wore a stunning custom  Falguni Shane Peacock."},"Madonna's free concert in Rio attended by record 1.6 million, making it biggest standalone show":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/11/417762-untitled-design.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-madonnas-free-concert-in-rio-pulls-in-massive-crowds-16-million-attended-the-show-718332","content":"It felt like the whole city turned up as Madonna put on a free concert in Brazil’s Rio de Janeiro.” Madonna’s concert in Rio is part of her Celebration Tour, marking her 40 years in music.Eighteen sound towers were set up on the beach to make sure that all  concertgoers were able to hear Madonna, the news agency said in a report.Before Madonna arrived for the show, crowds of fans were seen dancing to Madonna's songs played from the speakers on the stage."},"Karan Johar slams Kettan Singh and Madness Machayenge for poor mimicry of him; comic apologises":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429487-untitled-design-2024-05-06t092005094.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-karan-johar-slams-kettan-singh-and-madness-machayenge-for-poor-mimicry-of-him-comic-apologises-718331","content":"His note read, \"I was sitting and watching television with my mom… and saw a promo of a reality comedy show on a supposedly respectable channel… a comic was mimicking me in exceptionally poor taste… I expect this from trolls and faceless and nameless people but when your own industry can disrespect someone who has been in the business for over 25 years it speaks volumes about the times we live in… this doesn’t even anger me it just makes me sad!First of all, whatever impersonation I do because I watch a lot of Karan Johar on the coffee show, I am a fan of his work.I am a huge fan of his work and his show.He explained that his impersonation of Johar was inspired by watching him on talk shows and being a fan of his work."},"Ouch! Kim Kardashian faces loud boos at Tom Brady's live Netflix roast show":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429481-untitled-design-2024-05-06t082017432.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/ouch-kim-kardashian-faces-loud-boos-at-tom-bradys-live-netflix-roast-show-718310","content":"\" A third user said, \"Kim Kardashian getting publicly booed at Tom Brady’s roast is one of the greatest things to ever happen ever.\"Kim Kardashian getting publicly booed at Tom Brady’s roast is one of the greatest things to ever happen ever.The makeup mogul reached the stage to roast and ridicule Tom Brady but she herself ended up getting roasted by the audience.com/G831U3LcfjKim Kardashian received tons of boo’s when she got up on the stage at the Tom Brady roast 😳😳pic."},"Rana Daggubati says Kalki 2898 AD will give Indian cinema an 'Avengers moment'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429468-untitled-design-2024-05-06t074730007.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/rana-daggubati-says-kalki-2898-ad-will-give-indian-cinema-an-avengers-moment-718292","content":"Not just us but actor Rana Daggubati is also excited for the much-anticipated release of Nag Ashwin's sci-fi action-thriller, Kalki 2898 AD.The film will be release in Hindi and Telugu, along with dubbed versions in Tamil, Kannada, Malayalam, and English.Directed by Nag Ashwin, the film is inspired by Hindu mythology and is set in a post-apocalyptic world in 2898 AD.I am really looking forward to that film and it could really become a global film from Telugu (cinema)."},"Kareena Kapoor Khan opens up about Crew's box office success: Women can also break BO records":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/01/06/323549-4.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-kareena-kapoor-khan-opens-up-about-crews-box-office-success-women-can-also-break-bo-records-718290","content":"The box office success of her latest release Crew is a sign that there is no gender bias today, says actor Kareena Kapoor Khan, who is happy the heist comedy has 'broken barriers' when it comes to films fronted by women.The actor, a passionate advocate of child rights, education and health, said she is looking forward to utilising her reach as a celebrity to help in her role as UNICEF India's National Ambassador.Going forward, Kareena said she will continue to associate herself with projects that \"break norms\".\"Through UNICEF, I have grown from the person I was 10 years ago to what I am today as a National Ambassador..."},"Bernard Hill, Titanic and Lord of the Rings actor, dies aged 79":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429438-happy-30th-birthday-2024-05-05t200614698.png?imwidth=400","link":"https://www.wionews.com/entertainment/bernard-hill-titanic-and-lord-of-the-rings-actor-dies-aged-79-718238","content":"Hollywood actor Bernard Hill is no more.RIP Bernard Hill, who left us with some great performances, not least the legendary Yosser Hughes in Boys From The Blackstuff.''It’s with great sadness that I note the death of Bernard Hill.Mourning Hill's death, Dickson wrote on X: ''It’s with great sadness that I note the death of Bernard Hill."},"Prince William and Kate Middleton ‘going through hell’ amid her cancer battle, reveals friend":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/13/418099-horizons-2024-03-13t100440699.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-prince-william-and-kate-middleton-going-through-hell-amid-her-cancer-battle-718229","content":"\" Earlier, William gave a brief health update of his wife during his visit to Tyne, England.\"All doing well,\" William told the two women, who asked about Kate's health."},"Kareena Kapoor Khan says Singham Again is a ‘male testosterone film’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/08/04/152958-new-13.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-kareena-kapoor-khan-says-singham-again-is-a-male-testosterone-film-718212","content":"In the movie, the Piku star will play the role of Shakti Shetty.Furthermore, in the upcoming movie, she will play the role of Ajay's wife.”Directed by Shetty, the film boasts a star-studded cast including Ajay Devgn, who will reprise the role of Bajirao Singham.In the movie that is loaded with a male-star cast, Kareena has revealed, that both her and Deepika's characters play pivotal roles in the third movie of the Singham franchise."},"Megalopolis: Teaser, cast, synopsis and everything to know about Francis Ford Coppola’s film":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429410-happy-30th-birthday-2024-05-05t155513970.png?imwidth=400","link":"https://www.wionews.com/entertainment/francis-ford-coppola-megalopolis-adam-driver-stops-time-in-the-first-teaser-of-long-awaited-sci-fi-718192","content":"The City of New Rome must change, causing conflict between Cesar Catilina (Adam Driver), a genius artist who seeks to leap into a utopian, idealistic future, and his opposition, Mayor Franklyn Cicero (Giancarlo Esposito), who remains committed to a regressive status quo, perpetuating greed, special interests, and partisan warfare.Starring prolific actor Adam Driver, the movie is set to premiere at the Cannes Film Festival this year.In the first short clip from the movie, Adam who is an architect is standing on the edge of a high-rise building, as we see him jump-off the building.On Saturday (May 4), the first teaser of the movie was released, and after watching the short clip from the movie, we can surely say that another classic piece from the director is on the way."},"Alia Bhatt to attend Met Gala 2024 after making debut last year: Report":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/03/349207-untitled-design-2023-05-03t112154475.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-alia-bhatt-to-attend-met-gala-2024-after-making-debut-last-year-report-718175","content":"This year, the Raazi star will be one of the few Indian celebrities who will be part of the Met Gala fashion parade.The whole world is gearing up for the Met Gala 2024, and this year, Bollywood actress Alia Bhatt will be at the MET Gala, as per Indian news channel India Today.Last year, Alia channelled her inner princess at The Metropolitan Museum of Art as she walked at the iconic stairs wearing a custom Prabal Gurung ball gown made of pearls for the Met Gala theme 'Karl Lagerfeld: A Line of Beauty', which was a homage to the legendary fashion designer.I’m definitely not attending this year because I’m filming, but I think I really do enjoy watching people's creativity during the Met Gala and I am really excited to see how it will turn out."},"Amitabh Bachchan completes work on Rajinikanth-starrer Vettaiyan":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/11/17/311497-untitled-design-89.png?imwidth=400","link":"https://www.wionews.com/entertainment/amitabh-bachchan-completes-work-on-rajinikanth-starrer-vettaiyan-718198","content":"Bachchan, who last worked with Rajinikanth in the 1991 film Hum, shared the update on the project on his personal blog on Saturday.But ever the dissatisfaction of a doubt, when in reflection, whether the work done was to satisfaction and whether there shall be an opportunity to have another try to redo and maybe improve the previous.\"Another day at work comes to an end and the end too of this project, for me.Megastar Amitabh Bachchan says he has finished shooting for Tamil film Vettaiyan, fronted by Rajinikanth."},"Kareena Kapoor appointed as Unicef India's National Ambassador: 'Emotional day for me'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429382-happy-30th-birthday-2024-05-05t122224267.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-kareena-kapoor-appointed-as-unicef-indias-national-ambassador-emotional-day-for-me-718152","content":"The Crew star, who has been associated with UNICEF India since 2014, will support the not-for-profit organisation in furthering every child’s right to early childhood development, health, education and gender equality, a press release said.She joins as UNICEF India National Ambassador together with our four Youth Advocates to the UNICEF family.UNICEF India on Saturday announced Bollywood star Kareena Kapoor Khan as its new National Ambassador.UNICEF India Representative Cynthia McCaffrey said she is delighted to welcome Kareena Kapoor Khan as the National Ambassador."},"Kendrick Lamar vs Drake beef explained by Dua Lipa on SNL: Watch":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429380-untitled-design-2024-05-05t121812002.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/kendrick-lamar-vs-drake-beef-explained-by-dua-lipa-on-snl-watch-718156","content":"And, to explain it all to fans, Dua Lipa turned into a culture critic who has been locked away \"for the past 48 hours trying to piece it all together\" for the latest episode of Saturday Night Live.In the last 36 hours, Lamar has released two diss tracks targeting Drake.And to make her latest appearance extra special, she pulled double duty as host and musical guest for the episode.While Drake suggested that Kendrick’s son was actually fathered by Kendrick’s general manager, Dave Free, in \"Family Matters\", Lamar opened \"Meet the Grahams\" by telling Adonis he’s sorry Drake is his father."}}