{"Rita Ora’s nude Met Gala dress reminds netizens of Kanye West’s wife Bianca Censori":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429960-happy-30th-birthday-2024-05-07t213815599.png?imwidth=400","link":"https://www.wionews.com/entertainment/rita-oras-nude-met-gala-dress-reminds-netizens-of-kanye-wests-wife-bianca-censori-719069","content":"One user wrote, ''The dress may well have a story but the look is giving me Kanye's wife vibes.Both ascended to the event wearing the outfits as per the event's theme Sleeping Beauties: Reawakening Fashion with the dress code, The Garden of Time.The caption reads, ''After walking the iconic white and green carpet, Ora shared a set of pictures on her Instagram handle with a caption, mentioning that her dress encapsulates the most delicate and powerful manner a real tapestry of human crafts spanning a period of two millennia from Egypt to Rome.In the brief interview with Vogue, Ora revealed that her dress had a very ancient connection, as she said that the beads are, ''older than anyone on this planet.The 2024 Met Gala is over, and if we look back at the most revealing or nude outfits, then the one name that takes the first spot is of singer Rita Ora, who surprised all the spectators with her sartorial pick."},"King Charles too busy to see son Prince Harry during UK trip":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/05/349783-untitled-design-2023-05-05t193351086.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-king-charles-too-busy-to-see-son-prince-harry-during-uk-trip-719051","content":"Prince Harry will not be seeing his father King Charles during his current visit to Britain as the monarch will be too busy, Harry's spokesperson said on Tuesday.\"In response to the many inquiries and continued speculation on whether or not the duke will meet with his father while in the UK this week, it unfortunately will not be possible due to His Majesty’s full programme,\" the spokesperson said.\"Harry's last publicised trip came in February when he made a flying visit to see his father for a quick reunion after Buckingham Palace revealed that the 75-year-old king had been diagnosed with cancer.The younger son of King Charles has only been back in Britain on a few occasions since he and his American wife Meghan stepped down from their official royal roles in 2020 and moved to Los Angeles where they live with their two young children.After leaving Britain, Harry will be joined by his wife Meghan for a visit to Nigeria."},"Arijit Singh trims his nails while performing at Dubai concert, fans call it ‘unprofessional’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429948-happy-30th-birthday-2024-05-07t201518537.png?imwidth=400","link":"https://www.wionews.com/entertainment/arijit-singh-trims-his-nails-while-performing-at-dubai-concert-fans-call-it-unprofessional-719049","content":"What a pleasure it is to watch an artist perform..But more than that, it's beautiful when you see humility in an artist.."},"Wait, what? Camila Cabello walks carrying a block of Ice at Met Gala 2024":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429932-happy-30th-birthday-2024-05-07t184337862.png?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-wait-what-camila-cabello-walks-carrying-a-block-of-ice-at-met-gala-2024-719022","content":"com/bVlQS5CiODApart from her dress, the one thing in her attire that created an immense buzz was a real ice block, which many at first glance would have thought was a normal clutch.While many of the attire from the event stood out, the one accessory that has crossed all the boundaries of creativity is Camila Cabello's ice purse.With the “Garden of Time” themed event, A-listers participated in the grand extravaganza wearing the best sartorial looks they could.The Senorita showed up at the 2024 MET GALA, famously called fashion's biggest night, wearing a attire, that left many starstruck at the venue, and on social media as well.The block that also had a black rose inside it coincided best with the Metropolitan Museum exhibitions theme."},"Deepfake alert! AI generated Met Gala images of Rihanna and Katy Perry go viral":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429907-happy-30th-birthday-2024-05-07t171010794.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-deepfake-alert-ai-generated-met-gala-images-of-rihanna-and-katy-perry-go-viral-718983","content":"This year many celebrities like Rihanna, Katy Perry, and Lady Gaga, who have been regular attendees of the charity gala, were absent from the event.Fans were quick to think that all the deep fake images were real, and have been re-sharing the images continuously.The next one showed her dressed in another dress featuring a copper corset with a green-leaves-like skirt.One photo showed Rihanna dressed in an elaborate gown with embroidery of green leaves and yellow birds.While looking at the images, one can easily get confused and may think it's real."},"Miss USA 2023 Noelia Voigt resigns from her title to focus on her mental health":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429894-your-paragraph-text-2024-05-07t161857408.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-miss-usa-2023-noelia-voigt-resigns-from-her-title-to-focus-on-her-mental-health-718955","content":"\"Soon after Voigt announced her resignation, the Miss USA Organization offered \"respect and support\" to her decision to step down from her duties.Noelia Voigt, the reigning Miss USA, has resigned from her title to focus on her mental health.\"The organization is currently reviewing plans for the transition of responsibilities to a successor and an announcement regarding the crowning of the new Miss USA will be coming soon.\"My journey as Miss USA has been incredibly meaningful, representing Utah with pride, and later the USA at Miss Universe.\"\n\nShe shared gratitude for being able to use her platform to advocate for \"anti-bullying, dating violence awareness and prevention, immigration rights and reform and shedding light on my roots as the first Venezuelan-American woman to win Miss USA.\""},"Sabyasachi makes history, becomes first Indian designer to attend Met Gala":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429886-happy-30th-birthday-2024-05-07t152606872.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-sabyasachi-makes-history-becomes-first-indian-designer-to-attend-met-gala-718942","content":"Mukherjee, who is a known face in the fashion world, became the first Indian fashion designer to ever walk at the iconic Met steps.Like always, he added the essence of Indian culture and heritage to his look, through his jewellery.Sabyasachi wears an embroidered cotton duster coat from the Sabyasachi Resort 2024 collection layered with tourmalines, pearls, emeralds and diamonds from Sabyasachi High Jewellery.Decoding the designer's look, he wore a duster coat, paired with a white shirt and beige pants.Sharing dreamy photos of her, Alia in the caption of her Instagram post wrote that it took \"a total of 1965-man hours\" to create her saree."},"Rihanna skipped Met Gala 2024 for this reason":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429144-happy-30th-birthday-2024-05-03t184946494.png?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-rihanna-skipped-met-gala-2024-for-this-reason-718920","content":"A source close to Riri told People that the singer and her partner A$AP Rocky had plans to attend the annual gala but had to cancel owing to bad health.In past years, Rihanna, 36, and partner A$AP Rocky, 35, have made some heads turn with their fashionable appearances at the Met Gala.On Monday, FBad Bunny's Tudor-inspired hat and shoes resembling cloven hooves to the hummingbird perched delicately on Zendaya's neck set the tone for fashion's biggest night -- the annual Met Gala in New York.The singer-entrepreneur gave this year's gala a miss as she was reportedly resting at home.Fashion's biggest night, The Met Gala seems incomplete without Queen Rihanna."},"‘We have voted, have you?’: Riteish Deshmukh, Genelia share picture with inked finger after casting vote":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429860-happy-30th-birthday-2024-05-07t140220173.png?imwidth=400","link":"https://www.wionews.com/entertainment/lok-sabha-election-2024-riteish-deshmukh-genelia-deshmukh-cast-their-votes-urge-people-to-cast-vote-718903","content":"Using their right to vote, Bollywood actor Riteish Deshmukh and his actor wife Genelia D'souza cast their vote in Latur, a city in the Indian state of Maharashtra.Mentioning that he has travelled from Mumbai to Latur, his hometown, to exercise his right to vote, the actor said, “I came to Latur from Mumbai to cast my vote.Earlier in the day, Riteish along with wife Genelia and mother Vaishali Deshmukh were spotted at a polling booth.Later, the actor posted a picture showing him, his wife Genelia and his mother, as all of them posing with their inked fingers.''\n\nInteracting with the news agency ANI outside the polling booth, the couple encouraged people to step out of their homes and vote."},"Heeramandi star Shekhar Suman joins BJP: 'Many things in life happen knowingly or unknowingly'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2019/02/01/82451-untitled-design-21.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/heeramandi-star-shekhar-suman-joins-bjp-many-things-in-life-happen-knowingly-or-unknowingly-718895","content":"Actor Shekhar Suman, who was recently seen in Sanjay Leela Bhansali's Heeramandi: The Diamond Bazaar, joined the ruling Bharatiya Janata Party (BJP) at the party headquarters in Delhi on Tuesday (May 7).\"Log kahi ye na kahe ki mere paas karne ko kuch nahi tha, isliye politics join ki (I didn't want people to say that I joined politics because I had now work).Reflecting on the learnings and the unexpected opportunity, Shekhar expressed gratitude for the chance to work with Bhansali.Just last week, TV star Rupali Ganguly joined the party.Along with Suman, former Congress National Media Coordinator, Radhika Khera too joined the party."},"Lok Sabha Elections 2024: Ranbir Kapoor, KJo and others urge fans to vote in a quirky way - Watch":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429841-happy-30th-birthday-2024-05-07t124847253.png?imwidth=400","link":"https://www.wionews.com/entertainment/lok-sabha-elections-2024-ranbir-kapoor-kjo-and-other-celebs-urge-fans-to-vote-in-a-quirky-way-watch-718869","content":"On Monday (May 6), A-listers from different walks of life came together to raise voting awareness among the people.Bollywood celebrities like ace filmmaker Karan Johar, actors Ranbir Kapoor, Boman Irani, and Sidharth Malhotra, among others, came together to raise voting awareness among the people.Shared on the Instagram handle of Karan Johar, the quirky video showed actors, singers, filmmakers, and cricketers, coming together as they urged the netizens to use their precious time to cast their votes.”  Further, the stars emphasised how voting in the election will help change their lives.We see Sidharth Malhotra, Karan, Boman Irani and other celebs sarcastically praising fans who enthusiastically voted on the polls to help stars make silly life decisions."},"Demi Lovato returns to Met Gala eight years after calling it 'fake'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429840-your-paragraph-text-2024-05-07t124505577.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/demi-lovato-returns-to-met-gala-eight-years-after-calling-it-fake-718864","content":"Eight years after dissing the Met Gala, singer Demi Lovato made an unexpected return to the event on Monday night (May 6).The singer had vowed to never return to the fashion's biggest night after her experience at the 2016 edition of the gala.\"\n\nLovato said she felt more connected with the homeless people at the AA meeting, who were dealing with similar struggles (with addiction) than with the attendees at the Met Gala.com/HOCbE4kfeuFollowing her 2016 Met Gala debut, the singer shared a now-deleted photo on social media with hashtags like \"#cool #sof—kingawkward #notforme.She had described the gala as \"fake and sucking the fashion industry's d—k."},"Cannes 2024: Ankush Bahuguna to become first Indian male beauty influencer to debut at Cannes":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429839-horizons-2024-05-07t123408954.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-cannes-2024-ankush-bahuguna-to-become-first-indian-male-beauty-influencer-to-debut-at-cannes-718883","content":"Indian beauty content creator Ankush Bahuguna will walk the Cannes red carpet this year.Selected from among scores of global beauty influencers, WION has learnt that Ankush will debut this year at the much-awaited 77th Cannes Film Festival.Cannes Film Festival will see a bevvy of Indian stars on the red carpet.The Indian beauty influencer has carved a niche space for himself with his versatility in the digital landscape around beauty -- breaking gender norms and juggling genres through highly captivating and engaging content.Bahuguna has worked his way to become one of the biggest names in the Indian beauty and comedy content creation spaces today, with millions of followers across social media platforms."},"Kim Kardashian-Kendall Jenner turn up the heat with their stylish Met Gala walks":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429802-horizons-2024-05-07t104603562.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-kim-kardashian-kendall-jenner-turn-up-the-heat-with-their-stylish-met-gala-walks-718816","content":"From the first time that Kim turned up at the Met, to her baby bump year, her head-to-toe black bodysuit Balenciaga look and the controversial dress borrowed from Marilyn Monroe, Kardashian is always one of the most-talked-about guests at the Met Gala every year.Kim Kardashian turned icy blonde to complement her silver dress which featured a corset, a see-through skirt and a grey cardigan that covered her shoulders.Marking her 11th time at the Met Gala, Kim Kardashian interpreted this year’s theme with silver and grey.The dress was butt-baring and marked the first time that anyone wore the dress.She came dressed in a beautiful sparkling silver dress that had cutout flowers."},"Meet Mona Patel, the Indian fashion entrepreneur who made heads turn at Met Gala 2024":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429799-your-paragraph-text-2024-05-07t104013986.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-meet-mona-patel-the-indian-fashion-mogul-who-made-heads-turn-at-met-gala-2024-718795","content":"Indian fashion entrepreneur Mona Patel made heads turn at the Met Gala 2024 with her stunning 'mechanical butterflies' dress.\"Mona Patel wearing a custom Iris van Herpen dress with moving, fluttering butterflies for the 2024 #MetGala,\" another user wrote.com/sGL7jbEsgVmona patel in custom iris van herpen at the 2024 met gala with moving butterfly pieces, styled by law roach 🦋 pic.Patel made her debut at the Met Gala in a futuristic Iris Van Herpen outfit that was designed in accordance with the dress code of the Gala- The Garden Of Time.The Indian girls EATING at the #MetGala Alia bhatt and Mona Patel SLAYED!!!"},"Alia Bhatt to Simone Ashley: Celebs with Indian roots shine at Met Gala 2024":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429776-your-paragraph-text-2024-05-07t091001821.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-alia-bhatt-to-simone-ashley-all-the-indians-at-the-met-gala-2024-718751","content":"Alia Bhatt\n\nAfter making her debut at the Met Gala last year, Alia stunned in a custom-designed, mint green Sabyasachi saree this year.Held on the first Monday of May every year, the Met Gala is a grand charity event that is attended by fashion designers, actors, singers, politicians and more.com/WiS9U9KbP5The Bridgerton star arrived on the Met Gala red carpet in a cutout navy blue dress designed by Prabal Gurung.com/W2frweByVEMindy Kaling at the Met Gala wow pic.From Alia Bhatt to rising star Ambika Mod, here are all the Indians at the Met Gala this year."},"From wet shirt to towel, Doja Cat turns up in OUTRAGEOUS clothes at Met Gala 2024":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429762-horizons-2024-05-07t090416096.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-from-wet-shirt-to-towel-doja-cat-turns-up-in-outrageous-clothes-at-met-gala-2024-718735","content":"Also read: Met Gala 2024: Zendaya stuns in a second look on the red carpet which is as dramatic as the firstDoja Cat had earlier made news when she walked out on a date with her beau wearing only a thong and a bedsheet.American singer and rapper Doja Cat walked the Met Gala red carpet earlier today and it was nothing short of shocking.As she walked the red carpet, onlookers and social media fans of the singer trolled her for her outrageous outfit choice.She then walked the red carpet after an outfit change and this wasn’t better either.Before she walked the red carpet, she caught everyone’s attention with a bathing towel that she held on to."},"Met Gala 2024: Zendaya stuns in a second look as dramatic as the first on the red carpet":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429745-your-paragraph-text-2024-05-07t081034689.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-met-gala-2024-zendaya-stuns-in-a-second-look-on-the-red-carpet-which-is-as-dramatic-as-the-first-718700","content":"Just when fans were going gaga over Zendaya's look on the red carpet, the actress surprised everyone with a second high-fashion look at the Met Gala on Monday (May 6).The actress, 27, who is a co-chair of the event, sizzled in a 1996 black Givenchy gown by John Galliano with an Alexander McQueen circa 2007 floral hat.In Pics: Met Gala 2024: Best and worst looks from biggest fashion event of the yearShomini has written on entertainment and lifestyle for the most part of her career.zendaya wearing custom maison margiela by john galliano at the met gala 2024, styled by law roach pic.The Met Gala's theme this year is Sleeping Beauties: Reawakening Fashion while the dress code is The Garden of Time."},"Hummingbirds and hooves take over the red carpet at Met Gala":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429721-untitled-design-2024-05-07t054826490.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-hummingbirds-and-hooves-take-over-the-red-carpet-at-met-gala-718673","content":"Puerto Rican singer Bad Bunny evoked a kind of Tudor matador with a sweeping hat and a black bouquet, with the only pop of color his bright red inseam and the patent shine of his cloven shoes.For sheer drama, co-hosts Bad Bunny and Zendaya along with rapper Cardi B and singer Lana del Rey commanded the red carpet.From Bad Bunny's Tudor-inspired hat and shoes resembling cloven hooves to the hummingbird perched delicately on Zendaya's neck, the hosts set the tone at fashion's biggest night -- the annual Met Gala in New York.Celebrity interpretation of Met Gala themes have been wide-ranging and often sparked social media debate -- but attendees this year appeared to shrug off the pressure.For her first Met Gala since 2019 the 27-year-old star was wreathed in jewel-toned lame, organza and satin designed by John Galliano, with vines crawling up her duchess corset and arms and what appeared to be a hummingbird nestled into her neck."}}