{"Alia Bhatt to Simone Ashley: All the Indians at the Met Gala 2024":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429776-your-paragraph-text-2024-05-07t091001821.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-alia-bhatt-to-simone-ashley-all-the-indians-at-the-met-gala-2024-718751","content":"Alia Bhatt\n\nAfter making her debut at the Met Gala last year, Alia stunned in a custom-designed, mint green Sabyasachi sari this year.Held on the first Monday of May every year, the Met Gala is a grand charity event that is attended by fashion designers, actors, singers, politicians and more.com/WiS9U9KbP5Bridgerton star arrived on the Met Gala red carpet in a cutout navy blue dress designed by Prabal Gurung.com/W2frweByVEMindy Kaling at the Met Gala wow pic."},"From wet shirt to towel, Doja Cat turns up in OUTRAGEOUS clothes at Met Gala 2024":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429762-horizons-2024-05-07t090416096.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-from-wet-shirt-to-towel-doja-cat-turns-up-in-outrageous-clothes-at-met-gala-2024-718735","content":"Also read: Met Gala 2024: Zendaya stuns in a second look on the red carpet which is as dramatic as the firstDoja Cat had earlier made news when she walked out on a date with beau, wearing only a thong and a bedsheet.American singer and rapper Doja Cat walked the Met Gala red carpet earlier today and it was nothing short of shocking.As she walked the red carpet, onlookers and social media fans of the singer trolled her for her outrageous outfit choice.She then walked the red carpet after an outfit change and this wasn’t better either."},"Met Gala 2024: Zendaya stuns in a second look as dramatic as the first on the red carpet":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429745-your-paragraph-text-2024-05-07t081034689.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-met-gala-2024-zendaya-stuns-in-a-second-look-on-the-red-carpet-which-is-as-dramatic-as-the-first-718700","content":"Just when fans were going gaga over Zendaya's look on the red carpet, the actress surprised everyone with a second high-fashion look at the Met Gala on Monday (May 7).The actress, 27, who is a co-chair of the event, sizzled in a 1996 black Givenchy gown by John Galliano with an Alexander McQueen circa 2007 floral hat.In Pics: Met Gala 2024: Best and worst looks from biggest fashion event of the yearShomini has written on entertainment and lifestyle for the most part of her career.com/t0t8dsGe0NThe Costume Institute's spring exhibition falls on the first Monday in May every year and is held at New York City's Metropolitan Museum of Art."},"Hummingbirds and hooves take over the red carpet at Met Gala":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429721-untitled-design-2024-05-07t054826490.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-hummingbirds-and-hooves-take-over-the-red-carpet-at-met-gala-718673","content":"Puerto Rican singer Bad Bunny evoked a kind of Tudor matador with a sweeping hat and a black bouquet, with the only pop of color his bright red inseam and the patent shine of his cloven shoes.For sheer drama, co-hosts Bad Bunny and Zendaya along with rapper Cardi B and singer Lana del Rey commanded the red carpet.From Bad Bunny's Tudor-inspired hat and shoes resembling cloven hooves to the hummingbird perched delicately on Zendaya's neck, the hosts set the tone at fashion's biggest night -- the annual Met Gala in New York.Celebrity interpretation of Met Gala themes have been wide-ranging and often sparked social media debate -- but attendees this year appeared to shrug off the pressure."},"Met Gala 2024: Alia Bhatt channels Indian princess in custom Sabyasachi saree featuring 23-foot-long train":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429723-untitled-design-2024-05-07t055631738.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-met-gala-2024-alia-bhatt-channels-indian-princess-in-custom-sabyasachi-saree-featuring-23-foot-long-train-718671","content":"The 31-year-old Indian actress took the help of her longtime stylist and red carpet collaborator Anaita Shroff Adajania to curate the look, which perfectly aligns with this year's dress code, The Garden of Time.This year, however, she decided to pay an ode to her Indian roots in this gorgeous saree.“The saree's design, with its translucent, glass-like appearance is not just a nod to the ethereal quality of the garden in Ballard's story but also a tribute to the exquisite, enduring craft of sari-making,” Alia explained ahead of her red carpet appearance.Bollywood actress Alia Bhatt marked her second Met Gala appearance wearing an intricately handcrafted Sabyasachi saree, studded with real gems."},"Met Gala 2024 as it happened! Best looks, top moments and more":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429787-untitled-design-2024-05-07t094536771.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-met-gala-2024-live-updates-red-carpet-looks-highlights-and-more-718669","content":"The Indian actress took the help of her longtime stylist and red carpet collaborator Anaita Shroff Adajania to curate the look, which perfectly aligns with this year's dress code.2) Anna Wintour, the Met Gala queen and Vogue's iconic editor-in-chief, arrived at the 2024 Met Gala in a custom Loewe ensemble, featuring dramatic, long black blazer adorned with red and yellow flowers.To mark her Met Gala debut, Tyla opted for this daring strapless dress, which was made to hug every inch of her body before flaring out into an organza mermaid train.1) The Met Gala carpet this year isn't red."},"Pakistani viewer watches Heeramandi, calls out Sanjay Leela Bhansali over inaccuracies":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429711-your-paragraph-text-89.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-pakistani-viewer-watches-heeramandi-calls-out-sanjay-leela-bhansali-over-inaccuracies-718661","content":"If you call it Lahore, show Lahore,\" the user said.In a long thread on X, Hamd listed out in inaccuracies in the show and stated that it does not correctly represent 1940s Lahore.I mean either you don’t set your story in 1940’s Lahore, or if you do- you don’t set it in Agra’s landscape, Delhi’s Urdu, Lakhnavi dresses and 1840’s vibe.Not a single redeeming quality in his movies, only self-indulgent claptrap,\" wrote another user."},"The Family Man is back! Manoj Bajpayee and team begin shoot of season 3":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/10/09/384984-horizons-2023-10-09t155349550.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/the-family-man-is-back-manoj-bajpayee-and-team-begins-shoot-of-season-3-718633","content":"Srikant will expertly confront the looming threat to national security, while balancing the demands of family life and desperately working to mend his relationship with his wife, in the forthcoming season.Fans have been eagerly waiting for the third season of the immensely successful The Family Man.Created by the maverick duo Raj & DK, under their banner D2R Films, the critically acclaimed action thriller riveted audiences across the world since the Season 2 finale, garnering a massive fan following.Season 3, currently in production, will be available on Prime Video upon its release."},"Met Gala 2024: What does the theme 'Sleeping Beauties: Reawakening Fashion' mean?":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/02/348974-untitled-design-2023-05-02t113316073.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-met-gala-2024-what-does-the-theme-sleeping-beauties-reawakening-fashion-mean-718602","content":"' Shomini has written on entertainment and lifestyle for the most part of her career.What was once a vital part of a person's lived experience is now a motionless 'artwork' that can no longer be worn or heard, touched, or smelled."},"Ananya Panday smiles as she is snapped amid reports of break up with Aditya Roy Kapoor":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/03/13/338345-untitled-design-2023-03-13t114253440.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-ananya-panday-snapped-in-mumbai-amid-reports-of-her-break-up-with-aditya-roy-kapoor-718564","content":"A close friend of the two confirmed their break up to the news publication and said, \"They broke up almost a month ago.”Aditya and Ananya have been dating for almost two years.Ananya's appearance comes a day after a news report claimed she had broken up with actor Aditya Roy Kapoor.The two were recently seen at the premiere of Heeramandi, although they made separate entry to the event."},"Exclusive: India's oldest fusion band Indian Ocean on AI, music and more":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429623-horizons-8.png?imwidth=400","link":"https://www.wionews.com/entertainment/exclusive-indias-oldest-fusion-band-indian-ocean-on-ai-music-and-more-718524","content":"Known for being one of the most eclectic music bands in India, Indian Ocean recently performed again at the Dublin Square in Mumbai.The beauty of the Indian audiences is that they have always shown interest in new kinds of music and sounds and have always welcomed people with new ideas.Q: Indian Ocean started fusion music when most didn’t understand what it meant.At Dublin Square in Phoenix Marketcity Mumbai, we played music from our latest album which was released last year called “Tu Hai” as well as some of our earlier songs."},"Pankaj Tripathi's international film Mango Dreams to release in India on May 16":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429577-horizons-1.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-pankaj-tripathis-international-film-mango-dreams-to-release-in-india-on-may-16-718462","content":"The film will get its India release on May 16 and it will release on the OTT platform, Open Theatre.Pankaj Tripathi starrer Mango Dreams will finally be released in India after travelling to a series of film festivals.The award-winning international film is helmed by American director John Upchurch.The film earned him the Best Actor Award at the Capetown International Film Market and Festival in 2017."},"Love and respect I get second only to Amitabh Bachchan, says Kangana Ranaut; netizens react":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429557-your-paragraph-text-87.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/kangana-ranaut-says-after-amitabh-bachchan-she-gets-similar-love-and-respect-internet-says-joke-of-the-year-718426","content":"The video of her speech has since gone viral and has led to multiple comments on social media with many making sarcastic jibes about her comparison to one of Bollywood’s most revered icons, despite her recent string of box office failures.Bollywood star-turned-politician Kangana Ranaut compared herself to Indian icon Amitabh Bachchan during her recent speech while campaigning for the Lok Sabha Elections 2024.The actress, who is contesting on a Bhartiya Janata Party (BJP) ticket from the Mandi constituency of Himachal Pradesh, has likened herself to Big B which has led to considerable chatter on the internet."},"Kareena Kapoor has the cheekiest comment for stepson Ibrahim Ali Khan and F1 racer Charles Leclerc's viral pic":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429568-untitled-design-2.png?imwidth=400","link":"https://www.wionews.com/entertainment/kareena-kapoor-has-the-cheekiest-comment-for-stepson-ibrahim-ali-khan-and-f1-racer-charles-leclercs-viral-pic-718445","content":"Saif and Amrita share two children, daughter Sara Ali Khan and son Ibrahim Ali Khan.Bollywood actor Saif Ali Khan's eldest son Ibrahim Ali Khan also reached the venue as the Puma brand ambassador.While sharing some pictures of his first meeting with the Monacan motorsports racing driver, Ibrahim wrote, \"I know, even Charles confused me for a Ferrari driver (emojis) @charles_leclerc @pumaindia.At the Grand Prix, Ibrahim met racing star Charles LeClerc, who confused the star kid for a Ferrari driver."},"Pavail Gulati to reunite with Saiyami Kher for second season of Ashwiny Iyer Tiwari's Faadu":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429530-untitled-design-2024-05-06t112541117.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/pavail-gulati-to-reunite-with-saiyami-kher-for-second-season-of-ashwini-iyer-tiwaris-faadu-718382","content":"\"  A source closer to the series expressed enthusiasm about the possibility of reuniting with the talented cast, adding, \"The chemistry between Pavail and Saiyami was a highlight of the first season, and we would love to explore their dynamic further in a potential sequel.Following the resounding success of the first season of the gripping series Faadu, rumours are swirling around the potential involvement of acclaimed actor Pavail Gulati in its highly anticipated sequel.In response to inquiries about his potential involvement in the sequel, Pavail remained tight-lipped, stating, \"I am humbled by the love and support we received for Faadu.I’m sure we can bring the magic of season 1 to the story to take it forward from where it was left off earlier."},"No bra, tiniest thong and bedsheet! Doja Cat's risqué date look causes uproar online":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429514-untitled-design-2024-05-06t102052494.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-no-bra-tiniest-thong-and-bedsheet-doja-cats-risqué-date-look-causes-uproar-online-718365","content":"American singer and rapper Doja Cat, who loves to stir pots every now and then, is taking social media by storm, all because of her bold look for a quick shopping spree with her new beau Brett Nelson.Viral photos show the singer walking across the streets wearing just a thong and a bedsheet, which she wrapped around her body like a cover dress.Several viral photos and videos from the show caught Doja smoking inside the Met Gala venue, which is strictly prohibited.Last year, Doja transformed into Karl Lagerfeld’s cat, Choupette, to honour the great fashion designer at the 2023 Met Gala."},"Met Gala 2024: Indian philanthropist Sudha Reddy to attend fashion event, collaborates with Met Museum":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429503-horizons.png?imwidth=400","link":"https://www.wionews.com/entertainment/met-gala-2024-indian-philanthropist-sudha-reddy-to-attend-fashion-event-collaborates-with-met-museum-718348","content":"She is among the few Indians we will see at the Met Gala red carpet this year.Hyderabad-based philanthropist and businesswoman Sudha Reddy has partnered with the Metropolitan Museum of Art and will be walking the red carpet.Apart from the collaboration, Sudha will also grace the red carpet.Sudha was first seen on the Met Gala red carpet in 2021 when she wore a stunning custom  Falguni Shane Peacock."},"Madonna's free concert in Rio attended by record 1.6 million, making it biggest standalone show":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/11/417762-untitled-design.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-madonnas-free-concert-in-rio-pulls-in-massive-crowds-16-million-attended-the-show-718332","content":"It felt like the whole city turned up as Madonna put on a free concert in Brazil’s Rio de Janeiro.” Madonna’s concert in Rio is part of her Celebration Tour, marking her 40 years in music.Eighteen sound towers were set up on the beach to make sure that all  concertgoers were able to hear Madonna, the news agency said in a report.Before Madonna arrived for the show, crowds of fans were seen dancing to Madonna's songs played from the speakers on the stage."},"Karan Johar slams Kettan Singh and Madness Machayenge for poor mimicry of him; comic apologises":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/06/429487-untitled-design-2024-05-06t092005094.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-karan-johar-slams-kettan-singh-and-madness-machayenge-for-poor-mimicry-of-him-comic-apologises-718331","content":"His note read, \"I was sitting and watching television with my mom… and saw a promo of a reality comedy show on a supposedly respectable channel… a comic was mimicking me in exceptionally poor taste… I expect this from trolls and faceless and nameless people but when your own industry can disrespect someone who has been in the business for over 25 years it speaks volumes about the times we live in… this doesn’t even anger me it just makes me sad!First of all, whatever impersonation I do because I watch a lot of Karan Johar on the coffee show, I am a fan of his work.I am a huge fan of his work and his show.Bollywood filmmaker Karan Johar took to social media on Sunday (May 5) to express disappointment with the way he was portrayed on the comedy show Madness Machayenge – India Ko Hasayenge by comedian Kettan Singh."}}