{"Pierce Brosnan apologises after fined for trespassing in Yellowstone Park walk":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/15/418618-untitled-design-11.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/pierce-brosnan-apologises-after-fined-for-trespassing-in-yellowstone-park-walk-701008","content":"Actor Pierce Brosnan has said he deeply regrets walking off trail in Yellowstone National Park in the United States after he was fined by a court in Wyoming for getting too close to a thermal area.Citing court documents, it said the James Bond actor had in November uploaded photos to Instagram of himself \"standing on a Yellowstone National Park thermal feature at Mammoth Hot Springs\", referring to the scenic area in the park's northern part.\"However, I made an impulsive mistake - one that I do not take lightly - when entering a thermal area covered in snow in Yellowstone National Park to take a photograph.Brosnan, 70, pleaded guilty to foot travel in a thermal area and was fined $500 and required to pay a $1,000 community service payment to the Yellowstone Forever Geological Fund, the U.\"There are signs posted in the area that warn visitors of the dangers of thermal features and state that visitors must remain on the designated boardwalks and trails,\" it said."},"What a night! Ed Sheeran sings in Punjabi with Diljit Dosanjh, crowd goes berserk - Watch":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/17/419003-happy-30th-birthday-2024-03-17t095652790.png?imwidth=400","link":"https://www.wionews.com/entertainment/what-a-night-ed-sheeran-sings-in-punjabi-with-diljit-dosanjh-crowd-goes-berserk-watch-700995","content":"''First Diljit made Sia sing in Punjabi and now Ed Sheeran 😮\n\nNo words left to explain the levels this man has taken PUNJABI MUSIC to 🔥 #DiljitDosanjh #EdSheeran pic.To make his performance in India extra special, Ed collaborated with Punjabi singer Diljeet Dosanjh.One user wrote, ''No words left to explain the levels this man has taken PUNJABI MUSIC to.Shahid Kapoor's wife Mira shared a clip of her daughter dancing as Ed performed live on the stage.''Watching Ed perform on a Punjabi song, netizens couldn't contain their excitement."},"Late singer Sidhu Moosewala’s parents welcome a baby boy, share first photo":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/17/419008-happy-30th-birthday-2024-03-17t100810049.png?imwidth=400","link":"https://www.wionews.com/entertainment/late-singer-sidhu-moosewalas-parents-welcome-a-baby-boy-share-first-photo-700988","content":"Taking to his Instagram handle, he shared a photo of him holding his newborn child as he sat beside the photo of the late singer.Renowned Punjabi singer Moosewala was the only child of his parents.Late Punjabi singer Sidhu Moosewala's parents Charan Kaur and Balkaur Singh have been blessed with a baby boy.The Canada-based singer made his debut into the world of music in 2017 with his debut song ''G Wagon.This track went on to become a chartbuster, earning the singer the Best Lyricist award at the Brit Asia TV Music Awards."},"Road House remake honours Patrick Swayze, says Jake Gyllenhaal":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418948-untitled-design-20.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-road-house-remake-honours-patrick-swayze-says-jake-gyllenhaal-700902","content":"You got to just celebrate,\" said Magnussen.I carried with me some of the tattoos, we designed some tattoos in honour of him, just because I really loved him."},"Crew trailer: Tabu, Kareena, Kriti are ready to take you on a turbulent flight":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418927-happy-30th-birthday-2024-03-16t181613899.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-crew-trailer-tabu-kareena-kriti-is-ready-to-take-you-on-a-turbulent-flight-700869","content":"After a short teaser and posters, the makers have finally dropped the first trailer of the Crew starring three acting powerhouses Tabu, Kareena Kapoor Khan, and Kriti Sanon.On Saturday (March 16), the makers dropped the first trailer of the movie which took us into the troubled life of three flight attendants, who are bored with their low-income job, and the only thing they are now craving is a lavish life that they all have dreamt of living.Helmed by Rajesh Krishnan, the three-minute trailer gave us a sneak peek of the turbulent field flight that the passengers will board on March 29.While Kareena Kapoor Khan's impeccable comic timing will leave you in splits, Tabu effortlessly shines in her role as an air hostess.The three powerhouses shine bright in the trailer, leaving us wanting more."},"Javed Akhtar claps back at Sandeep Reddy Vanga: He couldn’t find an objectionable line in my career":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/02/06/410334-untitled-design-2024-02-06t151621940.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-javed-akhtar-claps-back-at-sandeep-reddy-vanga-he-couldn’t-find-an-objectionable-line-in-my-career-700899","content":"I think in a democratic society, he has the right to make one Animal, and many Animals.In 53 years of my career, he could not find one film, one script, one scene, one dialogue, one song.Veteran screenwriter and lyricist Javed Akhtar has addressed the recent controversy surrounding his comments on filmmaker Sandeep Reddy Vanga's latest movie, Animal, starring Ranbir Kapoor.On the work front, Javed is currently working on the lyrics for the film Lahore 1947, while Sandeep is gearing up to start shooting for Spirit and Animal Park.Speaking to Mojo Story, Javed emphasised Sandeep's right to make any film he chooses but expressed his worry about the impact such films might have on viewers."},"‘I love dressing her up’: Priyanka Chopra calls her daughter Malti Marie her ‘fashion muse’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/15/418554-horizons-3.png?imwidth=400","link":"https://www.wionews.com/entertainment/i-love-dressing-her-up-priyanka-chopra-calls-her-daughter-malti-marie-her-fashion-muse-700832","content":"She continues to update her fans with the fun activities of Malti, and during her recent interview, the global star talked about how much she loves dressing up her daughter.The Citadel actress has arrived in the country for a luxury brand event and during her recent interview with Vogue India, the actress  affectionately talked about her daughter, whom she called her current ‘fashion muse’.The Padmavat actress landed in her homeland earlier this week with her daughter, Malti.Priyanka and Nick, who got married in 2018 in Rajasthan, welcomed daughter Malti in 2022.Chopra and her endearing moments with her daughter Malti have always been one of the most discussed topics on the internet."},"Sydney Sweeney stuns in sculpted top and black trousers at Immaculate premiere: See pics":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418913-untitled-design-19.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-sydney-sweeney-stuns-in-sculpted-top-and-black-trousers-at-immaculate-premiere-see-pics-700829","content":"” She also revealed during her appearance on The Tonight Show Starring Jimmy Fallon that she cast the two in the film, adding, “They were, like, little old nuns in there.She even cast them in the film as little old nuns, adding a personal touch to the project.The 26-year-old actress donned an avant-garde top paired with high-waisted black wide-leg trousers, showcasing a unique and artistic look.\"Regarding her film Immaculate, Sweeney shared that she flew her grandmothers to Italy for the shoot, fulfilling their dreams of visiting Europe.Her top, resembling a sculptural bouquet, featured bright white hands-like elements wrapping around her torso with peek-a-boo effects."},"Bollywood singer Anuradha Paudwal joins BJP. Will she contest Lok Sabha elections?":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418854-anuradha-paudwal.png?imwidth=400","link":"https://www.wionews.com/india-news/bollywood-singer-anuradha-paudwal-joins-bjp-will-she-contest-in-lok-sabha-elections-700745","content":"The announcement of her joining the party came during a press conference where senior BJP leaders were present to welcome the singer into the party fold.It is my good fortune that I am joining BJP today,\" the singer reportedly said after she joined the saffron party.Renowned Bollywood singer Anuradha Paudwal, who has also lent her voice to many devotional albums besides film songs and has garnered widespread acclaim for her melodious singing, joined the Bharatiya Janata Party (BJP) on Saturday (Mar 16).She has also collaborated with many leading composers and singers in the Indian music industry and has won several prestigious awards for her contributions to music, including the Padma Shri, one of the highest civilian honours in India.The event took place at the BJP's party's headquarters in the Indian capital of Delhi."},"Celine Dion pens a note on stiff person syndrome awareness day, calls it, ‘one of the hardest experiences’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/02/08/410717-horizons-97.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/celine-dion-pens-a-note-on-stiff-person-syndrome-awareness-day-calls-it-one-of-the-hardest-experiences-700768","content":"Legendary singer Celine Dion is suffering from a rare neurological disorder, the stiff person syndrome.After her stiff person syndrome diagnosis, Celine has taken a break from her career.On International Stiff Person Syndrome (SPS) Awareness Day, Celine penned an encouraging note on her Instagram as she expressed her gratitude to her fans and family for their constant support.The upcoming documentary titled I Am: Celine Dion will show the singer's struggle with the syndrome.However, the singer is currently working on a documentary on herself and her struggle with neurological disorders."},"Pulkit Samrat And Kriti Kharbanda's first photo as husband and wife unveiled!":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418850-untitled-design-18.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/pulkit-samrat-and-kriti-kharbandas-first-photo-as-husband-and-wife-unveiled-700730","content":"A third comment read, \"Happy Married Life @kriti.The stunning pictures from their wedding reveal Kriti in a gorgeous pastel pink lehenga, radiating elegance and grace.Celebrations are in order as Bollywood stars Pulkit Samrat and Kriti Kharbanda exchanged vows in a beautiful wedding ceremony on March 15.\"Pulkit and Kriti have previously worked together in films like Veerey Ki Wedding, Pagalpanti, and Bejoy Nambiar's Taish.Kriti Kharbanda, known for her work in Hindi, Tamil, and Telugu cinema, has appeared in movies like Housefull 4, and 14 Phere."},"Inside Ed Sheeran’s fun night with B-town stars at Farah Khan’s party - see pics":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418847-happy-30th-birthday-2024-03-16t132122449.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-inside-ed-sheerans-fun-night-with-b-town-stars-at-farah-khans-party---see-pics-700722","content":"''Host Farah Khan shared two photos, one from the last night showing her three kids posing with ED.In the caption, Farah shared a backstory, “Last time I had a party for Ed Shereen, the kids were not allowed up on their own terrace, as they were too small for a grown-up party..British singer and songwriter Ed Sheeran is set to take the stage on March 16.Huma Qureshi also shared a few photos from last night.Before the big night, director Farah Khan hosted a grand welcome party for the singer."},"Aerosmith's Steven Tyler granted motion to strike parts of sexual assault lawsuit":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/25/265096-steven-tyler.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/aerosmiths-steven-tyler-granted-motion-to-strike-parts-of-sexual-assault-lawsuit-700725","content":"In a latest development, a Los Angeles court has granted a request by Steven Tyler to strike portions of a sexual assault lawsuit filed against him by a woman who alleges they had sexual relationship when she was a teenager in the 1970s.Misley previously claimed she had a sexual relationship with Tyler when she was a teenager and that he convinced her mother to grant him guardianship over her when she was just 16 years old in order for them to continue the relationship.This ruling comes after a second woman filed a sexual assault lawsuit against Tyler in November, alleging he assaulted her twice in one day when she was a teenager in 1975.Back in April, Tyler opened up about Misley's suit and denied all claims against him, stating that she consented to their sexual relationship.The court ruled in Tyler's favour, agreeing to strike parts of Julia Misley’s complaint that claimed she suffered “intentional infliction of emotional distress” based on Tyler’s publication of his memoirs."},"Charlotte Le Bon joins HBO's The White Lotus season 3 cast":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418842-untitled-design-17.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/charlotte-le-bon-joins-hbos-the-white-lotus-season-3-cast-700709","content":"Charlotte Le Bon has joined the cast of HBO's The White Lotus Season 3, stepping into a role originally slated for Francesca Corney.The new season will follow a new group of guests at another White Lotus property, including a multigenerational gang with a patriarch, a female corporate executive, an actress, a couple of mothers, a country club wife, a misfit, and a yogi.Season 3 of The White Lotus is currently in production in Thailand, with filming locations including Bangkok and the islands of Koh Samui and Phuket.I think the third season will be a satirical and funny look at death and Eastern religion and spirituality,\" the series' creator Mike White said in the aftershow of the season two finale.\"It feels like it could be a rich tapestry to do another round at White Lotus.\""},"RuPaul's Drag Race star Q reveals HIV diagnosis: 'It's so stigmatised'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418831-untitled-design-16.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/rupauls-drag-race-star-q-reveals-hiv-diagnosis-its-so-stigmatised-700693","content":"\"I think it’s so important to have queer people in health care.Q, a 26-year-old drag queen from Kansas City, Missouri who has competed in RuPaul's Drag Race, is bravely opening up about her HIV-positive diagnosis.It’s inspired by the generation of gay people that we lost to the AIDS epidemic in the ’80s.\"To which, drag queen Plane Jane replied, \"Do you hear that gay people?Sharing her emotional journey, Q advocated for hiring more queer people in the healthcare sector."},"Cara Delevingne’s $7 million LA home destroyed in massive fire: 'My heart is broken'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418821-happy-30th-birthday-2024-03-16t114229663.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-cara-delevingne’s-7-million-la-home-destroyed-by-massive-fire-my-heart-is-broken-700669","content":"“Crews confirmed all occupants were out of the home, and then pulled back into defensive mode due to the long duration of heavy fire exposing the structural members,” LAFD told People.Crews confirmed all occupants were out of the home, and then pulled back into defensive mode due to the long duration of heavy fire exposing the structural members.As per the LAFD report, ''Firefighters arrived to find a 6,650 sqft two-story home built in 1971, with heavy fire in the rear, which consumed one room in the rear and developed into a deep-seated attic fire.In an unfortunate incident actress and model Cara Delevingne's home in Studio City, California was destroyed after it caught fire in the early hours of Friday morning.By the time the Los Angeles Fire Department reached the property, the house was already engulfed under the heavy flames."},"Watch | Amitabh Bachchan indirectly dismisses angioplasty reports, calls them ' fake news'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418815-happy-30th-birthday-2024-03-16t103334505.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-watch--amitabh-bachchan-indirectly-dismisses-angioplasty-reports-calls-it-fake-news-700655","content":"All fine?Amitabh Bachchan is well and fine!"},"Beyoncé makes her mark on country music, shining light on genre's Black roots":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/02/12/411514-horizons-18.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/beyonce-makes-her-mark-on-country-music-shining-light-on-genres-black-roots-700635","content":"\"But it was more than the exhilarating, catchy thrum of the banjo at the start of the song that caught Denitia’s attention: It was an overdue acknowledgement of the rich history of Black country music artists and their legacies.\"\"Excitement has swirled around the project, and \"Texas Hold ‘Em,\" has soared multiple music charts, cementing Beyoncé as the first Black woman to top the Billboard Country Chart.Beyoncé's success in country music is shining a light on a history of Black folks in country music, in our creation, our contribution to the genre, in our being listeners and avid audience members of country music,\" said Denitia, who now lives in Nashville and was named one of CMT’s next country artists to watch earlier this year.Royster noted that the banjo featured on the song has become a signature instrument, sound and tradition of country music, but added it was originally invented by and grounded in the music of enslaved Black people.Experts and fans view Beyoncé's foray into the genre as a reclamation and homage to the legacy of Black Americans within country music and culture – a history that has largely gone unrecognized in some mainstream music circles."},"Fake news: Amitabh Bachchan on reports of his ill health":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/16/418782-untitled-design-2.png?imwidth=400","link":"https://www.wionews.com/entertainment/fake-news-amitabh-bachchan-on-reports-of-his-ill-health-700612","content":"Social media platforms were flooded earlier in the day with worried fans enquiring about Bachchan's health after several reports claimed the megastar had undergone an angioplasty procedure for either a clot in his leg or a blocked artery.com/CuwHiSBd3MIn a video, circulating on social media, Bachchan is seen exiting the stadium when someone from the crowd asks him about his health.Others said he was hospitalised for an angioplasty -- a balloon procedure to open up blocked arteries and blood vessels -- to remove a blockage in his leg.Megastar Amitabh Bachchan on Friday dismissed reports of ill health as \"fake news\", putting an end to rumours about his hospitalisation.In the evening, Amitabh Bachchan and son Abhishek were photographed at the Dadoji Kondadev Stadium in Thane attending the final match of the Indian Street Premier League (ISPL) between Majhi Mumbai vs Tiigers of Kolkata, hours after reports of his hospital visit surfaced."}}