{"Britney Spears' ex Sam Asghari shares a shirtless photo amid singer's hotel drama":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/09/13/210956-untitled-design-30.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/britney-spears-ex-sam-asghari-shares-a-shirtless-photo-amid-singers-hotel-drama-717817","content":"As singer Britney Spears hit headlines on Thursday morning for appearing in a disheveled condition outside a plush hotel in Hollywood hotel, her ex-husband Sam Asghari shared a 'life update.Britney Spears ex Sam Asghari drops life update amid hotel drama\n\nAmid all the drama around Spears, her ex-husband shared a post on Instagram.The infamous ex of the singer dropped a shirtless picture, captioning it as a 'life update'.The singer was spotted outside Chateau Marmont hotel and was reportedly involved in a heated argument with her boyfriend, Paul Richard Soliz, which turned physical late night on Wednesday.Sam Asghari is all smiles in the new photo uploaded on his social media."},"Beyonce's name to be included in French dictionary":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/06/15/359595-beyonce.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/beyonces-name-to-be-included-in-french-dictionary-717805","content":"The inclusion in the Larousse dictionary is significant as it is known for its encyclopedic coverage of language and culture.According to reports, the 42-year-old singer is one of forty people to be included in the Larousse dictionary.Beyoncé's inclusion in the revered Larousse dictionary is a testament to her Louisiana Creole heritage.The singer has earned a coveted spot in the latest edition of a French dictionary.Two decades ago the Oxford English Dictionary added a term connected to singer- Bootylicious."},"The Fall Guy review: Ryan Gosling and Emily Blunt's film is fun but chaotic":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/14/418466-happy-30th-birthday-2024-03-14t173436040.png?imwidth=400","link":"https://www.wionews.com/entertainment/the-fall-guy-review-ryan-gosling-and-emily-blunts-film-is-fun-but-chaotic-717798","content":"Gosling and Blunt- stars of last year's biggest films Barbie and Oppenheimer respectively- play Colt and Jody - former lovers who meet once again on the sets of a new movie.It's chaotic, fun and incoherent but Ryan Gosling and Emily Blunt's impeccable comic timing, good looks, and performances make The Fall Guy watchable.Colt has returned from retirement to be a stunt double of the leading man who has been his long associate in previous films.The catch is that the leading man, Tom Ryder is missing and the producer of the film Gail Meyer (Hannah Waddingham), a long-time friend and ally, insists on Colt to find him in order to save the film which is his ex-girlfriend Jody's debut film as director.Director David Leitch, who was a former stunt double to actors like Brad Pitt and Jean-Claude Van Damme, pays an elaborate homage to the stuntmen and women of Hollywood in The Fall Guy."},"Why Ryan Gosling doesn’t play dark roles anymore? Actor reveals":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/24/427057-horizons-2024-04-24t110749670.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/why-ryan-gosling-doesnt-play-dark-roles-anymore-actor-reveals-717719","content":"I thought, they were already making little movies about their Barbies on the iPad when it happened, so the fact that I was going off to work to make one too, we just felt like we were aligned.Ryan shared that his 2016 Oscar-nominated movie La La Land, was the first movie that he signed by keeping his family in mind.After cementing his place in the world of entertainment, Ryan is now a little careful with the kind of roles he opts to play.\"I’m trying to just figure out who they are and be there for them in the way that I can,\" he expressed.Elaborating on picking a project with a different perspective, he explained, “It was just sort of like, ‘Oh, this will be fun for them, too, because even though they’re not coming to set, we’re practicing piano every day or we’re dancing or we’re singing."},"Anushka Sharma's birthday dinner with Virat and friends was all about good food and joy":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429090-happy-30th-birthday-2024-05-03t150705456.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-anushka-sharmas-birthday-dinner-with-virat-and-friends-was-all-about-good-food-and-joy-717692","content":"Chandra shared a picture on his Instagram handle, and wrote, ''Shiny happy people + good food = joy\nSuch a lovely evening this was, made better for this lots of absolute love for the pursuit of great nosh.Cricketer Faf du Plessis shared a picture from the night, that showed all of them posing for the picture.After receiving heartwarming wishes all day, Sharma celebrated her birthday with husband-cricketer Virat Kohli and their friends.\"On Anushka's 36th birthday, Virat shared a heartwarming wish for his wife.Happy birthday my love."},"Lionel Richie reveals King Charles is 'doing fantastic' amid cancer treatment":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429082-1102515.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-lionel-richie-reveals-king-charles-is-doing-fantastic-amid-cancer-treatment-717679","content":"”Lionel Richie is certain that once the inaugural event is over, he'll receive a phone call from King Charles who will want to know all about how the evening went.While attending the inaugural King’s Trust Global Gala in New York, Lionel Richie said that the English monarch is doing fine.’”King Charles recently made his first public outing amid his cancer treatment.Lionel Richie has some brand new information on the health status of King Charles amid his cancer treatment.Buckingham Palace has a few events lined up for King Charles as the monarch plans to return to his official duties slowly."},"Kevin Spacey slams new documentary on alleged abuse: I won't sit back and be attacked":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/11/29/314274-kevin-spacey.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-kevin-spacey-slams-new-documentary-on-alleged-abuse-i-wont-sit-back-and-be-attacked-717673","content":"”While Kevin has been given access to the documentary prior to its airing, Kevin recently took to X and accused the broadcasting partner of not giving him enough time to “respond to allegations\" made against him \"dating back 48 years\".Kevin Spacey is not happy with a new documentary that has detailed the alleged abuse that he has been accused of over the past few years.He also said that he would “not sit back and be attacked by a dying network’s one-side ‘documentary’ about me in their desperate attempt for ratings,” adding that “each time I have been given the time and a proper forum to defend myself, the allegations have failed under scrutiny and I have been exonerated.Due to air next week, Kevin Spacey fired at the makers of the upcoming documentary titled Spacey Unmasked.The documentary will premiere on May 6 and 7 and is described as featuring “never-seen-before interviews and archive” to examine the actor’s life “from childhood to early success on Broadway and subsequent meteoric rise to stardom."},"Did Tarak Mehta actor Gurucharan Singh plan his own disappearance? New report claims so":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/27/427798-untitled-design-2024-04-27t145053669.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/did-tarak-mehta-actor-gurucharan-singh-plan-his-own-disappearance-new-report-claims-717655","content":"Sharing more updates regarding Gurucharan's disappearance, the police source said that the actor had left his phone, due to which it's difficult to trace him.As per Indian news channel New18, a police source has said that the actor left his phone in Delhi's Palam area and ''moved out of'' the city.We are trying to find but it only makes it more difficult for us to trace Gurucharan Singh, because this means that the phone is not with the actor,\" Delhi police sources said, as per News18.”Gurucharan Singh went missing on April 22 when he left his Delhi home to catch a flight to Mumbai.Reacting to his mysterious disappearance, the producer of the show, Asit Modi went on to claim that all dues were cleared when he left the show in 2020."},"'It's not something to be ashamed of': Halle Berry confronts stigma around menopause":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/26/420853-halle-berry-lead-d643c107d3794ad890de9fb4975174cf.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/its-not-something-to-be-ashamed-of-halle-berry-confronts-stigma-around-menopause-717630","content":"Berry, the first woman of colour and still the only Black woman to win a best actress Oscar, has been vocal about her own experiences with menopause and said the issue needed to be \"destigmatized.Academy Award-winning actress Halle Berry joined a group of US senators on Thursday to announce new legislation that would provide tens of millions of dollars towards menopause research and education.\"The actress -- whose films include the \"X-Men\" series, the 2002 James Bond movie \"Die Another Day\" and the mercilessly mocked \"Catwoman\" (2004) -- told reporters her doctor refused to use the word \"menopause\" in front of her.The bill, Advancing Menopause Care and Mid-Life Women's Health Act, is sponsored by senators from both parties and would divert $275 million to research, raising awareness and training health care professionals to deal with the hormone shift that women go through, mainly in middle age.\"Menopause is not a bad word."},"Were Neanderthals spiritual and religious? Netflix documentary has some answers":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429047-secrets-of-the-neanderthals.png?imwidth=400","link":"https://www.wionews.com/science/were-neanderthals-spiritual-and-religious-netflix-documentary-secrets-of-the-neanderthals-explores-717631","content":"The documentary later moves to Zagreb, Croatia, where archaeologists found only fragments of Neanderthal skeletons and not whole bodies.At Shanidar, archaeologists recently found remains of another Neanderthal, leading them to wonder if the cave was being used as a burial ground by the species.The documentary moves to the Mediterranean, specifically Gibraltar, where a row of caves exists that was inhabited by the Neanderthals till as recently as 40,000 years ago.It seems strange to think that a species that lived for so many years suddenly vanished.They are our long-lost ancestors who were wiped out from the face of Earth thousands of years ago."},"Britney Spears hotel drama: Singer blames mother for 'setting her up'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429035-screenshot-wwwgooglecom-20240503-115208.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-britney-spears-hotel-drama-singer-blames-mother-for-setting-her-up-717620","content":"In a post, she wrote about not talking to her mother for 6 months and her suddenly reaching out to her after this hotel drama episode.The hotel drama started an online thread on the status of her mental health and if she was back to the old days of partying, drug abuse and mental health breakdowns when she would indulge in the most bizarre things.It was a wild night for Britney Spears as the singer looked disoriented and visibly shaken, leaving the premises of a posh hotel in Los Angeles in what is reported to be an ugly fight between her and her boyfriend.She then also posted on Instagram blaming her mother for escalating all that drama.As per Britney, however, her mother escalated it, and there wasn’t much drama about what was being reported."},"When Drew Barrymore left her past lovers' list at a famous actor's house":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429022-drewbarrymore-b783a585eb3844c78bf85c5eb556fb51.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-when-drew-barrymore-left-her-past-lovers-list-at-a-famous-actors-house-717596","content":"Drew Barrymore used to keep a “sex list” and there was a time when the actress accidentally left it at a famous actor’s house.Wondering if he had ever found out the list, Drew told the actor when he was a guest on her talk show.On the show, Drew said, \"I made a list.He came on the show and I was like, 'I left my sex list at your house.Drew opened up about the embarrassing episode as the actress and daytime TV host was joined by Ross Matthews and the men of CBS Mornings – Tony Dokoupil, Nate Burleson and Vladimir Duthiers on the recent episode of The Drew Barrymore Show."},"Meryl Streep to receive Honorary Palme d’Or at Cannes Film Festival":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429033-47-facts-about-meryl-streep-1689051704.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-meryl-streep-to-receive-honorary-palme-d’or-at-cannes-film-festival-717568","content":"It’s going to be a big night for Meryl Streep at the Cannes Film Festival.”Cannes Film Festival president Iris Knobloch and general delegate Thierry Frémaux said, “We all have something in us of Meryl Streep!This will be the 77th edition of Cannes Film festival which will run from May 14-25.On the opening night of the film festival, the multiple Oscar-winner will receive the honorary Palme d’Or.The last time she appeared at the Cannes red carpet was for red Schepisi’s Evil Angels a Cry in the Dark for which she won best actress in 1989."},"Britney Spears walks out of posh hotel barefoot after heated fight with boyfriend, then says...":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/03/429030-horizons-2.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-britney-spears-walks-out-of-posh-hotel-barefoot-after-heated-fight-with-boyfriend-717552","content":"She reportedly had a showdown in a hotel with her boyfriend that left fans wondering if the wild days are back in the American pop star’s life.com/YcmNFVGWbPAfter the argument, Britney Spears left their hotel room in a dishevelled state and an ambulance was called to the scene.Britney left the hotel barefoot, with her hair all over the place as she held onto a pillow.After the whole fiasco, Britney took to her Instagram to call all the hotel drama “fake news”.She wrote, \"Just to let people know … the news is fake !!!"},"Gippy Grewal praises Chamkila's singing, recalls watching his live performance":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428932-happy-30th-birthday-2024-05-02t213428186.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-gippy-grewal-praises-chamkilas-singing-recalls-watching-his-live-performance-717482","content":"Talking further, the singer recalled attending Chamkila's live performance as he said that the singer introduced Swaran Sivia to the audience as he sang his first devotional song ''Baba Tera Nankana'' even before he recorded it.Starring Diljit Dosanjh and Parineet Chopra, the biographical drama is based on the life of a famous Punjabi singer who was known as the 'Elvis of Punjab'.The movie has brought the life of the singer to the limelight again.Amid this, singer Gippy Grewal has shared the time when he attended Chamkila's life performance.The Netflix movie tells the story of Chamkila, one of the most famous Punjabi singers of all time."},"Chris Hemsworth says rumours around his retirement due to Alzheimer's were upsetting":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/06/15/359593-horizons-2023-06-15t085055913.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-chris-hemsworth-says-rumours-around-his-retirement-due-to-alzheimers-were-upsetting-717459","content":"People put the two things together and soon news started floating that actor was retiring or that he had already developed the disease.The actor learned in 2022 that he has a high genetic predisposition to Alzheimer's, and shortly after the news was made public, he took a break from acting.The actor also revealed that his grandfather suffered from the disease.’\"\n\nDiscovering genetic predisposition to Alzheimer's \n\nChris recalls he originally discovered the higher likelihood of him developing Alzheimer's on his Disney+ series, Limitless- a show that talked about health and longevity.He then joked, \"I did read a really funny comment at the bottom of one article: ‘I hope Chris forgets he’s retiring and comes back."},"Release date out! Jitendra Kumar's Panchayat Season 3 to premiere in May":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428910-happy-30th-birthday-2024-05-02t190258092.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-release-date-out-jitendra-kumars-panchayat-season-3-to-premiere-in-may-717455","content":"Season 1 shows Abhishek's struggle as he tries to adjust to his new life and do his mundane job.Directed by Deepak Kumar Mishra, the new season will take us back to the world of Phulera.Starring Jitendra Kumar, the anticipated new season will be released on May 28 on Amazon Prime.Season 2 gets more heartwarming, as we see Abhishek battle new and hilarious obstacles in Phulera as his bond with villagers like Vikas and Pradhan ji gets stronger and deeper.🤍''Set in a remote Indian village, the show follows the life of an engineering graduate Abhishek, who has settled with a low-paying government job and has moved to a village Phulera."},"Harry Potter star Tom Felton joins the cast of Hansal Mehta's web series Gandhi":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428907-your-paragraph-text-2024-05-02t185556250.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/harry-potter-star-tom-felton-joins-the-cast-of-hansal-mehtas-web-series-gandhi-717435","content":"#Gandhi #GandhiFilmingNow\n\nCast - Tom Felton, Libby Mai, Molly Wright, Ralph Adeniyi, James Murray, Lindon Alexander, Jonno Davies, Simon Lennon@applausesocial @nairsameer @mehtahansal… pic.com/77d1c0NHulApart from Tom Felton, Libby Mai, Molly Wright, Ralph Adeniyi, James Murray, Lindon Alexander, Jonno Davies, Simon Lennon will be seen in the show.The show has Pratik Gandhi collaborating with Hansal Mehta once again after their popular web series Scam 1992 which made the actor an overnight star.The new series also stars Pratik Gandhi's wife, actress Bhamini Oza as Kasturba Gandhi.The show is based on Ramachandra Guha’s books Gandhi Before India and Gandhi – The Years that Changed the World."},"Baahubali animation series Crown of Blood trailer out, to release on Disney+ Hotstar":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428870-baahubali-crown-of-blood-poster.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/baahubali-animation-film-crown-of-blood-trailer-out-to-release-on-disney-hotstar-717389","content":"SS Rajamouli is bringing his Baahubali film to life again with a new animation series titled Baahubali: Crown of Blood.Meanwhile, the new series will take place before the timeline of the events of the film.Based on the hugely successful Baahubali film franchise, the show will release on Disney+Hotstar.At the event of trailer premiere, SS Rajamouli said, “The world of Baahubali is vast, and the film franchise was the perfect introduction to the same.”He added, “We are extremely happy to introduce this new chapter to Baahu’s fans and to bring this story in an animated format, which brings a new, exciting look to the world of Baahubali."}}