{"My Hero Academia Season 7 Episode 2: Exact release date and time, where to watch":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/07/423548-my-hero-academia-season-7.png?imwidth=400","link":"https://www.wionews.com/entertainment/my-hero-academia-season-7-episode-2-exact-release-date-and-time-where-to-watch-719492","content":"The first episode of the seventh season introduces viewers to Star and Stripe, the well-known superhero from America.According to official sources, the next My Hero Academia episode will be out on Saturday, May 11, 2024, at 5:30 pm JST.Here's all you need to know about My Hero Academia Episode 2.My Hero Academia is back on screen with its seventh season and the premiere was nothing less than amazing.The first episode of Season 7, \"In the Nick of Time!"},"Alia Bhatt becomes the ‘most visible attendee’ at Met Gala 2024; beats Kendall Jenner, Kim Kardashian":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429723-untitled-design-2024-05-07t055631738.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-alia-bhatt-becomes-the-most-visible-attendee-at-met-gala-2024-beats-kendall-jenner-kim-kadashian-719472","content":"The most influential of them all\n\nAs per a report on the influencer marketing platform Lefty, Alia and Sabyasachi topped the list of brands and most visible star at Met this year and beat the biggest celebrities, influencers and brands when it came to visibility.In her second outing at the prestigious fashion gala, Alia grabbed attention with her elegant saree which extended into a 30-foot-trail.Bhatt revealed that her couture saree was crafted by 163 artisans and paid homage to the official dress code for the 2024 Met Gala – The Garden of Time.This was Alia's second appearance at the Met Gala after making a debut last year.Bollywood's favourite girl made heads turn on Monday evening as she walked the red carpet at the Met Gala 2024."},"Kangana Ranaut slams Sam Pitroda for his remark: ‘He looks more like a birdie than human’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/26/420900-new-wion-2024-03-26t120809215.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/kangana-ranaut-comments-on-sam-pitrodas-remarks-he-looks-more-like-a-birdie-than-human-719463","content":"Kangana's remarks on Pitroda's comments\n\nKangana took to Instagram Stories to respond to the controversy and wrote: “Congress Uncle Sam said south Indians look like Africans, East/northeast Indians look like Chinese, people from Gujarat belt look like Arabs and people from up north look like white people, I wonder which part of India Uncle Sam belongs to because he looks more like a birdie than human.Where people in the east look like the Chinese, people in the west look like the Arabs, people in the north look like, maybe, white and people in the south look like Africans.Pitroda comment that east Indians resembled the Chinese, while those from the South looked like Africans had raised a storm.People from Gujarat and Maharashtra look perfectly Indians so do up north people, just because your Raja babu is Italian doesn't mean everyone's genes are mixed.Modi asked, “Will the ability of people be decided in my country on the basis of skin colour."},"Astroworld Festival case: Nine out of ten lawsuits filed have been settled ":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/11/06/220233-festival.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/astroworld-festival-case-nine-out-of-ten-lawsuits-filed-have-been-settled-719450","content":"Nine out of the 10 wrongful death lawsuits filed after the deadly crowd surge at the 2021 Astroworld Festival have been settled, an attorney has revealed including one that was set to go to trial this week.Jury selection had been set to begin Tuesday in the wrongful death lawsuit filed by the family of Madison Dubiski, a 23-year-old Houston resident who was one of 10 people killed during the crowd crush at the concert that featured rap superstar Travis Scott.But Neal Manne, an attorney for Live Nation, the festival’s promoter and one of those being sued, said during a court hearing Wednesday that only one wrongful death lawsuit remained pending with the rest nine all being settled, including the one filed by Dubiski’s family.More than 20 defendants, including Scott, Apple and Live Nation, the festival’s promoter, had been set to go on trial Tuesday.Attorneys in the litigation were set to meet next week to discuss when the lawsuit filed by Blount’s family could be set for trial."},"Shekhar Suman is ready to campaign for Kangana Ranaut: This is my duty":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/08/430180-your-paragraph-text-92.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/shekhar-suman-is-ready-to-campaign-for-kangana-ranaut-this-is-my-duty-719418","content":"A few years after they broke up, both Adhyayan and Shekhar levelled allegations that Kangana did black magic on her ex-boyfriend.” \n\n“Shekhar Suman in an interview had said Kangana Ranaut abused and did black magic on his son.This new BJP leader Shekhar Suman had accused senior BJP leader Kangana Ranaut of performing black magic against his son, using menstrual blood.Keeping that in mind, several X users pointed at the old incident and expressed shock over the two being part of the same party.Earlier this week, Suman joined the Bharatiya Janata Party, weeks after his son Adhyayan Suman's ex-girlfriend Ranaut joined the party."},"Filmmaker Sangeeth Sivan passes away at 61":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/08/430176-your-paragraph-text-91.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-filmmaker-sangeeth-sivan-passes-away-at-61-719410","content":"Om Shanti my friend, may your family get the strength to overcome your loss\"\n\n Shocked to hear about the passing away of my dear friend @sangeethsivan , can’t believe that you are no longer amongst us, but you will always be with us in our hearts and memories .com/kvTkFJmEXxVeteran actor Sunny Deol also paid tribute to the late filmmaker and wrote, \"Shocked to hear about the passing away of my dear friend @sangeethsivan can’t believe that you are no longer amongst us, but you will always be with us in our hearts and memories.\"Deeply saddened and shocked to know that Sangeeth Sivan Sir is no more.Ritesh took to X and wrote, “Deeply saddened and shocked to know that Sangeeth Sivan Sir is no more.In his long career, Sivan has helmed films like Vyooham, Daddy, Gandharvam, Yodha and Hindi comedy blockbusters like Kya Kool Hai Hum and Apna Sapna Money Money."},"Gisele Bündchen has been 'deeply disappointed' by Tom Brady's roast":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/10/08/302121-untitled-design-54.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/gisele-bundchen-has-been-deeply-disappointed-by-tom-bradys-roast-719390","content":"The Netflix roast featuring Tom Brady has not gone down well with his children and ex-wife Gisele Bündchen.On Sunday, every aspect of Tom's life was dissected in 'GROAT The Greatest Roast Of All Time: Tom Brady.Bridget Moynahan, with whom Brady shares his son Jack, 16, was also brought up during the roast.Tom Brady had famously split from Bridget Moynahan while she was pregnant, only to start dating Gisele Bündchen soon after.'\n\nDuring the roast, no subject seemed to be off limits, including his relationship with his ex-wife Gisele and the kids."},"Drake and Kendrick Lamar feud: Everything to know about the recent rap beef":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/08/430152-horizons-14.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-drake-and-kendrick-lamar-feud-everything-to-know-about-the-recent-rap-beef-719379","content":"It escalated when J Cole reignited the beef when he rapped about Drake and Lamar and called them the “big three” and added, that he now feels like “Muhammad Ali”.Rapping about Lamar, Drake said, “You ain’t in no Big Three, SZA got you wiped down, Travis got you wiped down, Savage got you wiped down.This can easily be called the biggest rap feud in recent history as Drake and Kendrick Lamar are all guns blazing against each other – to the point that a security guard was shot outside Drake’s Toronto house.In his own verse, Drake accused Lamar of delaying his response track because of the imminent release of Taylor Swift’s “The Tortured Poets Department.On May 5, Drake dropped “The Heart Part 6” where he asked Lamar to prove the allegations and said he’s happy this feud could make him rap."},"Marvel will no longer release more than 3 films and 2 shows in a year":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/05/28/142235-untitled-design-2020-05-28t153623927.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-marvel-will-no-longer-release-more-than-3-films-and-2-shows-in-a-year-719340","content":"Bob Iger said, “We’re slowly going to decrease volume and go to probably about two TV series a year instead of what had become four and reduce our film output from maybe four a year to two, or a maximum of three.We will no longer get bombarded with more than three films a year from the Marvel camp as Disney CEO Bob Iger confirms that the MCU is cutting down on yearly deliverables.”Bob also added that there was a lot to look forward to this year and next as he said that there are “a couple of good films in ’25 and then we’re heading to more ‘Avengers,’ which we’re extremely excited about,” adding: “Overall, I feel great about the slate.Bob also added that the upcoming slate will have a mix of sequels and originals, noting that the focus is currently more on franchise films: “We’re gonna balance sequels with originals.As for the current year, there is only one Marvel film, Deadpool & Wolverine."},"Kim Kardashian calls breathing an 'art form' as she slips into her 2024 Met Gala outfit. Watch BTS video":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/08/430100-your-paragraph-text-90.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-kim-kardashian-calls-breathing-an-art-form-as-she-slips-into-her-2024-met-gala-outfit-watch-bts-video-719296","content":"Many online wondered how the SKIMS founder was breathing through the outfit.The outfit also comprised a silver brocade skirt.Kim could be seen breathing through her mouth while being sucked into the silver metallic corset.A BTS video has been shared online that shows her fitting for the outfit.Over the years, the reality TV star has always managed to be a topic of discussion due to her outfit choices at the gala."},"Game of Thrones' Kevan Lannister, actor Ian Gelder, dead at 74":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/08/430066-rgtnxbp9lpdb1.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-game-of-thrones-kevan-lannister-actor-ian-gelder-dead-at-74-719235","content":"The actor most famously known for his role in HBO’s hit series Game of Thrones, as Kevan Lannister, died of complications from bile duct cancer.”The post further read, “Ian was diagnosed with bile duct cancer in December and yesterday he passed at 13.British actor Ian Gelder is no more.”His partner went on to say that Ian was a “wonderful actor and everyone who worked with him was touched by his heart and light.Talking about Ian's fight with cancer, Daniels said that he coped with it with “such bravery and no self-pity”."},"The real truth behind Phool from Laapata Ladies' viral Met Gala debut after Alia Bhatt":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/08/430059-horizons-10.png?imwidth=400","link":"https://www.wionews.com/entertainment/the-real-truth-behind-phool-from-laapata-ladies-met-gala-debut-after-alia-bhatt-719228","content":"AI generated Met Gala images of Rihanna and Katy Perry go viralThe social media handles of Aamir Khan Productions, which backed Laapataa Ladies, shared Nitanshi's photoshopped look from the Met Gala red carpet.At least that’s what we can make out from viral pictures on social media that suggest that the young actress turned up at the Met in a red saree.The post caption read: “Our Phool blossoming in the garden of time (flower emoji) Watch #LaapataaLadies on @NetflixIndia now.com/4JFWU19SzsNitanshi shared the post on her social media handles and wrote in the caption, “Met Gala 2024 (flower emoji).After Rihanna and Katy Perry were made to appear on the red carpet using deepfake technology, India’s Nitanshi Goel, the 17-year-old actress who made her debut in Kiran Rao’s Laapata Ladies, was photoshopped on the red carpet."},"Robert Downey Jr to make Broadway debut with play, McNeal":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/03/29/341877-robert-downey-jr.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-robert-downey-jr-to-make-broadway-debut-with-play-‘mcneal’-719198","content":"Oscar-winning actor Robert Downey Jr now wants to try his hands at other things, as reports suggest that he will soon debut on Broadway this fall with a new play titled McNeal.In McNeal, Robert Downey Jr will play the role of a talented writer who struggles with family issues as he works on his next novel.Robert Downey Jr was last seen in Oscar-winning film Oppenheimer for which he won his first Oscar in the Best Supporting Actor category.In addition to Robert Downey Jr, the rest of the show's cast will be announced later.The play will have sets by Michael Yeargan & Jake Barton, costumes by Jennifer Moeller, lighting by Donald Holder, sound by Justin Ellington & Beth Lake, and projections by Jake Barton."},"Hilary Duff welcomes baby no 4, shares sweet Instagram post announcing her name":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/08/21/207745-pjimage-2021-08-21t105822731.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-hilary-duff-welcomes-baby-no-4-shares-sweet-instagram-post-announcing-her-name-719171","content":"Love, the Duff-Bair-Comrie Crew,\" the front of the card read, while the back had the words, \"Buckle up Buttercups, we're adding one more to this crazy bunch!”It was in December 2023 that Hilary Duff revealed that she and Matthew were extending their family and were expecting a baby soon.It’s baby no 4 for Hilary Duff!\" Hilary Duff added, \"I have been dreaming of holding you in my arms for months and the past 5 days of getting to know you, stare at you and smell you has been pure moments of magic.\"The duo co-parent Hilary Duff’s eldest, Luca Cruz, 11, with her ex-husband, Mike Comrie."},"Drake’s security guard shot outside rapper’s Toronto mansion":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/02/07/410539-horizons-14.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/drakes-security-guard-shot-outside-rappers-toronto-mansion-719077","content":"The guard, 48 was “standing outside the gates of the home,” as per Toronto Police.In the track, Lamar indirectly called out Drake and J Cole's 2023 song ''First Person Shooter'', in which the two artists called themselves, along with Lamar, the “big three” of hip-hop.As per the Toronto Sun, the guard was shot around 2:10 am (local time) outside his Bridle Path mansion early Tuesday.Canadian rapper Drake's security guard was shot outside the rapper's Toronto mansion.\"I cannot confirm if Drake was home at the time the incident occurred, but I can tell you that we are in contact with his team and they are cooperating,\" Inspector Paul Krawczyk told reporters."},"Rita Ora’s nude Met Gala dress reminds netizens of Kanye West’s wife Bianca Censori":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429960-happy-30th-birthday-2024-05-07t213815599.png?imwidth=400","link":"https://www.wionews.com/entertainment/rita-oras-nude-met-gala-dress-reminds-netizens-of-kanye-wests-wife-bianca-censori-719069","content":"One user wrote, ''The dress may well have a story but the look is giving me Kanye's wife vibes.The caption reads, ''After walking the iconic white and green carpet, Ora shared a set of pictures on her Instagram handle with a caption, mentioning that her dress encapsulates the most delicate and powerful manner a real tapestry of human crafts spanning a period of two millennia from Egypt to Rome.The 2024 Met Gala is over, and if we look back at the most revealing or nude outfits, then the one name that takes the first spot is of singer Rita Ora, who surprised all the spectators with her sartorial pick.Both ascended to the event wearing the outfits as per the event's theme Sleeping Beauties: Reawakening Fashion with the dress code, The Garden of Time.In the brief interview with Vogue, Ora revealed that her dress had a very ancient connection, as she said that the beads are, ''older than anyone on this planet."},"King Charles too busy to see son Prince Harry during UK trip":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/05/349783-untitled-design-2023-05-05t193351086.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-king-charles-too-busy-to-see-son-prince-harry-during-uk-trip-719051","content":"Prince Harry will not be seeing his father King Charles during his current visit to Britain as the monarch will be too busy, Harry's spokesperson said on Tuesday.\"In response to the many inquiries and continued speculation on whether or not the duke will meet with his father while in the UK this week, it unfortunately will not be possible due to His Majesty’s full programme,\" the spokesperson said.\"Harry's last publicised trip came in February when he made a flying visit to see his father for a quick reunion after Buckingham Palace revealed that the 75-year-old king had been diagnosed with cancer.The younger son of King Charles has only been back in Britain on a few occasions since he and his American wife Meghan stepped down from their official royal roles in 2020 and moved to Los Angeles where they live with their two young children.After leaving Britain, Harry will be joined by his wife Meghan for a visit to Nigeria."},"Arijit Singh trims his nails while performing at Dubai concert, fans call it ‘unprofessional’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429948-happy-30th-birthday-2024-05-07t201518537.png?imwidth=400","link":"https://www.wionews.com/entertainment/arijit-singh-trims-his-nails-while-performing-at-dubai-concert-fans-call-it-unprofessional-719049","content":"Earlier, the singer garnered love from the netizens, who praised him for his gracious apology after he was unable to recognise Pakitani actress Mahira Khan, who was sitting in the front row.A recent video that has gone viral on the internet shows Singh singing on stage, as he started trimming his nails as he sang along in front of the jam-packed.However, now the ''Tum Hi Ho'' singer has created quite a stir as he started cutting his nails while performing on stage during his recent gig in Dubai.The clip has taken the internet by storm, with netizens slamming the singer for his ''highly unprofessionalism'' and being ''unhygienic.''A few days earlier, Arijit was not able to recognise actress Mahira Khan, while he sang ''Zaalima''."},"Wait, what? Camila Cabello walks carrying a block of Ice at Met Gala 2024":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429932-happy-30th-birthday-2024-05-07t184337862.png?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-wait-what-camila-cabello-walks-carrying-a-block-of-ice-at-met-gala-2024-719022","content":"com/bVlQS5CiODApart from her dress, the one thing in her attire that created an immense buzz was a real ice block, which many at first glance would have thought was a normal clutch.While many of the attire from the event stood out, the one accessory that has crossed all the boundaries of creativity is Camila Cabello's ice purse.With the “Garden of Time” themed event, A-listers participated in the grand extravaganza wearing the best sartorial looks they could.The Senorita showed up at the 2024 MET GALA, famously called fashion's biggest night, wearing a attire, that left many starstruck at the venue, and on social media as well.The block that also had a black rose inside it coincided best with the Metropolitan Museum exhibitions theme."}}