{"Chiranjeevi, Vyjayanthimala honoured with Padma Vibhushan":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/10/430512-your-paragraph-text-94.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/chiranjeevi-vyjayanthimala-honoured-with-padma-vibhushan-719935","content":"Veteran Indian actors Chiranjeevi and Vyjayanthimala were honoured with Padma Vibhushan, the country's second-highest civilian honour, on Thursday, May 9, 2024.The legendary actress looked stunning in a yellow saree as she accepted the second-highest civilian honour with utmost grace.President of India, Droupadi Murmu presented South India's megastar Chiranjeevi with the Padma Vibhushan, the country's second-highest civilian honour, on Thursday, May 9, 2024.The event also saw a rare appearance of veteran Indian actress Vyjayanthimala who was also honoured with a Padma Vibhusha.Legendary actress Vyjanthimala, Former Vice President M Venkiah Naidu, and Telugu superstar K Chiranjeevi were among the recipients of the Padma Vibhushan award for 2024."},"Miss USA 2023's resignation letter details toxic work environment and sexual harassment incident":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/10/430505-untitled-design-2024-05-10t093054795.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-miss-usa-2023s-resignation-letter-details-toxic-work-environment-and-sexual-harassment-incident-719928","content":"Miss USA 2023 Noelia Voigt's official resignation letter highlights the toxic work environment in the organisation and accuses the pageant’s CEO of failing to take an incident of sexual harassment seriously.NBC News has obtained a copy of Voigt's resignation letter, which reads, \"There is a toxic work environment within the Miss USA organization that, at best, is poor management and, at worst, is bullying and harassment.\"\"Every statement you have ever put out about MUO’s morals and integrity directly contradicts what is happening within the USA organisation,\" Voigt concluded in her resignation letter.\"Voigt further accused Miss USA CEO and President Laylah Rose of being \"cold and unnecessarily aggressive\" towards her.Meanwhile, Maui native Savannah Gankiewicz will be crowned 2023 Miss USA in a ceremony next Wednesday, May 15."},"John Malkovich joins Marvel's Fantastic Four cast":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/10/430497-screenshot-wwwgooglecom-20240510-092223.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-john-malkovich-joins-marvels-fantastic-four-cast-719916","content":"John Malkovich is speculated to take up the role of one of the villains from the comics – including the Wizard who leads a supervillain version of the Fantastic Four and the Beyonder who has his own multiverse saga.Marvel’s The Fantastic Four has roped in ace actor John Malkovich for its next feature.John Malkovich joins other actors in the film including Pedro Pascal, Vanessa Kirby, Joseph Quinn and Ebon Moss-Bachrach as Marvel’s First Family along with Julia Garner as Shalla-Bal, a version of the Silver Surfer and Paul Walter Hauser.As for The Fantastic Four, the film is directed by Matt Shakman.Meanwhile, John Malkovich boasts of a prolific filmography like Dangerous Liasons, In the Line of Fire, Being John Malkovich, The Hitchhiker’s Guide to the Galaxy."},"'I am silenced': Netizens notice unusual 'secret message' in Miss USA 2023 Noelia Voigt’s resignation letter":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/10/430496-untitled-design-2024-05-10t090537381.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-i-am-silenced-netizens-notice-unusual-secret-message-in-miss-usa-2023-noelia-voigt’s-resignation-letter-719911","content":"I will always look back on my time as Miss NJ Teen USA fondly, and the experience of representing my state as a first generation, Mexican-Indian American at the national level was fulfilling in itself.The resignations of Miss USA 2023 Noelia Voigt and Miss Teen USA 2023 UmaSofia Srivastava have thrust the pageants' parent organisation into the spotlight, with both young women citing mental health and differences in values as their reasons for stepping down.Meanwhile, eagle-eyed fans of the Miss USA pageant noticed something unusual about Voigt’s resignation statement about her mental health on Instagram.\"After months of grappling with this decision, I have made the choice to resign from the title of Miss Teen USA 2023,\" she wrote.Michelle said she had worked closely with Miss USA Noelia Voigt and had seen \"a decline in her mental health\", which Voigt also mentioned when she resigned on Monday."},"Justin Bieber and wife Hailey are expecting their first child together":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/10/430490-your-paragraph-text-93.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/justin-bieber-and-wife-hailey-are-expecting-their-first-child-together-719902","content":"The news of their expanding family arrives at a time when the couple faced scrutiny over their relationship, with some speculating that they would part ways by the end of the year.Hailey Bieber is 6 months pregnant\n\nAccording to a TMZ report, Hailey is already six months pregnant, and the couple is reportedly overjoyed about their growing family.\"They have wanted this for a long time and can't wait to expand their family and welcome a child into the world,\" the source stated.“Having experienced so much together as a couple, they feel prepared to take this next step in their lives and relationship.”Hailey and Justin are ‘thrilled’ to have a baby\n\n“Hailey and Justin are thrilled to be expecting a baby together,\" a source told ET."},"Taylor Swift fever grips Paris at start of Europe tour":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/07/416816-the-battle-for-kyiv-2024-03-07t164350469.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/taylor-swift-fever-grips-paris-at-start-of-europe-tour-719894","content":"Taylor Swift-fever struck Paris on Thursday as the highest-grossing tour in history finally arrived in Europe, with fans treated to the first-ever performance of songs from her latest album.Emerging in a lyrics-covered dress, she ran through several of the darker new tracks starting with \"But Daddy I Love Him\" and including \"Fortnight\", a particularly furious rendition of \"Who's Afraid of Little Old Me?\"You were the first crowd to see songs from 'The Tortured Poets Department',\" she said, before adding: \"Or, as I like to call it, 'Female Rage: the Musical'\".There were deafening shrieks as images of typewriter sheets indicated that songs off the new album \"The Tortured Poets Department\" were starting late in the show.By the end of the year, it had already become the first to sell more than $1 billion in tickets and is on track to more than double that by the time it concludes in Vancouver this December."},"Shocking! Intruder detained at Drake’s mansion a day after shooting incident":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/10/03/383548-untitled-design-2023-10-03t155341784.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-shocking-intruder-detained-at-drake’s-mansion-a-day-after-shooting-incident-719743","content":"A day after a shocking shooting incident outside Drake's Toronto mansion, an intruder was detained by police.SHOOTING:\nBayview Ave & Lawrence Ave E\n2:09 am\n- reports of a shooting\n- police o/s\n- man transported to hospital with serious injuries\n- suspect fled in a vehicle\n- unknown description#GO978573\n^scKrawczyk said investigators are “dealing with video quality issues.Earlier this week, the shooting outside Drake's home rocked the music world.Police have said it's too early to connect the shooting incident with the rapper's brawl.Police were called after a person was trying to gain access to the premises."},"Prince Harry attends Invictus Games event 2 miles away from the royal family's garden party ":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/03/28/341572-untitled-design-2023-03-28t153928712.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-prince-harry-attends-invictus-games-event-2-miles-away-from-the-royal-familys-garden-party-719733","content":"At Buckingham's first garden party of the season, Charles was joined by Queen Camilla; Anne, Princess Royal; Prince Edward, Duke of Edinburgh; Sophie, Duchess of Edinburgh; Birgitte, Duchess of Gloucester; and Prince Richard, Duke of Gloucester.Meanwhile, Charles and senior royal family members attended a garden party at Buckingham Palace just two miles away.Charles' son Prince William and his wife Kate Middleton did not attend the garden party.Harry celebrated the 10th anniversary of the Invictus Games at an event in London on Wednesday (May 8) but the royal family was not in attendance.The Prince of Wales conducted an investiture ceremony at Windsor earlier on Wednesday while his wife is taking time off from official royal duties while she undergoes cancer treatment."},"Ranveer Singh squashes divorce rumours as he flaunts his wedding ring at an event":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/10/26/389080-your-paragraph-text-2023-10-26t092539466.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-ranveer-singh-squashes-divorce-rumours-as-he-flaunts-his-wedding-ring-at-an-event-719719","content":"“They are really excited to welcome their first child to the world and are cherishing every moment of this phase of their life.While writing on cinema remains her first love, her other interest lies inAll is well in the marital life of Ranveer Singh and Deepika Padukone."},"Shakira tax fraud case: Prosecutors move to dismiss second investigation":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/02/422384-horizons-2024-04-02t124049963.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/shakira-tax-fraud-case-prosecutors-move-to-dismiss-second-investigation-719711","content":"Back then the singer had claimed that her official residence was in the Bahamas during that time — meaning she did not owe the Spanish government those taxes.The Spanish government claimed Shakira had used an offshore company to evade paying tax.Shakira settled a separate tax evasion issue with the Spanish government in November 2023.In what could be termed a big relief to singer Shakira, Spanish prosecutors have recommended to dismiss a second round of investigation into her finances.Prosecutors said the Colombian singer lived in Barcelona for more than half of the time between 2012 and 2014 and racked up a tax bill of $15."},"On Vijay Deverakonda's birthday, makers announce pan-India project featuring the actor":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/01/09/324126-untitled-design-2023-01-09t172406999.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/on-vijay-deverakondas-birthday-makers-announce-pan-india-project-featuring-the-actor-719707","content":"com/EkbKMAqQgqThe makers took to social media platform Instagram and shared an artwork poster along with the caption that read, “In blood, He'll rise, reign & Ignite the Mass Ripples all over!In blood, He'll rise, reign & Ignite the Mass Ripples all over!❤️‍🔥#SVC59 - @TheDeverakonda's\nMass Incarnation 🔥\n\nA @storytellerkola's Film 🎯#HBDTheVijayDeverakonda 💫\n\nProduced by #DilRaju - #Shirish @SVC_official pic.On Thursday morning, the makers shared a riveting poster of the project.As soon as the poster was dropped, fans took to their comments section and expressed their happiness about Vijay's new project."},"Mr And Mrs Mahi poster: We love how great Rajkummar and Janhvi look together":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430359-screenshot-wwwndtvcom-20240509-151900.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-mr-and-mrs-mahi-poster-we-love-how-great-rajkummar-and-janhvi-look-together-719718","content":"Janhvi Kapoor and Rajkummar Rao starrer Mr and Mrs Mahi teased the first official posters from their film together and we must say their chemistry looks crackling.The first poster captures Janhvi and Rajkummar wearing their Indian jerseys and standing close to each other.Sharing the posters, Janhvi wrote, \"Miliye Mr aur Mrs Mahi se, inke liye life is cricket aur cricket is life cricket se badh ke, Mr Mahi only loves his dear wife #MrAndMrsMahi in cinemas on 31st May, 2024.In the second poster, Janhvi and RajKummar are seen screaming with joy and cheering in the stands of the cricket stadium.\"The film is pegged as a sports drama."},"Katherine Schwarzenegger takes an indirect dig at Met Gala 2024: 'When the gala was..'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2019/06/09/97848-untitled-design-15.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/katherine-schwarzenegger-takes-an-indirect-dig-at-met-gala-2024-looks-when-the-gala-was-719690","content":"In her caption of the post, Maria wrote, “It’s the first Monday in May and the Met Gala is underway!On May 6, Katherine's mother Maria Shriver shared her Met Gala 2001 look, recalling the time she attended the charity gala.Held annually on the first Monday of May, the charity gala saw some of the biggest stars walk up the stairs in their best attire.After Maria shared the post, Katherine went on to re-share it on her Instagram story with a message that led many to think that she did not like the looks this year's guests sported.This year, celebrities who attended the gala dressed in their fashion best included, Kim Kardashian, Jennifer Lopez, Zendaya, Alia Bhatt, Kylie Jenner, and Dua Lipa among others."},"Taylor Swift European dates kick off in Paris":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/02/422526-wion-images-2024-04-02t233040732.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-taylor-swift-european-dates-kick-off-in-paris-719659","content":"Swifties in Paris are especially excited to hear songs off her new album, \"The Tortured Poets Society\", being performed for the first time.The highest-grossing tour in history finally arrived in Europe on Thursday as Taylor Swift kicked off her European dates with four nights in Paris.\"But it's my birthday and it's Paris and it's the first night of the tour, and I thought why not?\"  - Record-breaker -Some 42,000 people will see Swift in Paris before she heads on for dates in Sweden, Portugal, Spain, Britain, Ireland, Netherlands, Switzerland, Italy, Germany, Poland and Austria.By the end of the year, it had already become the first to sell more than $1 billion in tickets and is on track to more than double that by the time it concludes in Vancouver this December."},"Cannes 2024: Aishwarya Rai Bachchan and Aditi Rao Hydari all set to walk the red carpet":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430320-your-paragraph-text-2024-05-09t120033402.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/cannes-2024-aishwarya-rai-bachchan-and-aditi-rao-hydari-all-set-to-walk-the-red-carpet-719631","content":"So far, It is unclear whether Sonam Kapoor, another regular at Cannes, will be walking the red carpet this year.Aishwarya Rai Bachchan and Aditi Rao Hydari will return to the Cannes red carpet this year.The two beauties will be walking the red carpet with a bevvy of celebrities, representing a beauty brand that they both are a part of.India at Cannes 2024\n\nAditi made her red carpet debut in 2022, whereas Aishwarya Rai has been a regular fixture on the Cannes red carpet since 2000.Considered one of the biggest film festivals, Cannes this year has a considerable Indian representation."},"Trailer of Payal Kapadia's Cannes film All We Imagine As Light out":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/11/424439-your-paragraph-text-2024-04-11t171938733.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/trailer-of-payal-kapadias-cannes-film-all-we-imagine-as-light-out-719615","content":"All We Imagine As Light is the first Indian film in competition at Cannes since 1994 and is one of only four female-directed features in the lineup this year.The film is Kapadia's debut feature film and has been selected in the competition section of the upcoming 77th Cannes Film Festival, scheduled to take place later this month.The trailer of All We Imagine As Light, the highly anticipated film by Payal Kapadia, is out.While writing on cinema remains her first love, her other interest lies in"},"Lady Gaga's concert film, Chromatica Ball to release on this date after a two-year wait":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430306-horizons-2024-05-09t110300391.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-lady-gagas-concert-film-chromatica-ball-to-release-on-this-date-after-a-two-year-wait-719604","content":"The concert film which was originally announced in 2022 will feature footage from Lady Gaga’s global Chromatica Ball stadium tour.”Lady Gaga took to Instagram to share what fans can expect from her concert film as she wrote, “This film chronicles a time of immense creativity… the fashion, the dance, the music.Lady Gaga’s concert film Chromatica Ball finally has a release date.In the trailer of Chromatica Ball, you can hear Lady Gaga shout, “Put your hands up, come on!I hope you will feel seen when you watch this film."},"Gisele Bündchen urges fans to donate for Brazil floods in an emotional message":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2018/09/11/33429-untitled%25252520design%25252520%25252861%252529-20171122064343.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/gisele-bundchen-urges-fans-to-donate-for-brazil-floods-in-an-emotional-message-719598","content":"Gisele Bündchen is trying to make a difference as her home state of Rio Grande do Sul, Brazil has been ravaged by devastating flooding.The model also said that people near the affected area could help by donating \"mattresses and pillows, all types of bedding, toiletries, cleaning products, all types of clothing for all ages, furniture, appliances, pet food, and general daily living items.The model referred to the flooding as \"the worst tragedy in its history.Bundchen shared an Instagram Reel containing photos and video of the damage in southern Brazil.The supermodel made an emotional plea to her fans on Wednesday, May 8, asking her followers to consider donating to the Luz Alliance Fund, an initiative she created in partnership with the Brazil Foundation to provide humanitarian pandemic relief to families in Brazil."}}