{"In pics: Priyanka Chopra, Nick Jonas and Malti Marie visit Ayodhya Mandir":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/20/419723-screenshot-wwwndtvcom-20240320-163504.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-in-pics-priyanka-chopra-nick-jonas-and-malti-marie-visit-ayodhya-mandir-702261","content":"After a busy night with Prime Video’s multiple films and shows announcement event, global sensation Priyanka Chopra was spotted in Ayodhya at Ram Mandir with her husband Nick Jonas and their daughter Malti Marie.Actor Priyanka Chopra Jonas, husband and singer Nick Jonas and their daughter Maltie Marie Jonas offered prayers at Ram Janmabhoomi Temple in Ayodhya, Uttar Pradesh.Priyanka attended a Bulgari event and then made time for Prime Video Presents event in Mumbai where she showcased her upcoming production venture Women of My Billion.The couple offered their prayers at the beautiful temple with their two-year-old daughter.She was joined by Nick two days later."},"Priyanka Chopra reunites with Karan Johar on stage months after talking about Bollywood camps, nepotism":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/20/419703-your-paragraph-text-17.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-priyanka-chopra-reunites-with-karan-johar-on-stage-months-after-talking-about-bollywood-camps-702222","content":"Last year in March, Priyanka Chopra appeared on Dax Shepherd’s podcast, Armchair Expert and made shocking revelations about politics and camps in the Hindi film industry that drove her out of India and resort to Hollywood.Priyanka Chopra and Karan Johar reunited publicly on Amazon Prime Video event on Tuesday in Mumbai.A year back, however, PC had spoken about how she was compelled to move to the US due to the various camps in Bollywood.Priyanka Chopra's new project\n\nPriyanka was at the Prime Video Presents event on Tuesday to launch her new project- a documentary called Women of My Billion which her production banner Purple Pebble Pictures has produced.The two seems to have put their grievances behind as PC even made an appearance on Koffee With Karan a few seasons back."},"Oscar-winning director Jonathan Glazer finds public support amid backlash from Jewish celebrities":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419396-horizons-98.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-oscar-winning-director-jonathan-glazer-find-public-support-amid-backlash-from-jewish-celebrities-702204","content":"Looks like Jonathan Glazer has found some support from the rest of Hollywood which doesn’t think that his Oscars speech after winning Best International Feature Film for The Zone of Interest was out of place.”After winning Best Film in the International Feature category, Jonathan walked up on the stage and said, “Our film shows where dehumanisation leads at its worst.”Directors Asif Kapadia and Jesse Peretz also expressed support for Jonathan Glazer’s speech.The band Massive Attack also posted on X, “Jonathan Glazer is a filmmaker of the highest integrity, craft & bravery.The filmmaker started this week on a low after nearly 500 Jewish celebrities issued a letter denouncing his Oscars speech as they wrote: “We refute our Jewishness being hijacked for the purpose of drawing a moral equivalence between a Nazi regime that sought to exterminate a race of people and an Israeli nation that seeks to avert its own extermination."},"Paatal Lok 2 to Mirzapur 3: New seasons coming up of these popular shows":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/20/419676-your-paragraph-text-16.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/paatal-lok-2-to-mirzapur-3-new-seasons-coming-up-of-these-popular-shows-702166","content":"Paatal Lok Season 2\n\nHathi Ram is going to be back.Jaideep Ahlawat and Ishwaak Singh will be back to reprise their roles in the second season of Paatal Lok.Tilottama Shome also joins the cast this season."},"Johnny Depp responds to 'Blow' co-star Lola Glaudini's harassment accusations":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/20/419669-horizons-2024-03-20t120146522.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-johnny-depp-responds-to-blow-co-star-lola-glaudinis-harassment-accusations-702192","content":"So I just wanted to make sure we’re cool and everything.’”She continued, “I just looked at him, and I was like, ‘I don’t know what you’re talking about?Johnny Depp has responded to harassment claims by co-star Lola Glaudini with whom he worked on the film Blow.And I have the star who I have idolised, who I am so excited to work with, reamed me in my face.’”Lola Glaudini just stopped herself from crying after the episode on the film set."},"Rust shooting case: Alec Baldwin accused of leaking footage to influence the press and grand jury":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/04/18/346019-alec-baldwin.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-alec-baldwin-accused-of-leaking-rust-footage-to-influence-the-press-and-the-grand-jury-702140","content":"According to court documents, a video was made available to NBC News a night before the grand jury was set to convene.Alec Baldwin has been accused of leaking footage from the shooting of the film Rust to the media in an attempt to receive a favourable outcome in his November grand jury hearing on the death of a cinematographer on set when the gun he was holding went off.\"Counsel for the state is concerned that any recordings of hearings related to the grand jury proceedings will be used to continue to taint the grand jury process by the target and/or his counsel.\"\"The videos were released to the national press on the eve of the grand jury proceeding in an effort to taint the grand jurors and the grand jury process,\" the documents state.In the video, the actor can be heard telling crew members to move out of the path of the gun in the footage."},"Ariana Grande and Dalton Gomez divorce finalised, singer to pay $1.25 million":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/07/19/368093-horizons-2023-07-19t140455732.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-ariana-grande-and-dalton-gomez-divorce-finalised-to-pay-125-million-702134","content":"The two had separated a year ago but their divorce got finalised today with the pop star making a one-time settlement of $1.At the time of the Covid lockdown, Ariana and Dalton stayed together.These terms include a one-time payment of $1,250,000 to Gomez with no future alimony, giving him half of the proceeds of the sale of their Los Angeles home and paying up to $25,000 toward his attorneys’ fees.The two were happy together before both got busy with their own work and started spending more time away from each other.Ariana and Dalton were married for nearly three years."},"Shahid Kapoor plants a 'thank you kiss' on Vijay Deverakonda for doing Arjun Reddy":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/20/419636-your-paragraph-text-15.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-shahid-kapoor-plants-a-thank-you-kiss-to-vijay-deverakonda-for-doing-arjun-reddy-702100","content":"Actors Shahid Kapoor and Vijay Deverakonda shared a sweet moment on stage at the recent Prime Video event in Mumbai on Tuesday (Mar 19).What Shahid said to Vijay\n\nShahid was hosting a segment at the Prime Video Presents event and called Vijay Deverakonda and Mrunal Thakur on stage to announce their upcoming film Family Star.Two of Sandeep Reddy Vanga's most popular characters, Kabir Singh and Arjun Reddy recently met up at an event in Mumbai.Shahid thanked Vijay on stage and candidly mentioned that without Arjun Reddy there would be no Kabir Singh.Sandeep Reddy Vanga directed Vijay in the Telugu film Arjun Reddy."},"Quiet on Set documentary: Disturbing scenes show young Ariana Grande being ‘sexualised’ on Nickelodeon":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419545-untitled-design-42.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/quiet-on-set-disturbing-scenes-show-ariana-grande-being-sexualised-on-nickelodeon-show-701958","content":"Disturbing and unsettling scenes of Ariana Grande being \"sexualised\" on Nickelodeon have resurfaced with the release of the new Investigation Discovery documentary, Quiet On Set: The Dark Side Of Kids TV.\" Another user wrote, \"I’m not even 10 minutes into “Quiet On Set” and I’m already cringing… after the Jamie Lynn Spears & Ariana Grande clips I already know this is gonna be really hard to watch.\"com/rlIUIngfIbTaking to X, a netizen expressed disgust over Ariana's resurfaced videos and wrote, \"Finally watching Quiet On Set and… WOW.I recommend watching HBO ‘All Quiet on the Set.Reports of toxic sets, sexualization, and fear in 'Quiet On Set' docuseries."},"Citadel’s Indian spin-off gets a title; watch Varun Dhawan, Samantha Ruth Prabhu in spy avatars":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419534-untitled-design-41.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/citadels-indian-spin-off-gets-a-title-watch-varun-dhawan-samantha-in-spy-avatar-701940","content":"On Tuesday, Prime Video India released the first poster of the upcoming series, revealing its title as, Citadel: Honey Bunny.In a statement, Prime Video India described Citadel: Honey Bunny as having \"a riveting narrative that fuses the pulse-pounding elements of a gritty spy action thriller with the heartwarming allure of a love story, all set against the vibrant tapestry of the 90s.With the latest announcement of Citadel: Honey Bunny, fans were reassured that the Indian series is not a remake but a spin-off, offering a unique storyline within the Citadel universe.Other than Citadel: Honey Bunny, Varun is currently working on a remake of Atlee's 2016 Tamil film Theri, titled Baby John.Created by the Russo Brothers, Citadel made its debut on Prime Video in April last year, featuring Richard Madden and Priyanka Chopra as elite agents in the spy agency Citadel."},"Extraordinary Attorney Woo's Kang Tae-oh completes military service; shares note for fan":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419526-untitled-design-40.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/extraordinary-attorney-woos-kang-tae-oh-completes-military-service-shares-note-for-fan-701928","content":"Actor Kang Tae-oh, known for his role in Extraordinary Attorney Woo, has completed his military service and was discharged on Tuesday.The actor, who entered the South Korean military in September 2022, expressed gratitude for his time in the service and revealed that he fixed his bad habits and earned only good things.During his military service, Tae-oh participated in significant events, including reading the memorandum at the 2023 memorial service on Hyeonchungil (Memorial Day in South Korea) and serving as an assistant instructor for the Recruit Training Centre.In a note shared with fans, Tae-oh stated, \"I enlisted after receiving great love from everyone after wrapping up 'Extraordinary Attorney Woo'.\" I faced the end of my 20s and the start of my 30s in the military, and it was a meaningful time during which I fixed my bad habits and learned only good things."},"James Burton, John Anderson and Toby Keith join the Country Music Hall of Fame":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419495-untitled-design-39.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/james-burton-john-anderson-and-toby-keith-join-the-country-music-hall-of-fame-701868","content":"James Burton, John Anderson and Toby Keith on Monday became the newest members to join the Country Music Hall of Fame.“Florida native John Anderson helped steer Country Music back to its traditions with his bold honky-tonk style,” said Country Music Hall of Fame and Museum CEO Kyle Young in a statement.The Country Music Association announced the 2024 inductees in Nashville, Tennessee, with Burton, a guitarist who was Elvis Presley’s band leader, entering in the recording/touring musician category.“My heart sank that Tuesday afternoon knowing that we missed the chance to inform Toby while he was still with us, but I have no doubt that he’s smiling down on us, knowing that he’ll always be ‘as good as he once was,’” said Sarah Trahern, CEO of the Country Music Association.For Anderson, the country icon has enjoyed a sweeping discography spanning more than 40 years — with particular breakout fame in the 1970s and 1990s."},"That 'jam jar' story on how Shakira found out about Gerard Piqué's infidelity is not true, after all":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/11/20/394303-untitled-design-2023-11-20t170057182.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/jar-of-jam-not-true-shakira-addresses-rumours-surrounding-split-from-gerard-pique-701816","content":"At the height of the news of Shakira's splitsville saga, there was a 'jam jar' story: that she found out about former partner Gerard Piqué's infidelity after finding an empty jam jar in the kitchen.In a recent interview, Shakira, 47, finally put to rest rumours surrounding the jam jar as a reason for her split from former partner Gerard Piqué, 37.The former couple, who publicly ended their 11-year romance in June 2022, share two sons, Milan, 11, and Sasha, nine.\"For a long time I put my career on hold, to be next to Gerard, so he could play football,\" she told the outlet.In response to inquiries about Piqué's alleged cheating being exposed by a jar of jam, Shakira dismissed the rumour as \"not true,\" providing a straightforward clarification to The Sunday Times."},"Former K-pop star Jung Joon-young leaves prison after completing five-year term for sex crimes":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419483-untitled-design-37.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/former-k-pop-star-jung-joon-young-leaves-prison-after-completing-five-year-term-for-sex-crimes-701844","content":"Former K-pop star Jung Joon-young walked out of prison on Tuesday after serving a five-year sentence for his involvement in a high-profile spycam and rape scandal that shook South Korea.\"The spycam scandal not only led to legal repercussions for Jung and others involved but also highlighted the broader issue of non-consensual filming and distribution of intimate images and videos in South Korea.The scandal has continued to reverberate in South Korea, with international footballer Hwang Ui-jo currently under investigation for allegedly filming sexual encounters without consent.\"Jung, wearing a black hat and mask, left the prison in Mokpo, approximately 350 kilometres (218 miles) south of Seoul, without speaking to the press on Tuesday morning, according to News1 agency.Another K-pop star, Seungri, a former member of the popular boy band BIGBANG, was also implicated in the scandal."},"Sophie Turner seeks to reactivate divorce case with Joe Jonas":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/09/30/382993-untitled-design-2023-09-30t154146712.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/sophie-turner-seeks-to-reactivate-divorce-case-with-joe-jonas-701800","content":"Following a successful mediation in October 2023, Turner and Jonas issued a joint statement affirming their commitment to co-parenting, with plans for their children to split time between homes in the US and the UK.In a joint message shared on Instagram, the couple stated in September 2023, \"After four wonderful years of marriage we have mutually decided to amicably end our marriage.In January, Turner dropped the wrongful retention claims after both stars signed a consent plan approved by a UK judge, leading to the dismissal of the filing \"with prejudice, and without attorneys’ fees, expenses, costs and/or disbursements awarded to either party\".The former couple, who tied the knot in May 2019, initiated divorce proceedings in September 2023, with Jonas filing for dissolution of marriage in Miami after four years together.\"After a productive and successful mediation, we have agreed that the children will spend time equally in loving homes in both the US and the UK."},"Alex Garland's Civil War to release in India on April 12":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419458-mv5bmtyxnzfkodktyzvims00ote2lwfkotitmzuwzdqxzjayyzqxxkeyxkfqcgdeqvroaxjkugfydhljbmdlc3rpb25xb3jrzmxvdwv1.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-alex-garlands-civil-war-to-release-in-india-on-april-12-701796","content":"Speaking on the film, Alex said that he wanted to make journalists the heroes in Civil War because in “every democracy they aren’t a luxury, but a necessity.Blue election year, A24‘s Civil War promises to make you face harsh realities of a world where we have forgotten what living in a democracy feels like.Set in the dystopian future, the film will be depicting the harrowing and senseless realities of war.This gritty, war-torn film boasts an impressive ensemble cast, including Wagner Moura, Cailee Spaeny, Stephen McKinley Henderson, and Jesse Plemons.Alex Garland's upcoming flick Civil War comes at a time when people of the US are active politically considering the elections."},"Here's how Russian media outlets reported 'fake' death of King Charles III":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419456-pic-48.png?imwidth=400","link":"https://www.wionews.com/world/heres-how-russian-media-outlets-reported-fake-death-of-king-charles-701789","content":"\"Finally, Russian state news agency Tass' newsflash came which read, “King Charles III continues to perform his official duties and attend private engagements\" and placed an end to all rumours.It was on Monday afternoon (Mar 18) that the news of British monarch King Charles III's death broke in the Russian media.The news shared carried a photo of King Charles wearing a ceremonial military uniform, and the caption read, “British King Charles III has died\".This disinformation spread by Russian media soon went viral with no one really verifying the details of the news as well as its source.The news soon went viral across Russian internet channels, which included Readovka, a pro-Kremlin Telegram channel that has more than 2."},"Singer R. Kelly seeks appeals court relief from 30-year prison term":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/30/275303-11.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/singer-r-kelly-seeks-appeals-court-relief-from-30-year-prison-term-701787","content":"She said it wasn’t fair that prosecutors charged Kelly, 57, with leading a Racketeer Influenced and Corrupt Organization (RICO) enterprise from 1994 to 2018 compromised of individuals who promoted his music and recruited women and girls to engage in illegal sexual activity and to produce child pornography.Kelly’s lawyer told an appeals court Monday that all kinds of legitimate organizations — even college fraternities — could be deemed racketeering organizations under a law used to convict the R&B superstar at his Brooklyn trial of sexually abusing young fans, including children, for decades.Attorney Kayla Bensing said Kelly’s network of aides and employees were part of the singer’s “system in place that lured young people in to his orbit” before he “took over their lives.Widespread outrage over Kelly’s sexual misconduct didn’t emerge until the #MeToo reckoning, reaching a crescendo after the release of the documentary “Surviving R.Kelly, born Robert Sylvester Kelly, is known for work including the 1996 hit “I Believe I Can Fly” and the cult classic “Trapped in the Closet,” a multipart tale of sexual betrayal and intrigue."},"Movie armorer challenges conviction in fatal shooting of cinematographer by Alec Baldwin":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/19/419454-untitled-design-35.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-movie-armorer-challenges-conviction-in-fatal-shooting-of-cinematographer-by-alec-baldwin-701784","content":"A movie set armourer is challenging her conviction on an involuntary manslaughter charge in the fatal shooting of a cinematographer by Alec Baldwin on the set of the Western film Rust, court records released Monday show.Baldwin was indicted by a grand jury in January and has pleaded not guilty to an involuntary manslaughter charge, with trial set for July.Prosecutors blamed Gutierrez-Reed at a two-week trial for unwittingly bringing live ammunition onto the set of Rust where it was expressly prohibited.Defence attorneys for Rust armourer Hannah Gutierrez-Reed filed a request for a new trial and urged a judge to release the defendant from jail as deliberations proceed.Gutierrez-Reed was convicted by a jury this month in the shooting on the outskirts of Santa Fe, New Mexico, during a rehearsal in October 2021."}}