{"Prince William and Kate Middleton ‘going through hell’ amid her cancer battle, reveals friend":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/13/418099-horizons-2024-03-13t100440699.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-prince-william-and-kate-middleton-going-through-hell-amid-her-cancer-battle-718229","content":"''Arrieta, who loves designing for the couple's three children — Prince George, 10, Princess Charlotte, 9, and Prince Louis, 6 — said, \"Dressing the royals gives me so much pride, I really do care about how they look.\"William and Kate's designer friend Amaia Arrieta, said in an interview with the Telegraph that the couple, are ''going through hell.\"Talking about dressing the royal children, the Spanish-born designer, who works with Maria Teresa Turrion Borrallo, the nanny of three children, said.Dressing the royals gives me so much pride, I really do care about how they look."},"Kareena Kapoor Khan says Singham Again is a ‘male testosterone film’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/01/06/323549-4.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-kareena-kapoor-khan-says-singham-again-is-a-male-testosterone-film-718212","content":"In the movie, the Piku star will play the role of Shakti Shetty.Furthermore, in the upcoming movie, she will play the role of Ajay's wife.In the movie that is loaded with a male-star cast, Kareena has revealed, that both her and Deepika's characters play pivotal roles in the third movie of the Singham franchise.”Directed by Shetty, the film boasts a star-studded cast including Ajay Devgn, who will reprise the role of Bajirao Singham."},"Megalopolis: Teaser, cast, synopsis and everything to know about Francis Ford Coppola’s film":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429410-happy-30th-birthday-2024-05-05t155513970.png?imwidth=400","link":"https://www.wionews.com/entertainment/francis-ford-coppola-megalopolis-adam-driver-stops-time-in-the-first-teaser-of-long-awaited-sci-fi-718192","content":"The City of New Rome must change, causing conflict between Cesar Catilina (Adam Driver), a genius artist who seeks to leap into a utopian, idealistic future, and his opposition, Mayor Franklyn Cicero (Giancarlo Esposito), who remains committed to a regressive status quo, perpetuating greed, special interests, and partisan warfare.Starring prolific actor Adam Driver, the movie is set to premiere at the Cannes Film Festival this year.In the first short clip from the movie, Adam who is an architect is standing on the edge of a high-rise building, as we see him jump-off the building.On Saturday (May 4), the first teaser of the movie was released, and after watching the short clip from the movie, we can surely say that another classic piece from the director is on the way."},"Alia Bhatt to attend Met Gala 2024 after making debut last year: Report":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/03/349207-untitled-design-2023-05-03t112154475.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-alia-bhatt-to-attend-met-gala-2024-after-making-debut-last-year-report-718175","content":"This year, the Raazi star will be one of the few Indian celebrities who will be part of the Met Gala fashion parade.The whole world is gearing up for the Met Gala 2024, and this year, Bollywood actress Alia Bhatt will be at the MET Gala, as per Indian news channel India Today.I’m definitely not attending this year because I’m filming, but I think I really do enjoy watching people's creativity during the Met Gala and I am really excited to see how it will turn out.Last year, Alia channelled her inner princess at The Metropolitan Museum of Art as she walked at the iconic stairs wearing a custom Prabal Gurung ball gown made of pearls for the Met Gala theme 'Karl Lagerfeld: A Line of Beauty', which was a homage to the legendary fashion designer."},"Amitabh Bachchan completes work on Rajinikanth-starrer Vettaiyan":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/11/17/311497-untitled-design-89.png?imwidth=400","link":"https://www.wionews.com/entertainment/amitabh-bachchan-completes-work-on-rajinikanth-starrer-vettaiyan-718198","content":"Bachchan, who last worked with Rajinikanth in the 1991 film Hum, shared the update on the project on his personal blog on Saturday.\"Another day at work comes to an end and the end too of this project, for me.(sic),\" the 81-year-old wrote alongside a series of pictures from the film set in Mumbai.But ever the dissatisfaction of a doubt, when in reflection, whether the work done was to satisfaction and whether there shall be an opportunity to have another try to redo and maybe improve the previous."},"Kareena Kapoor appointed as Unicef India's National Ambassador: 'Emotional day for me'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429382-happy-30th-birthday-2024-05-05t122224267.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-kareena-kapoor-appointed-as-unicef-indias-national-ambassador-emotional-day-for-me-718152","content":"The Crew star, who has been associated with UNICEF India since 2014, will support the not-for-profit organisation in furthering every child’s right to early childhood development, health, education and gender equality, a press release said.She joins as UNICEF India National Ambassador together with our four Youth Advocates to the UNICEF family.UNICEF India on Saturday announced Bollywood star Kareena Kapoor Khan as its new National Ambassador.UNICEF India Representative Cynthia McCaffrey said she is delighted to welcome Kareena Kapoor Khan as the National Ambassador."},"Kendrick Lamar vs Drake beef explained by Dua Lipa on SNL: Watch":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429380-untitled-design-2024-05-05t121812002.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/kendrick-lamar-vs-drake-beef-explained-by-dua-lipa-on-snl-watch-718156","content":"In the last 36 hours, Lamar has released two diss tracks targeting Drake.And, to explain it all to fans, Dua Lipa turned into a culture critic who has been locked away \"for the past 48 hours trying to piece it all together\" for the latest episode of Saturday Night Live.Drake released “Family Matters” on Friday, which was quickly followed by Lamar putting out “Meet the Grahams” at midnight.And to make her latest appearance extra special, she pulled double duty as host and musical guest for the episode."},"Madonna kicks off huge show before giddy fans in Rio":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/11/417762-untitled-design.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/madonna-kicks-off-huge-show-before-giddy-fans-in-rio-718144","content":"In Rio, the singer was expected to, over a span of two hours, portray all the Madonnas: the \"Material Girl,\" the bride, the rebellious Catholic, the virgin, the cowgirl, and others.Dressed all in black, pop idol Madonna broke into her hit \"Nothing Really Matters\" Saturday night before throngs of joyful fans jammed onto Brazil's famed Copacabana beach in Rio.\"\"Madonna helped me leave the Catholic Church, think about many things and change my relationship with my family,\" said Odara, a trans woman, standing near the huge stage -- twice the size of any used previously on the tour.- A 'virgin' and a 'material girl' - After 80 performances across Europe and North America, the Rio concert provided a crowning touch to a tour that took on sudden urgency when the singer in June suffered a life-threatening bacterial infection."},"Anushka Sharma has the best reaction as Virat Kohli hits sixes during RCB vs GT IPL match":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429361-untitled-design-2024-05-05t101736749.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/anushka-sharma-has-the-best-reaction-as-virat-kohli-hits-sixes-during-rcb-vs-gt-ipl-match-718121","content":"Bollywood actress Anushka Sharma made a rare public appearance at Bengaluru's cricket stadium to support her husband and cricketer Virat Kohli, and his team, Royal Challengers Bangalore, as they clashed against the Gujarat Titans at the Chinnaswamy Stadium on Saturday.Looking stunning as ever, Anushka was seen donning a purple-hued satin shirt adorned with pearls and paired with pants.The appearance marked Anushka's first public outing since her son's birth.For the outing, she opted for a striped blue shirt and pants."},"Ed Sheeran, Kendall Jenner and more celebs at F1 Grand Prix in Miami":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429357-untitled-design-2024-05-05t094837006.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/ed-sheeran-kendall-jenner-and-more-celebs-at-f1-grand-prix-in-miami-718113","content":"com/rmSGMjZCFORocking a spring-ready plaid dress with spaghetti straps, Kendall Jenner was spotted in the Pitlane during practice prior to Round 2 Miami of the F1 Academy at Miami International Autodrome on May 3.Tom Brady, Kendall Jenner, NFL star Patrick Mahomes, Ed Sheeran, Kendall Jenner, Camila Cabello, and Taylor Zakhar Perez - all were spotted witnessing the car racing spectacular in Miami over the weekend.The Grand Prix is scheduled for May 5, 2024, at the Miami International Autodrome in Miami Gardens.It’s like so much going on,” Sheeran continued kendall jenner at f1 grand prix, she’s the coolest girl pic."},"Tony winner and Angela Lansbury's brother Edgar Lansbury dies at 94":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/05/429340-untitled-design-2024-05-05t080023551.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/tony-winner-and-angela-lansburys-brother-edgar-lansbury-dies-at-94-718084","content":"Peggy Gordon, an American singer-songwriter best known for her role as Peggy in the original 1971 Off-Broadway cast of Godspell, took to Facebook on Friday to pay an ode to Lansbury.His Broadway credits also include Godspell, The Only Game in Town, Look to the Lilies, The Magic Show, American Buffalo, Lennon, and the 1974 Broadway revival of Gypsy.She wrote, \"My huge adorable and adoring Godspell family, we have now lost our surrogate daddy, Edgar Lansbury.So, I believe Edgar’s energy continues."},"Emily Blunt reveals the scariest stunt of her career wasn't in Edge of Tomorrow but...":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/10/04/163060-happy-30th-birthday-54.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-emily-blunt-reveals-the-scariest-stunt-of-her-career-wasnt-in-edge-of-tomorrow-but-718081","content":"\"The character's entrance had to start in the clouds and come all the way down toward the ground while holding an umbrella aloft,\" she explained.Contrary to expectations, the entrance as Mary Poppins in Mary Poppins Returns was the most stressful for her.\"Hell of an entrance, though,\" he said.\""},"Shreyas Talpade on whether his heart attack was a result of Covid vaccine: ‘Never know what goes wrong..’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/12/14/399243-untitled-design-45.png?imwidth=400","link":"https://www.wionews.com/entertainment/shreyas-talpade-is-curious-weather-his-heart-attack-was-a-result-of-covid-vaccine-we-have-no-idea-718051","content":"”When asked if his heart attack was the side effect of the COVID-19 vaccine, the Golmaal actor said he would ''not negate the theory.”However, the actor said he would do more research to find out whether his heart attack was the result of COVID-19 or the vaccine.While the debate continues, Indian actor Shreyas Talpade, who recently suffered a heart attack last year in December has reacted to the theories, hinting that his heart attack may be an impact of the vaccine as well.Apparently there are theories about the vaccine as well… We have been hearing about people working out or playing and something happening, or a person who is taking care of himself and something happening."},"Nick Jonas diagnosed with Influenza A, all upcoming shows rescheduled":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/05/349674-untitled-design-2023-05-05t130211411.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-nick-jonas-diagnosed-with-influenza-a-all-upcoming-shows-rescheduled-718021","content":"''In the video, the Sucker singer said he was not feeling good for a couple of days and has lost his voice.Giving the health update, the rockstar said that due to his health crisis, he will not be able to perform in Mexico this weekend.We always want to be able to give you guys the best show and I’m just not able to do that for these shows in Mexico at this time (sic).Singer Nick Jonas has been diagnosed with influenza A."},"Jujutsu Kaisen Chapter 259: Major spoilers to expect, release date and more":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/06/423309-untitled-design-83.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/jujutsu-kaisen-chapter-259-major-spoilers-to-expect-release-date-and-more-718010","content":"According to the official MANGAPlus website, Jujutsu Kaisen Chapter 259 will be released on Monday, May 13, 2024, at 12 am JST.Jujutsu Kaisen Chapter 258 describes how Black Flash can activate the Reverse Cursed Technique and heal the user.While the exact release time varies by region, fans can read the chapter on Shueisha's official MANGAPlus the website.The chapter will feature a flashback to Yuji, Choso, Shoko, and others debating the use of RCT against Sukuna."},"The Boys Season 4: Release date, trailer and everything to know":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/04/429296-happy-30th-birthday-2024-05-04t174957853.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-the-boys-season-4-release-date-trailer-and-everything-to-know-718008","content":"The scenes in the trailer shows a massive crowd fight outside Vought headquarters, hinting at the unrest in the corrupt world, where Homelander, who is fighting to take over the Oval Office, is asking for more wrath from his team.Watch the trailer below:The official synopsis of season 4 reads, “In Season Four, the world is on the brink.As the trailer progresses, it takes us into the more chaotic world of Supes, where all things are on the brink of disaster.The three-minute trailer starts with Billy Butcher (Karl Urban), who is talking about the mistakes he has made."},"South Korean singer Anda reveals she's married and is a mother now, fans surprised":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/04/429278-happy-30th-birthday-2024-05-04t145726919.png?imwidth=400","link":"https://www.wionews.com/entertainment/south-korean-singer-anda-reveals-shes-married-and-is-a-mother-now-fans-surprised-717986","content":"On May 3, the popular Korean star shared that she has started a new chapter of life, which she has called: Anda 2.0  The popular singer shared that she has welcomed a baby and has eventually tied the knot with her long-time boyfriend.Because I wanted to greet you with news about my music or a new album, I felt so sorry about sharing this kind of unexpected news instead, so I wound up spending too much time worrying about how to share this news with you.Taking to Instagram, Anda shared that she has started her new life as a singer, mother and wife."},"Amitabh Bachchan reunites with Rajinikanth, says he's still the same simple, humble person":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/04/429266-happy-30th-birthday-2024-05-04t135542611.png?imwidth=400","link":"https://www.wionews.com/entertainment/amitabh-bachchan-reunites-with-rajinikanth-says-hes-still-the-same-simple-humble-person-717961","content":"Superstar @rajinikanth and Shahenshah @SrBachchan grace the sets of Vettaiyan in Mumbai, with their unmatched charisma.🌟 Superstar @rajinikanth and Shahenshah @SrBachchan grace the sets of Vettaiyan in Mumbai, with their unmatched charisma."},"Lovers & Friends Festival 2024 canceled due to ‘dangerous weather’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/17/419068-untitled-design-26.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lovers-friends-festival-2024-canceled-due-to-dangerous-weather-717952","content":"The post reads, ''Lovers & Friends Festival has unfortunately been cancelled due to dangerous weather predicted for Saturday.Lovers & Friends Festival has unfortunately been canceled due to dangerous weather predicted for Saturday.com/Koo5ZirzmGOn the website of the festival, the organisers have mentioned that the National Weather Service has issued a high wind warning, including dangerous 30-35 mph sustained winds with gusts potentially more than 60 mph.Scheduled to take place in Las Vegas, the organisers were forced to cancel the event in less than 15 hours due to potential bad weather."}}