{"Mr and Mrs Mahi trailer: Cricket is the heart of Rajkummar Rao-Janhvi Kapoor’s love story":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/09/430359-screenshot-wwwndtvcom-20240509-151900.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-mr-and-mrs-mahi-trailer-cricket-is-the-heart-of-rajkummar-rao-janhvi-kapoor’s-love-story-720638","content":"Set in the tone of \"Dekha Tenu Pehli Pehli Baar Ve\" from Kabhi Khushi Kabhie Gham, this one-of-a-kind love story is a full dose of entertainment.The 2-minute trailer take us into the lives of the couple Mahi and Mahima, who are different from each other, apart from one commonality i.Directed by Gunjan Saxena: The Kargil Girl director Sharan Sharma, the film stars Rajkummar and Janhvi as husband and wife, who get on a journey of self-discovery as they continue to fulfil their dreams together.Starring Janhvi Kapoor and Rajkummar Rao, the fourthcoming movie is the story of the couple and their unending love for cricket.Until, one day Mahi finds out that his wife is a good cricketer."},"Case registered against actor Allu Arjun, YSRCP MLA for poll code violation":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/12/430915-happy-30th-birthday-2024-05-12t155731875.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-case-registered-against-actor-allu-arjun-for-violating-poll-code-of-conduct-720604","content":"After visiting Reddy, Arjun clarified that he visited Nandyala for his friend and is not supporting any political party.It doesn't mean I am backing or supporting any political party,\" Arjun said to a reporter.On May 11, Actor shared a photo of him waving at the huge crowd of fans from the balcony as he wished his friend for election.A case has been filed against the Pushpa actor and Yuvajana Sramika Rythu Congress Party (YSRCP) MLA Ravi Chandra Kishore Reddy for allegedly violating the Model Code of Conduct in Andhra Pradesh's Nandyala.As per India Today, there was a large public gathering at the residence of MLA Ravi Chandra Kishore Reddy when Allu Arjun came for supporting Reddy in the Andhra Pradesh elections."},"Richa Chadha drank alcohol to perform dance sequence in Heeramandi: ‘It made things worse..’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/02/428854-your-paragraph-text-2024-05-02t153825651.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-richa-chadha-drank-alcohol-to-perform-dance-sequence-in-heeramandi-it-made-things-worse-720593","content":"One scene for which she has garnered a huge round of applause from the audience is her drunken dance at the Nawab's wedding.Talking about the challenges she faced while filming the dance scene, Richa said in an interview with Zoom, \"On the first day, I wasn’t getting it, to do the drunk dancing.Nevertheless, the show continues to make headlines, and the most recent one is about actor Richa Chaddha.Discussing the scene, the actor revealed that despite being a teetotaler, she decided to drink a few shots of gin.“I was better off pretending to be drunk than actually getting a little tipsy."},"GLAAD Media Award 2024: The Last Of Us, Heartstopper and other winners":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/12/430912-untitled-design-2024-05-12t145755947.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-glaad-media-award-2024-the-last-of-us-heartstopper-and-other-winners-720591","content":"Here's a list of winners announced tonight in New York and March 14 in Los Angeles:“Jennifer Hudson Surprises HIV Activist with $10,000” The Jennifer Hudson Show (syndicated)Renee Rapp, Snow Angel (Interscope)David Archuleta (Archie Music)“Blue River Wedding” Ada Twist: Scientist (Netflix)Baldur’s Gate 3 (Larian Studios)“Adolescentes trans relatan su experiencia” Noticiero Telemundo (Telemundo)“New York City Gay Bar Deaths Classified as Homicides” (NBC News Now)“Indiana Students Put on LGBTQ-Themed Play Themselves After it’s Canceled By the School” Yasmin Vossoughian Reports (MSNBC)“As Drag Bans Proliferate, Maren Morris Goes Deep With Drag’s Biggest Stars on Why the Show Must Go On” by Stephen Daw (Billboard)“The AP Interview: Pope Francis Says Homosexuality Not a Crime” by Nicole Winfield (AP.GLAAD also previously announced that +Life Media received the Barbara Gittings Award for Excellence in LGBTQ Media.While Jennifer Hudson received the Excellence in Media Award, Orville Peck received the Vito Russo Award.Back In March, Oprah Winfrey received the Vanguard Award and Niecy Nash-Betts received the Stephen F.Red, White & Royal Blue, The Last Of Us, Heartstopper, The Jennifer Hudson Show, Rustin and Las Culturistas took awards home."},"Actor Gurucharan Singh Missing Case: Police visit Taarak Mehta set, question actor’s co-stars":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/27/427798-untitled-design-2024-04-27t145053669.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-actor-gurucharan-singh-missing-case-police-visit-taarak-mehta-set-question-actor’s-co-stars-720580","content":"Also, there were some rumours related to Gurucharan Singh’s payments being due from the production house.A person from the production team shared more details about the interrogation.With over three years of experience, Pragati Awasthi specialises in everything related to the showbiz world."},"Kareena Kapoor Khan gets HC notice for using 'Bible' in pregnancy book title":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/12/430900-untitled-design-2024-05-12t135237305.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/kareena-kapoor-khan-gets-hc-notice-for-using-bible-in-pregnancy-book-title-720572","content":"The book is currently grabbing headlines for a legal notice the actress has received from the Madhya Pradesh High Court for using the word \"Bible\" in the memoir's title.Justice Gurpal Singh Ahluwalia, presiding over a single-judge bench, issued the notice to Khan and the book sellers, seeking an explanation for the choice of the word \"bible\" in the title.\"The Bible is the holy book of Christianity all over the world and it is wrong to compare Kareena Kapoor Khan's pregnancy with the Bible,\" he said, accusing the actress of using the word for \"cheap publicity\".Bollywood actress Kareena Kapoor Khan, who shares two kids, Taimur and Jeh, with actor Saif Ali Khan, released her memoir Kareena Kapoor Khan's Pregnancy Bible in 2021.He alleged that the word \"bible\" in the book's title is hurtful to the sentiments of the Christian community."},"Roger Corman, Legendary B-movie producer, dies aged 98":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/12/430891-happy-30th-birthday-2024-05-12t123555086.png?imwidth=400","link":"https://www.wionews.com/entertainment/legendary-b-movie-producer-roger-corman-dies-720553","content":"American B-movie director and producer Roger Corman, best known for churning out hundreds of low-budget films and giving some of Hollywood's biggest stars their early breaks, has died at the age of 98, US media reported on Saturday.As a producer and director, he racked up more than 500 credits, according to movie database IMDB, among them \"The Fast and the Furious\", \"Grand Theft Auto\" and \"The Cry Baby Killer\", Nicholson's big screen debut.co/IXASfbIaqPDirector Ron Howard said Corman gave him his first chance at the job when he was just 23 years old.Roger Corman was my very first boss, my lifetime mentor and my hero,\" Terminator producer Gale Anne Hurd posted on social media platform X, calling him, \"one of the greatest visionaries in the history of cinema.\"Corman specialised in low-budget productions, which often became cult classics, including \"The Little Shop of Horrors\" and a series of Edgar Allan Poe adaptations starring Vincent Price.\""},"Preity Zinta miffed as paps hound her for photos in Mumbai: 'You're scaring me'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/12/430869-untitled-design-2024-05-12t093343243.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/preity-zinta-miffed-as-paps-hound-her-for-photos-in-mumbai-youre-scaring-me-720525","content":"Preity, who co-owns IPL team Punjab Kings, reached Dharamshala on Thursday to watch the PBKS vs RCB match.After the match was over, Preity distributed PBKS T-shirts to the fans as a gesture of thanking everyone for supporting the team."},"Manisha Koirala feels she's made peace with not becoming a mother after cancer battle":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/07/14/366887-horizons-2023-07-14t175941853.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/manisha-koirala-feels-shes-made-peace-with-not-becoming-a-mother-after-cancer-battle-720512","content":"Bollywood actress Manisha Koirala, who recently made a comeback with Sanjay Leela Bhansali's Heeramandi: The Diamond Bazaar, revealed in an interview that she had made peace with not embracing motherhood after her battle with ovarian cancer.So after a lot of debate, I made peace with that.and it is with God's grace that I have been given a second life after battling cancer.\"For those unaware, the actress was diagnosed with stage IV ovarian cancer in 2012.There are so many dreams that you realise are not going to happen, and you make peace with that."},"Switzerland's Nemo wins 2024 Eurovision Song Contest; becomes first non-binary winner":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/12/430865-untitled-design-2024-05-12t091010182.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/switzerlands-nemo-wins-2024-eurovision-song-contest-becomes-first-non-binary-winner-720510","content":"Beating runner-up Croatia, Switzerland won the international song competition in the Swedish host city of Malmo.The winner also gets to host the competition the next year.The 2024 Eurovision winner received the contest's official glass trophy, shaped like a classic, old-fashioned microphone.Swiss rapper and singer Nemo, 24, took the trophy home for his song \"The Code\", a drum-and-bass, opera, rap and rock track about Nemo's journey of self-discovery as a non-binary person.Croatia's Baby Lasagna, born Marko Purisic, 28, came second with \"Rim Tim Tagi Dim\", a song about a young man who leaves home aspiring to become a \"city boy\" with better opportunities."},"AI cameras tested in Cannes ahead of Olympics":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/12/430849-untitled-design-2024-05-12t074642472.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/ai-cameras-tested-in-cannes-ahead-of-olympics-720486","content":"State-of-the-art security using artificial intelligence is being deployed at the Cannes Film Festival in a test for potential applications at the Paris Olympics two months later.But Paris authorities say they are sending some 400 security forces in addition to the 200 officers and 66 surveillance agents already in Cannes.The Cannes town hall has been asking to implement them since 2019 but has only been given permission thanks to changes in surveillance laws introduced for the Olympics that kick off in Paris in July, according to Mayor David Lisnard.The festival has a further 400 security guards around the main venue, the Palais des Festivals -- not to mention the many private security agents employed at all the beach, villa and yacht parties.There were concerns that mobilisation for the Olympics would deprive the festival of police resources."},"Did you know these luxury brands refused to work with Zendaya once?":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/07/429745-your-paragraph-text-2024-05-07t081034689.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-did-you-know-that-these-luxury-brands-refused-to-work-with-zendaya-once-720453","content":"For this year's dress code, ‘The Garden of Time’ the actress not just walked wearing one, not two but three looks.The Euphoria star has achieved a lot in her career, and this year she co-chaired the Met Gala, the fashion's biggest night, for the first time along with Chris Hemsworth, Bad Bunny and Jennifer Lopez.'” Further, Roach went on to reveal that her client still did not wear any one of those big fashion pieces, who turned her down, except one.For her first walk, she donned a villainous look, featuring a strapless one-shouldered gown with a dramatic blue and green stripe by Maison Margiela.But on a red carpet, she still has never worn Dior on a carpet."},"Dutch contestant excluded from Eurovision hours before the song contest final":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/11/430799-happy-30th-birthday-2024-05-11t174738281.png?imwidth=400","link":"https://www.wionews.com/entertainment/dutch-contestant-excluded-from-eurovision-hours-before-final-720411","content":"Dutch contestant Joost Klein was dropped from Saturday's Eurovision final just hours before the event following an incident unlinked to the controversy over Israel's participation in the Gaza war.\"Swedish police have investigated a complaint made by a female member of the production crew after an incident following his performance in Thursday night's Semi Final,\" the European Broadcasting Union said in a statement.At the press conference after the second semi-final, Klein repeatedly covered his face with a Dutch flag, seemingly signifying he didn't agree with being placed next to the Israeli contestant Eden Golan.Dutch pubic broadcaster Avrotros told AFP in an email that it found the move \"disproportionate\", adding that it it was \"shocked by the decision\".Swedish police told AFP they had questioned a man for alleged \"intimidation\"."},"Meghan Markle reveals why she married Prince Harry during Nigeria trip":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/11/430795-happy-30th-birthday-2024-05-11t173643290.png?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-meghan-markle-reveals-why-she-married-prince-harry-during-her-nigeria-trip-720409","content":"During the first day of the event, Harry talked about mental health and Markle was all things proud of him.“In some cases around the world, in more than you would believe, there is a stigma when it comes to mental health.”At the event, Harry took the mic as he addressed the stigma around mental health.The couple kicked off their trip on May 10 by visiting a school in the capital city of Abuja, where they took part in the mental health summit.”\"Just make sure that you are taking care of yourselves and that begins with your mental health by really talking about whatever's coming up for you,\" she said."},"Freedom at Midnight: Arif Zakaria and Ira Dubey first look from political drama is out!":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/11/430784-happy-30th-birthday-2024-05-11t152432299.png?imwidth=400","link":"https://www.wionews.com/entertainment/freedom-at-midnight-arif-zakaria-and-ira-dubey-first-look-from-political-drama-is-out-720386","content":"”On playing Fatima Jinnah in the series, Ira said, “Freedom at Midnight marks my second collaboration with Sony LIV after Potluck.Similarly, Ira Dubey's portrayal of Fatima Jinnah, who played a significant role in supporting and influencing his journey.Zakaria and Dubey will bring to life the pivotal figures of Muhammad Ali Jinnah and Fatima Jinnah (his sister) in the upcoming series.\"\"When casting for the roles of Jinnah and Fatima in the series, I was immediately drawn to Arif Zakaria for his striking physical presence - gaunt, towering, with piercing eyes and a commanding voice that exuded authenticity.Expressing his excitement about playing a towering personality like Muhammad Ali Jinnah in the series, actor Arif Zakaria said, “In preparing to portray Muhammad Ali Jinnah, I realised how important it was to depict him as a flawed and complicated human being rather than an untouchable hero."},"Sean 'Diddy' Combs denies raping minor in new motion to dismiss sexual assault case":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/11/18/393837-untitled-design-2023-11-18t121129649.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/sean-diddy-combs-denies-raping-minor-in-new-motion-to-dismiss-sexual-assault-case-720356","content":"Sean \"Diddy\" Combs, along with former Bad Boy Entertainment president Harve Pierre, is facing a lawsuit accusing them and another individual labelled as \"Third Assailant\" of sexual assault.In February, Rodney “Lil Rod” Jones, a former producer and videographer, filed a lawsuit claiming that Combs sexually harassed, drugged, and threatened him during their time working together.\"This lawsuit is one of several sexual assault lawsuits that Combs has faced in recent months.In response to the allegations, Combs' lawyers have filed a motion to dismiss the lawsuit, calling it a \"second attempt to state an entirely false and hideous claim against the Combs Defendants.District Court for the Southern District of New York, alleges that Combs, Pierre, and the \"Third Assailant\" sex trafficked and gang-raped her when she was a minor."},"When Orry thought famous street food vada pav is an aloo tikki burger: 'Kept me in the bathroom for two days’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/11/24/395156-your-paragraph-text-2023-11-24t143306388.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-when-orry-thought-famous-street-food-vada-pav-is-a-aloo-tikki-burger-kept-me-in-the-bathroom-for-two-days’-720358","content":"I am going to the gym, I am doing a lot of self-reflection, sometimes I do Yoga, I go for a massage, I am working, but I am working on myself.In a MensXP interview, he said, “You go for a job, you do painting, you are a painter.” He said, “I am working on myself.I enjoyed it a lot, but there was a chutney inside it, and that chutney kept me in the bathroom for two days."},"Sikkimese director Samten Bhutia's Tara: The Lost Star to be screened at Cannes Film Festival":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/11/430756-happy-30th-birthday-2024-05-11t130330932.png?imwidth=400","link":"https://www.wionews.com/entertainment/sikkimese-director-samten-bhutias-tara-the-lost-star-to-be-screened-at-cannes-film-festival-720334","content":"Hailing the team for the big achievement, Sikkim Chief Minister Prem Singh Tamang wrote on X,  ''Congratulations to the team behind 'Tara: The Lost Star' for its debut at Cannes International Film Festival 2024, a remarkable achievement for Sikkim.''Congratulations to the team behind 'Tara: The Lost Star' for its debut at Cannes International Film Festival 2024, a remarkable achievement for Sikkim.Elaborating more on the movie, the filmmakers told PTI, ''With its compelling narrative, 'Tara: The Lost Star' is a feature film in Nepali Language which offers a window into the beliefs of Himalayas and Sikkim's vibrant culture.As the excitement builds for its Cannes debut, 'Tara: The Lost Star' promises to shine a spotlight on Sikkim's burgeoning film industry like never before,\" they said.This year, a Sikkimese feature film Tara: The Lost Star from Sikkimese Director Samten Bhutia has been selected for market screening  (Marche du Film) at the prestigious film festival."},"Mother's Day Special: Moms who've created an enviable legacy in entertainment industry":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/05/11/430738-untitled-design-2024-05-11t114816333.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/lifestyle/news-mothers-day-special-moms-whove-created-an-enviable-legacy-in-entertainment-industry-720307","content":"Her daughter Alaya F earned a diploma in acting at the New York Film Academy, made her debut in Jawaani Jaaneman and won the Filmfare Award for Best Female Debut.Daughter Masaba, after establishing herself as a fashion and beauty entrepreneur, has also successfully ventured into acting with the popular Netflix show, Masaba Masaba where Neena plays herself with trademark candour.Neena who has appeared in cult films (Jaane Bhi Do Yaaro, Saath Saath, Utsav), starred in the clutter-breaking Doordarshan show Khandaan and directed a TV drama (Saans) is now also enjoying major commercial success via hits like Badhaai Ho and The Last Color.However, right from her debut in Student of the Year, her daughter cracked the code of commercial success.In her autobiography Sach Kahoon Toh, celebrated actor Neena Gupta recalls how as a single mom, she would take her daughter to work with her including on the set of Tipu Sultan which was tragically engulfed in fire."}}