{"Margot Robbie to produce a live-action movie on famous board game Monopoly":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/08/26/375610-margot-robbie.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-margot-robbie-to-produce-a-live-action-movie-on-famous-board-game-monopoly-710029","content":"Robbie along with her production company partners Tom Ackerley and Josie McNamara will be backing the live-action feature film based on the popular board game.After Barbie, actress Margot Robbie is set to work on a movie based on the game Monopoly.''However, it's not clear how Robbie and her company will make a story based on the Monopoly world.The Oscar-nominated actress is on board as a producer and will be backing the project with her production company LuckyChap.Created in the 1900s by Lizzie Magie, the board game was once known as The Landlord's Game."},"Michael Jackson biopic: First look starring Jaafar Jackson released at CinemaCon":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/08/29/376198-michael-jackson.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-michael-jackson-biopic-first-look-starring-jaafar-jackson-released-at-cinemacon-709998","content":"The movie that will take the audience back to the king-size yet complicated life of Jackson will be released in the theatres on April 18, 2025.Colman Domingo will play the role of Michael's father Joe Jackson with Nia Long as his mother Katherine Jackson.”The short clip also gave a glimpse of the pop star's mother Katherine (played by Nia Long), telling the late pop star that he has a ''a very special light' and to 'make that light shine onto the world.Henderson will portray the role of Jermaine Jackson, while Jayden Harville will play the young version.Tre Horton will play Marlon Jackson, and Jaylen Lyndon Hunter will be the younger version of Marlon."},"Protesters in Eurovision host city call for boycott of Israel":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/11/424310-happy-30th-birthday-2024-04-11t080123371.png?imwidth=400","link":"https://www.wionews.com/entertainment/protesters-in-eurovision-host-city-call-for-boycott-of-israel-709959","content":"Protesters waving Palestinian flags and banners on Wednesday called for a boycott of Israel at the upcoming Eurovision Song Contest in the Swedish city of Malmo that will host the event next month.Protesters outside Malmo city held a banner calling for the boycott of Israel above the Eurovision logo, while another banner featured red stains to look like blood and a pair of scissors cutting the chord to a microphone displaying an Israeli flag.The European Broadcasting Union (EBU), which organises Eurovision, bills the song contest as a non-political event.The union has so far resisted calls for Israel to be excluded from Eurovision, and on Wednesday urged people to refrain from online abuse directed at some participating artists.But the global political backdrop often weighs on the contest, which this year takes place amid protests and boycotts over the devastating Israeli military campaign in Gaza, triggered by Hamas' Oct."},"Taapsee Pannu opens up about her intimate wedding: 'Didn't want to make it a public affair'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/25/420708-your-paragraph-text-21.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-taapsee-pannu-opens-up-about-her-intimate-wedding-didnt-want-to-make-it-a-public-affair-709934","content":"However, some videos and images of the wedding ceremony were shared on social media which indicated that it was an intimate affair attended by the couple's close family and friends.The actress married her long-time beau in an intimate ceremony in Udaipur, Rajasthan in the last week of March.Weeks after Taapsee Pannu married badminton player Mathias Boe, the actress has admitted that she wanted her wedding to be a strictly private affair.Taapsee opens up about her wedding\n\nThe actress recently spoke about her wedding to the Hindustan Times and stated she did not want her personal life to be under scrutiny and hence did not share the news on social media.Taapsee's friends from the industry including Pavail Gulati, Abhilash Thapliyal and Kanika Dhillon, and even her sister Shagun posted some photos of the ceremony but the actress did not."},"Conan O'Brien returns to The Tonight Show, 14 years after being fired from it":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/11/19/170343-happy-30th-birthday-2020-11-19t110925190.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/conan-obrien-returns-to-the-tonight-show-14-years-after-being-fired-from-it-709930","content":"Well-known comedian and former host of The Tonight Show, Conon O'Brien, is back on TV.During his interview with current host Jimmy Fallon, O'Brien engaged in lighthearted banter, joking about his towering height and reminiscing about his brief stint as the Tonight Show host.His return to the Tonight Show was long anticipated.Needless to say, his return on the show which made him a household name, sparked excitement among fans.He had been fired from the show in 2010."},"Ben Affleck, Jennifer Garner's daughter comes out as trans at grandfather's memorial service":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424287-your-paragraph-text-40.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-ben-affleck-jennifer-garners-daughter-comes-out-as-trans-at-grandfathers-memorial-service-709925","content":"At Garner's father's memorial service, they introduced themselves as Fin.While speaking at the service, they introduced themselves as, \"Hello, my name is Fin Affleck.Ben and Jennifer Garner have three kids together - Violet Anne Affleck, 19, Fin, and Samuel Garner Affleck, 12.Ben Affleck and Jennifer Garner's daughter, Seraphina Rose has come out as a trans person.In 2022, Lopez introduced daughter Emme at a public event with they/them pronouns."},"National Siblings Day 2024: Bollywood stars pay sweet tributes to their siblings":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424261-your-paragraph-text-39.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-national-siblings-day-2024-bollywood-stars-pay-sweet-tributes-to-their-siblings-709888","content":"From Varun Dhawan to Taapsee Pannu to Shilpa Shetty, several stars shared adorable photos and videos of their siblings and celebrated love.He captioned the post as, \"I would be nowhere in life without my elder brother.Varun Dhawan took to Instagram to share heartwarming photos with his elder brother - filmmaker Rohit Dhawan.\"Meanwhile, Aparshakti Khurrana shared a hilarious video of his brother Ayushmann Khurrana and him dancing to a hit Punjabi song as their wives cheered on and Ayushmann's kids looked shocked.The first person who believed in me was my brother."},"Bridget Jones is back: Renee Zellweger to return in fourth film":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424209-horizons-2024-04-10t170925362.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-bridget-jones-is-back-renee-zellweger-to-return-in-fourth-film-709811","content":"The new film is titled Bridget Jones: Mad About The Boy.The two are set to return in a fourth film and we can’t wait to see their magic on the screen one more time.A third film came in 2016 and saw Firth's Darcy competing with billionaire US love guru Jack Qwant, played by Patrick Dempsey, for Bridget's attention.Notably, Emma Thompson, who starred in the third film as Bridget's obstetrician will also return.In the Bridget Jones: Mad About The Boy book, Bridget is a widow in her 50s with two children after Mark's death some years earlier."},"Richa Chadha and Ali Fazal’s Girls Will Be Girls selected for TIFF Next Wave Film Festival":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/01/17/326121-horizons-66.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-richa-chadha-and-ali-fazals-girls-will-be-girls-selected-for-tiff-next-wave-film-festival-709802","content":"Richa Chadha and Ali Fazal's much-acclaimed production feature Girls Will Be Girls has been officially selected for screening at this year's TIFF Next Wave Film Festival.We are immensely grateful for this opportunity and excited to share 'Girls Will Be Girls' with the diverse and passionate audience at TIFF Next Wave.\"Ali Fazal echoed her sentiments, stating, \"Participating in TIFF Next Wave is a dream come true for any filmmaker.In a statement, Richa Chadha commented, \"Being selected for TIFF Next Wave is a huge honour for us.To have it selected for TIFF Next Wave alongside such remarkable films is both humbling and exhilarating."},"Patrick Swayze’s widow Lisa Niem says the actor gave her his blessings to remarry":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424207-your-paragraph-text-38.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-patrick-swayzes-widow-lisa-niem-says-the-actor-gave-her-his-blessings-to-remarry-709800","content":"There are some pretty rabid Patrick fans out there who think I’m evil and just don’t like me because I was married to him,” she said.”On finding love again after Swayze's death Lisa added, \"I didn't realise just how lonely I was until much, much later.Late actor Patrick Swayze's widow Lisa Niemi has opened up about her decision to remarry after Swayze's death and find love again after his death.Go ahead, tell me just because I lost my husband that I don’t love him anymore.Three years after his death, Lisa met her now-husband Albert DePrisco, who was himself recovering from a “heartbreaking” divorce."},"Gwen Stefani reveals rumours about her divorce with Blake Shelton made her doubt herself":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/07/05/201053-2.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/gwen-stefani-reveals-divorce-rumours-about-her-marriage-to-blake-shelton-made-her-doubt-herself-709739","content":"\"The truth is I am in love with my best friend,\" she said, adding, \"and all this s--- I'm thinking of in my brain, that's all it is.\"These are conversations that she and I have with each other: ‘Are you still going to love me when I’m old or if I forget who I am?’\"In my own relationship, even though I know the truth of what's happening today, you still create drama in your own mind about your insecurities and what might happen.\"\"\n\n\"I was in that phase of the relationship with Blake and getting paranoid,\" Stefani said.\"I had been going through those times where you're questioning, 'Oh my gosh, am I just getting older?"},"Joker 2 trailer: A romance for the books as Joaquin Phoenix and Lady Gaga come together":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424161-horizons-2024-04-10t125846529.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-joker-2-trailer-a-romance-for-the-books-as-joaquin-phoenix-and-lady-gaga-come-together-709726","content":"The first film came five years ago as the Todd Phillips directorial told the origin story of Joker – a struggling stand-up comedian and part-time clown named Arthur Fleck.It starts with Joker being locked up at the end of the first film.Giving us a peek into their romance, Gaga and Phoenix get together on the screen for the first time to play the world-famous lovers.It doesn’t veer too far from the first film.Expect the unexpected as Joaquin Phoenix and Lady Gaga get together in Joker 2 to tell the famous love story of Joker and Harley Quinn, which has been told many times before in various films and shows."},"Jon Snow ‘Game of Thrones’ spinoff not happening. Here's why":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2018/09/11/28214-new%25252520%2525282%252529-20170828103159.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-jon-snow-‘game-of-thrones’-spinoff-not-happening-heres-why-709670","content":"Kit Harington who played the fan-favourite character Jon Snow in Game of Thrones recently revealed that makers have shelved the idea of a Jon Snow spinoff show.In Game of Thrones, Kit’s character Jon Snow was exiled from Westeros.He said that the spinoff centred around Jon Snow is “off the table” since they “couldn’t find the right story to tell”.If you were among those who were eagerly waiting for a spinoff show on the life story of Game of Thrones character Jon Snow, we have a sad update for you.Also read: The Little Mermaid star Halle Bailey shows off her post-baby body in bikini: PicsBut they didn’t go ahead with it since they “couldn’t find the right story to tell”."},"Watch viral video: Janhvi Kapoor walks barefoot to Siddhivinayak temple on Gudi Padwa":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424113-horizons-2024-04-10t093304526.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-watch-viral-video-janhvi-kapoor-walks-barefoot-to-siddhivinayak-temple-on-gudi-padwa-709646","content":"It was confirmed recently that Janhvi will feature in a South Indian film with Ram Charan.Enter Sanjay Leela Bhansali's magical world of passion, love and betrayalIn pictures that confirmed the feature, Ram shared pics of Boney and Janhvi seated on a couch.He also shared a candid photo in which Janhvi and Ram were seen chatting in his backyard.Following the announcement, Janhvi, along with her father Boney Kapoor, visited Ram Charan’s residence in Hyderabad.Sharing the photos, Ram wrote, “Looking forward to #RC16!!"},"Srikanth trailer: Rajkummar Rao brings to life the story of industrialist Srikanth Bolla":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424107-horizons-8.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-srikanth-trailer-rajkummar-rao-brings-to-life-the-story-of-industrialist-srikanth-bolla-709639","content":"Sharing the trailer of the film on social media, the makers wrote, \"Embark on a journey where every moment becomes extraordinary through Srikanth's vision!The trailer of the film Srikanth gives us a glimpse of what Rajkummar Rao’s Srikanth looks like.The film also features actor Sharad Kelkar, an investor in Bolla's business, and Alaya F, who is likely to be his love interest.The film will trace the journey of Srikanth who established the Bollant Industries, which gave employment opportunities to other visually impaired people.The film is directed by Tushar Hiranandani."},"Heeramandi trailer out! Enter Sanjay Leela Bhansali's magical world of passion, love and betrayal":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/09/424023-untitled-design-2024-04-09t203510439.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-heeramandi-trailer-out-enter-sanjay-leela-bhansalis-magical-world-of-passion-love-and-betrayal-709520","content":"Finally, Bhansali is bringing the idea to life with this web series, scheduled to premiere on May 1 on Netflix.The web series is set in pre-independence India and revolves around a beautiful, royal world where love, loss and liberation intertwine.Two songs of the series have already been unveiled by the makers.The series' cast includes Manisha Koirala, Sonakshi Sinha, Aditi Rao Hydari, Fardeen Khan, Adhyayan Suman, Richa Chadha, Sanjeeda Shaikh, Sharmin Segal, Shekhar Suman, and Taha Shah Badussha.He directed his first film, Khamoshi: The Musical, in 1996."},"Indian rapper MC Stan shares cryptic note about quitting music; deletes post later":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/03/19/339622-untitled-design-2023-03-19t082310898.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/indian-rapper-mc-stan-shares-cryptic-note-about-quitting-music-deletes-later-709494","content":"Why do you want to leave rap so soon?Rap scene needs more artists like you.After getting inspired by International rappers like Eminem, he began his career in rap and hip-hop.On March 1st, he announced the release of his track \"Meri Zindagi Rap Se Pan Deep Hai\".\"Mein rap chhodhne wala hoon,\" Stan wrote on Instagram, which translates to, \"I am going to quit rap.\""},"The Little Mermaid star Halle Bailey shows off her post-baby body in bikini: Pics":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/09/423986-untitled-design-2024-04-09t175622181.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/the-little-mermaid-star-halle-bailey-shows-off-her-post-baby-body-in-bikini-pics-709452","content":"American singer, songwriter and actress Halle Bailey is leaving her fans shocked with her post-baby body!Last week, Bailey celebrated her 24th birthday with her son and her boyfriend DDG in St.Sharing a picture of her son's hand, Bailey wrote, \"Even though we’re a few days into the new year, the greatest thing that 2023 could have done for me, was bring me my son..The Little Mermaid actress took to social media on Monday and shared a picture in a peach bikini, giving a glimpse of her body transformation journey.American singer Pharrell Williams will produce the movie."},"Ekta Kapoor fears how audience will react to LSD 2: ‘I will hide again’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/07/16/149984-new-32.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/ekta-kapoor-fears-how-audience-will-react-to-lsd-2-i-will-hide-again-709431","content":"Producer Ekta Kapoor recently shared in an interview that she faced a tonnw of backlash after the release of her film Thank You For Coming and she worries how the audience will receive her next film LSD 2.The makers of LSD 2 released the teaser of the film earlier this month.So, if you are in that fashion, then I can give you a disclaimer that you should not watch the LSD 2 teaser or trailer.Before the release of the teaser, the director shared a video online to clarify that he was going to show the truth in the film, no matter how dark.So, while making LSD 2, we portrayed the same truth, an authentic picture of life that we see all around us."}}