{"Watch viral video: Janhvi Kapoor walks barefoot to Siddhivinayak temple on Gudi Padwa":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424113-horizons-2024-04-10t093304526.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-watch-viral-video-janhvi-kapoor-walks-barefoot-to-siddhivinayak-temple-on-gudi-padwa-709646","content":"It was confirmed recently that Janhvi will feature in a South Indian film with Ram Charan’s.Enter Sanjay Leela Bhansali's magical world of passion, love and betrayalIn pictures that confirmed the feature, Ram shared pics of Boney and Janhvi seated on a couch .He also shared a candid photo in which Janhvi and Ram were seen chatting in his backyard.Following the announcement, Janhvi along with her father Boney Kapoor visited Ram Charan’s residence in Hyderabad.Sharing the photos, Ram wrote, “Looking forward to #RC16!!"},"Srikanth trailer: Rajkummar Rao brings to life the story of industrialist Srikanth Bolla":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/10/424107-horizons-8.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-srikanth-trailer-rajkummar-rao-brings-to-life-the-story-of-industrialist-srikanth-bolla-709639","content":"Sharing the trailer of the film on social media, the makers wrote, \"Embark on a journey where every moment becomes extraordinary through Srikanth's vision!The trailer of the film Srikanth gives us a glimpse of what Rajkummar Rao’s Srikanth looks like.The film also features actor Sharad Kelkar, an investor in Bolla's business, and Alaya F, who is likely to be his love interest.The film will trace the journey of Srikanth who established the Bollant Industries, which gave employment opportunities to other visually impaired people.The film is directed by Tushar Hiranandani."},"Heeramandi trailer out! Enter Sanjay Leela Bhansali's magical world of passion, love and betrayal":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/09/424023-untitled-design-2024-04-09t203510439.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-heeramandi-trailer-out-enter-sanjay-leela-bhansalis-magical-world-of-passion-love-and-betrayal-709520","content":"Finally, Bhansali is bringing the idea to life with this web series, scheduled to premiere on May 1 on Netflix.The web series is set in pre-independence India and revolves around a beautiful, royal world where love, loss and liberation intertwine.Two songs of the series have already been unveiled by the makers.The series' cast includes Manisha Koirala, Sonakshi Sinha, Aditi Rao Hydari, Fardeen Khan, Adhyayan Suman, Richa Chadha, Sanjeeda Shaikh, Sharmin Segal, Shekhar Suman, and Taha Shah Badussha.He directed his first film, Khamoshi: The Musical, in 1996."},"Indian rapper MC Stan shares cryptic note about quitting music; deletes post later":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/03/19/339622-untitled-design-2023-03-19t082310898.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/indian-rapper-mc-stan-shares-cryptic-note-about-quitting-music-deletes-later-709494","content":"On March 1st, he announced the release of his track \"Meri Zindagi Rap Se Pan Deep Hai\".Rap scene needs more artists like you.After getting inspired by International rappers like Eminem, he began his career in rap and hip-hop.\"Mein rap chhodhne wala hoon,\" Stan wrote on Instagram, which translates to, \"I am going to quit rap.\"Why do you want to leave rap so soon?"},"The Little Mermaid star Halle Bailey shows off her post-baby body in bikini: Pics":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/09/423986-untitled-design-2024-04-09t175622181.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/the-little-mermaid-star-halle-bailey-shows-off-her-post-baby-body-in-bikini-pics-709452","content":"American singer, songwriter and actress Halle Bailey is leaving her fans shocked with her post-baby body!Last week, Bailey celebrated her 24th birthday with her son and her boyfriend DDG in St.Sharing a picture of her son's hand, Bailey wrote, \"Even though we’re a few days into the new year, the greatest thing that 2023 could have done for me, was bring me my son..The Little Mermaid actress took to social media on Monday and shared a picture in a peach bikini, giving a glimpse of her body transformation journey.The actress announced the arrival of her son in January this year."},"Ekta Kapoor fears how audience will react to LSD 2: ‘I will hide again’":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2020/07/16/149984-new-32.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/ekta-kapoor-fears-how-audience-will-react-to-lsd-2-i-will-hide-again-709431","content":"Producer Ekta Kapoor recently shared in an interview that she faced a tonnw of backlash after the release of her film Thank You For Coming and she worries how the audience will receive her next film LSD 2.Before the release of the teaser, the director shared a video online to clarify that he was going to show the truth in the film, no matter how dark.The makers of LSD 2 released the teaser of the film earlier this month.So, if you are in that fashion, then I can give you a disclaimer that you should not watch the LSD 2 teaser or trailer.So, while making LSD 2, we portrayed the same truth, an authentic picture of life that we see all around us."},"Alec Baldwin was ‘unable to control his emotions’ on Rust sets, claim prosecutors":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/21/353293-untitled-design-2023-05-21t172027366.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-alec-baldwin-was-unable-to-control-his-emotions-on-rust-sets-claim-prosecutors-709382","content":"New Mexico state prosecutors intend to argue that Alec Baldwin was unable to control his emotions on the set of the film Rust.“To watch Mr Baldwin’s conduct on the set of Rust is to witness a man who has absolutely no control of his own emotions and absolutely no concern for how his conduct affects those around him,” Morrissey wrote.In a 32-page public filing released on Monday, prosecutor Kari Morrissey alleged that the actor would shout and swear on the set, and his uncontrolled behaviour had affected safety.The prosecutor has alleged that Baldwin deflected responsibility after Hutchins was killed and that he had pulled the hammer but not the trigger on the reproduction Colt .The actor, who is also the producer of the film, is due to go on trial in July on a charge of involuntary manslaughter for his part in Hutchins’ death in Santa Fe."},"Ranbir Kapoor's fitness routine for Ramayana decoded! Actor takes swimming, hiking lessons to play Lord Ram":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/09/423937-untitled-design-100.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-ranbir-kapoors-fitness-routine-for-ramayana-decoded-actor-takes-swimming-hiking-lessons-to-play-lord-ram-709400","content":"Away from the hustle and bustle of city life, Ranbir Kapoor has started his intense prep session for his forthcoming film Ramayana, in which he is set to play the lead role of Lord Ram.Reacting to the video, a fan wrote, \"Hiking as a part of his training programme for the prep of Ramayana.While sharing the video on Instagram, Ranbir's personal trainer Nam wrote, \"Went to the countryside for a decompression week.In the video, the actor is seen lifting weights, trekking, biking, swimming, and jogging.He will reprise his role in the sequel, Animal Park."},"Maidaan Movie Review: Ajay Devgn's film is an essential watch for all sports lovers":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/03/08/416956-horizons-2024-03-08t080118368.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-maidaan-review-ajay-devgns-film-is-an-essential-watch-for-all-sports-lovers-709360","content":"The film opens in 1952, when the Indian football team was brutally defeated by France at the Olympics.Rahim's team itself is not devoid of Bengali footballers.Rahim recruits talent from across the country - much to the dismay of influential sports writer Roy Choudhary (Gajraj Rao) and federation member Shubrata (Rudranil) who want to lobby for a Bengali coach and Bengali players.Rahim (Ajay Devgn) has been accused of the team's dismal performance and the football federation of India is keen to replace him.It had players like Chuni Goswami (Amartya Ray), PK Banerjee (Chaitanya Sharma), and Arun Ghosh - men who became stalwarts in the subsequent years in Indian football."},"Hyderabad-origin actress Avantika Vandanapu named South Asian Person of the Year by Harvard":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/09/423914-untitled-design-99.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hyderabad-origin-actress-avantika-vandanapu-named-south-asian-person-of-the-year-by-harvard-709345","content":"Indian-American actress Avantika Vandanapu, who is best known for playing Karen Shetty in the musical comedy Mean Girls (2024), has been honoured with the “South Asian Person of the Year” award and title by Harvard University.This award is not just a recognition of my work, but it shines a light on the importance of storytelling that crosses borders and the vital role of Indian representation in global media.The actress was born to an Indian, Telugu-speaking family who lived in California.She also recently made her OTT debut with the Indian series Big Girls Don’t Cry.Upon receiving the award, Avantika said, \"Receiving this honour from an institution as esteemed as Harvard University is incredibly humbling and beyond inspiring."},"Amy Winehouse biopic Back to Black a celebration, its makers say":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/05/01/348756-untitled-design-2023-05-01t133454245.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/amy-winehouse-biopic-back-to-black-a-celebration-its-makers-say-709329","content":"\"I just wanted it to be in her perspective to kind of give her her agency back because I felt like it had been kind of taken away and she'd just become a victim of her tragedy,\" she said at the film's world premiere in London on Monday.\"I felt like doing it through her words, her music, kind of like brought the music back to life and celebrated her again, and that felt so important.Amy Winehouse's lyrics and music were the \"guiding star\" for director Sam Taylor-Johnson in bringing the late singer's story to the screen in Back to Black.But I wanted to meet with the family out of respect for the fact that I was making a film about their daughter, and it felt wrong not to meet with them.Considered one of the most talented singers of her generation, her untimely death shook the music world."},"Billie Eilish's third studio album Hit Me Hard and Soft will release on THIS date":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/09/423900-untitled-design-98.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/billie-eilishs-third-studio-album-hit-me-hard-and-soft-will-release-on-this-date-709320","content":"co/mpxvbwE68f pic.co/17Pl7AB8fb pic."},"American singer Morgan Wallen throws a chair off a bar roof; gets arrested":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/04/09/423890-untitled-design-97.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/american-singer-morgan-wallen-throws-a-chair-off-a-bar-roof-gets-arrested-709304","content":"Country music singer Morgan Wallen has been arrested after police say he threw a chair off the rooftop of a newly opened six-story bar in downtown Nashville.Wallen, 30, was booked into jail early Monday on three felony counts of reckless endangerment and one misdemeanour count of disorderly conduct, Metro Nashville Police tweeted.”In 2020, he was arrested on public intoxication and disorderly conduct charges after being kicked out of Kid Rock’s bar in downtown Nashville.The charges stem from a chair being thrown from the rooftop of Chief’s bar and landing on Broadway near two police officers.It spent 16 weeks at the top of the Billboard 200 in 2023 — which meant he held the top spot for 30% of the year, more time at No."},"Bade Miyan Chote Miyan and Maidaan releases postponed by a day. Here's why":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/01/21/407081-happy-30th-birthday-2024-01-21t204604981.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-bade-miyan-chote-miyan-and-maidaan-releases-postponed-by-a-day-heres-why-709241","content":"The film which stars Diljit Dosanjh and Parineeti Chopra in the lead is set to release on Netflix on April 12.Bollywood is gearing up to release two big-budget films- Bade Miyan Chote Miyan and Maidaan- this Eid.On Monday, the lead actors of the two films took to Instagram to announce the change in release date.Now, both Bade Miyan and Chote Miyan and Maidaan will be released on April 11 and Maidaan will have paid previews available on April 10 from 6 pm onwards.” The date change was announced as Eid will be celebrated in India on April 11 - which is typically an off day for most people across the country."},"Jonathan Majors ordered counselling by court in domestic violence case":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/12/19/400228-jonathan-majors-mcu.png?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-jonathan-majors-ordered-counselling-by-court-in-domestic-violence-case-709221","content":"In court Monday, Judge Michael Gaffey sentenced Majors to conditional discharge after noting that both sides agreed the charges did not warrant jail time, given the actor was a first-time offender with no prior criminal record.Actor Jonathan Majors has been ordered to complete a year-long counselling programme for assaulting his ex-girlfriend in a high-profile case.Majors was asked to undergo therapy but was not given jail time for the allegations that derailed the once-promising star’s career.According to the court order, Majors must complete a 52-week, in-person batterer’s intervention programme in Los Angeles, where the actor lives.If he violates the terms, Majors will have to face a year in jail."},"Vikrant Massey's 12th Fail to release in China this year":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/10/26/389198-happy-30th-birthday-2023-10-26t190227628.png?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-vikrant-masseys-12th-fail-to-release-in-china-this-year-709096","content":"Recalling the audience response his movie got at the first edition of the Festival of Young Cinema (Asia-Europe) in Macau, the veteran filmmaker said, “We are releasing in China in a big way this year.In an interview with Variety, director Vidhu Vinod Chopra revealed that they are planning to release the movie in a big way in China.Not only in China but in every market where there is struggle… where, like in the movie, there is a big government job that you can get through exams and then that changes your life.After the movie's roaring success in India, Vikrant Massey's film is heading for a release in China.Wherever that is… of course in China, in Korea… wherever that is, the film will do very well, because the people will relate to the struggle of the protagonist,” he said."},"Dhanush and Aishwarya Rajinikanth file for divorce two years after separation: Report":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/01/17/234226-dfff.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/dhanush-and-aishwaryaa-rajinikanth-file-for-divorce-two-years-after-separation-report-709028","content":"The couple began legal proceedings for their divorce almost two years after announcing their separation in January 2022.The statement released by the couple said, “18 years of togetherness as friends, couple, as parents and well-wishers to each other...On January 18, 2022, Venkatesh Prabhu Kasthuri Raja, famously known as Dhanush and Aishwarya announced their separation after 18 years of marriage.As per Indian Today, sources have confirmed that the former couple filed the petition under Section 13 B - divorce by mutual consent.After announcing their separation, many reports stated that the couple were looking for reconciliation."},"Jonathan Majors faces sentencing for assault conviction that derailed Marvel star’s career":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2023/03/27/341218-untitled-design-2023-03-27t081754535.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/hollywood/news-jonathan-majors-faces-sentencing-for-assault-conviction-that-derailed-marvel-star’s-career-709019","content":"“As he eagerly anticipates closing this chapter, he looks forward to redirecting his time and energy fully toward his family and his art,” Majors’ lawyers said in a statement last week after losing their bid to have the conviction tossed out.Actor Jonathan Majors is scheduled to be sentenced Monday in a New York court for assaulting his former girlfriend, a conviction that has already derailed the once-rising star’s career.The conviction stems from an altercation in March 2023 in which Majors’ then-girlfriend Grace Jabbari accused him of attacking her in the backseat of a chauffeured car, saying he hit her head with his open hand, twisted her arm behind her back and squeezed her middle finger until it fractured.Last month, Jabbari filed a civil suit in Manhattan federal court, accusing the actor of assault, battery, defamation and inflicting emotional distress.Lawyers for Majors and Manhattan District Attorney Alvin Bragg declined to say ahead of the hearing what punishment they’ll seek from a judge."},"Kiran Rao on her divorce with Aamir Khan, says 'I wanted to live independently'":{"img":"https://cdn.wionews.com/sites/default/files/styles/story_page/public/2024/02/06/410251-horizons-92.jpg?imwidth=400","link":"https://www.wionews.com/entertainment/bollywood/news-kiran-rao-on-her-divorce-with-aamir-khan-says-i-wanted-to-live-independently-709005","content":"Talking about her marriage with Aamir, she said, ''Aamir and I lived together for about a year before we got married, and honestly, we did it more because of our parents.There’s so much responsibility on the woman to run the house, to keep the family together… I took my sweet time so I didn’t have any worry about it.Kiran, who got married to Aamir in 2005, said she 'didn't fear' a divorce and wanted to live independently.Filmmaker and director Kiran Rao and actor Aamir Khan got divorced in 2021, ending their 15-year-long marriage.''Speaking about how a marriage tends to be more difficult for a woman, Kiran said, ''I think the thing that we don’t talk about enough is how marriage tends to stifle, especially women."}}