{"Rashid Khan in awe with fans' admiration for MS Dhoni: It's a different kind of love":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/ms-dhoni-1034180-16x9_0.jpg?VersionId=B4vq2QgXW3GbViRHvD7n6m2szK_bsL0y&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-rashid-khan-ms-dhoni-fans-love-gt-vs-csk-ahmedabad-2537805-2024-05-11","content":"\"They were amazing, we love to see them batting, Gill and Sudharsan, two of the best innings we've watched.IPL 2024 Full Coverage | IPL 2024 Points Table and Standings | 2024 IPL Full ScheduleRashid also lauded Shubman Gill and Sai Sudharsan for their record partnership of 210 runs and suggested that these 2 were two of the best innings that he witnessed.\"Once Dhoni comes into the stadium anywhere around the world, it's a different kind of love.Rashid Khan was in awe of fans' love and admiration for MS Dhoni after GT's match against CSK at the Narendra Modi Stadium, Ahmedabad on May 10, Friday.While speaking to the broadcasters after the match, Rashid lauded Dhoni for the kind of impact he has created amongst the fans as well as the players."},"MS Dhoni jogs away in hilarious gesture after pitch invader tries to touch his feet":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/ms-dhoni-100039683-16x9_0.jpg?VersionId=oFJJTvS05gw6QqA6gs5UiJhDP.bHeWrI&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-gt-vs-csk-ms-dhoni-jogs-away-pitch-invader-ahmedabad-2537808-2024-05-11","content":"com/KXn9TRv9sW\n— ðŸŽ° (@StanMSD) May 10, 2024Dhoni had scored 26 off 11 balls against GT, but it wasn't enough as the home side won the match by 35 runs.com/KmSnbZZsHh\n— JioCinema (@JioCinema) May 10, 2024He followed this with two more in the final over and a boundary.The incident occured during the final over of the GT vs CSK match as a fan evaded the security in the Narendra Modi stadium and made his way to meet Dhoni.A fan would run to the field to touch the feet of MS Dhoni and the CSK star had a hilarious reaction.Dhoni imitated that he was jogging away from the fan in slow motion before going to meet him."},"IRE vs PAK: Ireland shock Pakistan in 1st T20I after Andrew Balbirnie heroics":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/ireland-shock-pakistan-105504326-16x9_0.jpeg?VersionId=hycn4NIjP.4eUNhiFQVPKgFfKUb4tYja&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ire-vs-pak-ireland-shock-pakistan-1st-t20i-andrew-balbirnie-babar-azam-2537806-2024-05-11","content":"Ireland pulled off a stunning 5-wicket win over Pakistan in the first T20I of the 3-match series on Friday, May 10 at the Clontarf Cricket Club Ground in Dublin.com/xlHNCdPOea\n— Cricket Ireland (@cricketireland) May 10, 2024Iftikhar Ahmed used the long handle to good effect and stayed not out on 37 off 15 with 3 fours and as many sixes.With 11 runs needed off the last over, Curtis Campher hit Abbas Afridi for a couple of fours to take Ireland past the finish line with a ball to spare.Shaheen removed Balbirnie, who scored 77 runs off 55 balls and put Ireland under pressure.Balbirnie, at the other end, brought up his half-century off 36 balls to keep Ireland in the hunt."},"Kylian Mbappe announces exit from PSG ahead of reported Real Madrid move":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/kylian-mbappe-celebrates-after-scoring-against-real-sociedad-in-the-champions-league-reuters-16102252-16x9.jpg?VersionId=cXW9YK2dAPu58uTVyOqADbF.4GzSzETk&size=690:388","link":"https://www.indiatoday.in/sports/football/story/kylian-mbappe-announces-exit-from-psg-ahead-of-reported-real-madrid-move-2537797-2024-05-10","content":"com/t0cL2wPpjX\n— Kylian Mbappé (@KMbappe) May 10, 2024The French superstar's final game for PSG will be the away match to Nice on May 15.However, the French superstar announced he wouldn't be renewing with PSG last year and reports in February had suggested that he would be joining Real Madrid.French superstar Kylian Mbappe has announced that he would be leaving Paris Saint-Germain at the end of the season in a video on May 10, Friday.The French captain would say that he will be leaving France and Ligue 1 and heading for a new challenge.PSG's match against Toulouse will be Mbappe's final home game at the Parc des Princes on May 12, Sunday."},"GT vs CSK: Gill, Sudharsan star as Gujarat keep faint playoff hopes alive":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/gt-vs-csk-105042475-16x9_0.jpg?VersionId=vd4igU96iBQKJW.qq.I0dbUvf0OarvsG&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-gt-vs-csk-report-shubman-gill-sai-sudharsan-ahmedabad-2537787-2024-05-10","content":"Gujarat was able to get revenge for their loss in the IPL 2023 final last year and it was Gill and Sudharsan who stitched together a 210-run stand for the first wicket after being asked to bat.com/FDep6ooF73\n— JioCinema (@JioCinema) May 10, 2024The intent was clear from the very first over as Gill took on Mitchell Santner and hit him for a six and boundary.Gill and Sudharsan were aggressive from the get-go and both men scored their 100s off exactly 50 balls, with Sudharsan also becoming the fastest Indian to 1000 IPL runs.Shubman Gill and Sai Sudharsan's brilliant knocks helped GT maintain their playoff hopes and upset CSK in Ahmedabad by 35 runs on Friday, May 10.Gill and Sudharsan took the attack to them and they had no answers to the onslaught as the duo got 210 runs for the first wicket."},"Diamond League: Neeraj Chopra misses top spot by 0.02m with best throw of 88.36m":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/neeraj-chopra-105747109-16x9_0.jpeg?VersionId=m6M9GvatdWjLG7y4hzYdozNZNY4Vhz0w&size=690:388","link":"https://www.indiatoday.in/sports/other-sports/story/diamond-league-neeraj-chopra-kishore-jena-doha-2537785-2024-05-10","content":"Jena made a foul throw in his second attempt as the pressure built on him.Neeraj got back to second with a throw of 86.Neeraj Chopra, Doha Diamond League HighlightsNeeraj did not make the best of starts as he made a foul in his first attempt.Neeraj Chopra finished second in the Doha Diamond League on Friday, May 10.The Tokyo Olympics gold medallist finished with a best throw of 88."},"GT vs CSK: Sai Sudharsan to continue opening after Ahmedabad blitz? Star batter reacts":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/sai-sudharsan-100925857-16x9_0.jpg?VersionId=9J57keevKtQU3YGf..RzYbwL_epQu3Td&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-gt-vs-csk-sai-sudharsan-hundred-opening-ahmedabad-2537768-2024-05-10","content":"Therefore, I believe mixing it up well and bowling a bit wider would be a great option for our team, and it will make for an exciting game.(On playing well against CSK) I don't think it is relatable to Chennai, but I think I'm trying to give my best every game.Speaking to the commentary team after his knock, the TN batter said it was a great innings.Everybody wanted to, you know, play the way we wanted in this game, every game.It was a fantastic experience, and I wanted to play a game like this."},"Doha Diamond League 2024: Neeraj Chopra finishes 2nd with a throw of 88.36 metres":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/breaking_news/202405/neeraj-chopra--kishore-jena-104801204-16x9_0.jpg?VersionId=K2C1J0_X4uyCM2NFrar9C2J6IyAMPZkO&size=686:385","link":"https://www.indiatoday.in/sports/other-sports/story/doha-diamond-league-2024-neeraj-chopra-kishore-jena-olympics-2537629-2024-05-10","content":{}},"GT vs CSK: Shubman Gill roars back to form with 4th IPL hundred from 50 balls":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/shubman-gill-103045394-16x9_0.jpg?VersionId=YJGAGpsTFY3WJvWvJ8XKchg7fvrgOCbX&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-gt-vs-csk-shubman-gill-hits-4th-hundred-ahmedabad-2537743-2024-05-10","content":"Gill would bring up his fifty with a fine six and followed it up with a boundary in the next ball in the 11th over as he and Sudarsan would smash Simranjeet for 23 runs.Shubman Gill roared back to form with the bat as he scored his 4th IPL hundred during the clash against CSK in Ahmedabad on May 10, Friday.Gill would get into the 90s with a boundary as he and Sudharsan recorded the second-best opening partnership in IPL history.Gill would get to his hundred with a fine boundary and from 50 balls.IPL 2024 Full Coverage | IPL 2024 Points Table and Standings | 2024 IPL Full ScheduleAll the way ðŸš€\n\nShubman Gill with a free flowing half century ðŸ‘\n\nOpening stand continues to flourish ðŸ™Œ\n\nWatch the match LIVE on @JioCinema and @StarSportsIndia ðŸ’ûðŸ“ñ#TATAIPL | #GTvCSK pic."},"Sai Sudharsan breaks Sachin Tendulkar’s record en route to maiden IPL hundred":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/sai-sudharsan-101145151-16x9_0.jpeg?VersionId=JkkPuiEVaCTD3RBrVjGB5tJkQRlbN.zR&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-gt-vs-csk-sai-sudharsan-sachin-tendulkar-record-maiden-ipl-hundred-2537739-2024-05-10","content":"IPL 2024 Full Coverage | IPL 2024 Points Table and Standings | 2024 IPL Full ScheduleShaun Marsh – 21 innings Lendl Simmons – 23 innings Matthew Hayden – 25 innings Sai Sudharsan – 25 innings Jonny Bairstow – 26 innings Chris Gayle – 27 innings Kane Williamson – 28 innings Michael Hussey – 30 innings Sachin Tendulkar – 31 inningsRuturaj Gaikwad – 31 innings Sudharsan shines with stupendous century Back in the 2023 IPL final, Sudharsan missed out on scoring a hundred against CSK after he got out on 96.Jonny Bairstow, Chris Gayle, Kane Williamson and Michael Hussey got there in 26, 27, 28 and 30 innings respectively.Shaun Marsh, who won the Orange Cap while playing for PBKS in IPL 2008, holds the record in 21 innings.Along with Shubman Gill, who reached his century off 50 balls, Sudharsan gave the Super Kings plenty of headache to deal with.Lendl Simmons is placed second (23 innings)."},"Italian Open: Defending champion Elena Rybakina pulls out due to illness":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/elena-rybakina-104235605-16x9_0.jpg?VersionId=HYH3290NyJIY.6Z9o5PyAmofS7LRKYU2&size=690:388","link":"https://www.indiatoday.in/sports/tennis/story/italian-open-2024-elena-rybakina-pulls-out-illness-2537734-2024-05-10","content":"The Italian Open is the last WTA 1000 event before the French Open gets underway later this month.Elena Rybakina has pulled out of the Italian Open 2024 hours before her first round match against Romania's Irina-Camelia Begu on Friday, May 10.4 in the world, Rybakina will be one of the favourites to win the French Open along with the likes of Coco Gauff, Iga Swiatek and Aryna Sabalenka.\"Rome is so special to me, and I look forward to being back next year to reclaim my title and play in front of the Italian fans,\" Rybakina added.I have such good memories from last year and was looking forward to defending my title,\" Rybakina said in a statement released by the WTA tour."}}