{"Asian champions Qatar shift focus as World Cup preliminaries resume":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/N4VZ3BDAMNMQLCOBWSLUECVFZI.jpg","link":"https://www.reuters.com/sports/soccer/asian-champions-qatar-shift-focus-world-cup-preliminaries-resume-2024-03-19/","content":"Group G leaders Saudi Arabia play second-placed Tajikistan with Roberto Mancini's side holding a two-point lead over the surprise Asian Cup quarter-finalists.On Thursday, the Japanese face the first of two meetings with North Korea, playing in Tokyo before a tricky trip to Pyongyang on Tuesday for Hajime Moriyasu's side in their first internationals since underperforming at the Asian Cup.Qatar hosted the 2022 World Cup but have never qualified for the finals, with Japan, South Korea, Australia, Iran and Saudi Arabia claiming the Asian berths at the most recent edition.HONG KONG, March 19 (Reuters) - Qatar will resume their quest for a first-ever qualification for the World Cup against Kuwait on Thursday with stability in the dugout but change on the pitch six weeks after retaining the Asian Cup on home soil.South Korea go into their meeting with Thailand under Hwang Sun-hong, the interim replacement for Juergen Klinsmann following the German's post-Asian Cup sacking."},"AL East capsules: Yankees could be team to beat":{"img":null,"link":"https://www.reuters.com/sports/al-east-capsules-yankees-could-be-team-beat-2024-03-19/","content":"Toronto Blue Jays2023 record: 89-73 (3rd in AL East)KEY MOVESHe gone: LHP Hyun Jin Ryu, 1B Brandon Belt, RHP Jordan Hicks, RHP Jay Jackson, 3B Matt Chapman, RHP Adam Cimber, 2B/OF Whit MerrifieldNew faces: DH Justin Turner, INF/OF Isiah Kiner-Falefa, 1B Joey Votto, RHP Yariel Rodriguez, DH Daniel Vogelbach, 3B Eduardo EscobarBiggest question entering Opening Day: Did Toronto move the needle enough in the offseason to contend with the powerhouses of the American League East?New York Yankees2023 record: 82-80 (4th place, AL East)KEY MOVESHe gone: RHP Michael King, RHP Jhony Brito, C Kyle Higashioka, INF/OF Isiah Kiner-FalefaNew faces: OF Juan Soto, RHP Marcus Stroman, OF Alex Verdugo, OF Trent Grisham, LHP Caleb FergusonBiggest question entering Opening Day: Is this the year New York gets over the hump?Boston Red Sox2023 record: 78-84 (5th place, AL East)KEY MOVESHe gone: LHP Chris Sale, DH Justin Turner, OF Alex Verdugo, INF Luis UriasNew faces: RHP Lucas Giolito, OF Tyler O'Neill, SS Vaughn Grissom, RHP Liam Hendricks, C Tyler HeinemanBiggest question entering Opening Day: Does Brayan Bello have what it takes to be an ace?Tampa Bay Rays2023 record: 99-63 (2nd in AL East)KEY MOVESHe gone: RHP Tyler Glasnow, OF Manuel Margot, LHP Jake Diekman, RHP Robert Stephenson, OF/1B Luke Raley, RHP Calvin FaucherNew faces: SS Amed Rosario, RHP Ryan Pepiot, RHP Phil Maton, 2B Jose Caballero, OF Richie PalaciosBiggest question entering Opening Day: Is Tampa Bay's small-ball approach still going to work this year?March 19 - Baltimore Orioles2023 record: 101-61 (1st in AL East)KEY MOVESHe gone: OF Aaron Hicks, 2B Adam Frazier, RHP Kyle Gibson, RHP Jack Flaherty, LHP DL HallNew faces: RHP Corbin Burnes, RHP Craig Kimbrel, 2B Kolten Wong, 3B/2B Nick Maton, RHP Julio Teheran, RHP Jonathan HeasleyBiggest question entering Opening Day: How far can Baltimore's young core carry the team?"},"AL West capsules: Astros, Rangers vie for supremacy":{"img":null,"link":"https://www.reuters.com/sports/al-west-capsules-astros-rangers-vie-supremacy-2024-03-19/","content":"March 19 - 2024 AMERICAN LEAGUE WEST CAPSULESHouston Astros2023 record: 90-72 (1st place, AL West)KEY MOVESHe gone: OF Michael Brantley, C Martin Maldonado, RHP Ryne Stanek, RHP Hector NerisNew faces: LHP Josh Hader, C Victor CaratiniBiggest question entering Opening Day: Will the Astros make one last stand, or will they continue to build on their success?Texas Rangers2023 record: 90-72 (2nd place, AL West)KEY MOVESHe gone: LHP Jordan Montgomery, LHP Will Smith, LHP Aroldis Chapman, C Mitch Garver, OF Travis Jankowski, RHP Jake Odorizzi, OF Robbie Grossman, C Austin HedgesNew faces: RHP David Robertson, RHP Kirby Yates, RHP Tyler MahleBiggest question entering Opening Day: The Texas pitching staff is full of issues, with Jacob deGrom (Tommy John surgery) and Max Scherzer (back) nowhere close to being ready and postseason star Jordan Montgomery now a free agent.Seattle Mariners2023 record: 88-74 (3rd place, AL West)KEY MOVESHe gone: OF Teoscar Hernandez, 3B Eugenio Suarez, LHP Robbie Ray, OF Jarred Kelenic, C Tom Murphy, LHP Marco Gonzales, INF Jose CaballeroNew faces: OF Mitch Haniger, C Mitch Garver, 2B Jorge Polanco, RHP Gregory Santos, RHP Ryne Stanek, OF Luke Raley, INF Luis UriasBiggest question entering Opening Day: Will the offense carry its weight?Athletics ownership is focused on making a move to Las Vegas work out, but the roster neglect assures that the expected last season in Oakland will not be filled with much winning.Then again, Texas won the World Series last season despite holes in the pitching staff."},"Scotland to host South Africa, Portugal in autumn series":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/H3ANDO3CC5I6XPJDJXJIWUMCHE.jpg","link":"https://www.reuters.com/sports/scotland-host-south-africa-portugal-autumn-series-2024-03-19/","content":"March 19 (Reuters) - Scotland will welcome world champions South Africa to Murrayfield for one of four autumn international series fixtures in November that also include Australia, Fiji and Portugal, officials confirmed on Tuesday.Portugal, who will also play South Africa in July, have been rewarded for a strong showing at the Rugby World Cup in France last year with another fixture against tier one opposition on Nov.\"Having South Africa as one of our opponents will make for a special occasion.\"Fiji and Portugal both play a fast and open brand of rugby and performed very well in the Rugby World Cup in France.2 before the visit of South Africa eight days later."},"Real Madrid slam referee for not reporting abuse against Vinicius Jr":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/CUOJ6LETWRJRFEFZ6SRNW3I2AM.jpg","link":"https://www.reuters.com/sports/soccer/real-madrid-slam-referee-not-reporting-abuse-against-vinicius-jr-2024-03-18/","content":"March 18 (Reuters) - Real Madrid have filed a complaint against the referee who handled their game at Osasuna on Saturday for not including alleged racist insults aimed at their forward Vinicius Jr in his match report, the club said in a statement on Monday.\"Real have also extended the complaint they filed with the state prosecutor's office on Friday over hate and discrimination offences after alleged racist chanting by Atletico Madrid and Barcelona fans directed at the Brazil forward.\"\"Our club has filed a complaint with the Disciplinary Committee of the Spanish Football Federation (RFEF) against the referee of the match Juan Martinez Munuera,\" Real said.\"Real Madrid once again condemns these violent attacks of racism, discrimination and hatred, and demands that the necessary measures be taken, once and for all, to eradicate the violence that our player Vinicius Junior has been suffering.The 23-year-old Brazil international, who scored twice as La Liga leaders Real won 4-2 at the El Sadar Stadium, has been subjected to racial abuse on several occasions in Spain."},"Fenerbahce to consider withdrawing from Super Lig after players attacked":{"img":null,"link":"https://www.reuters.com/sports/soccer/fenerbahce-consider-withdrawing-super-lig-after-players-attacked-2024-03-18/","content":"The agenda points include evaluation of the actions to be taken following the incident \"including the withdrawal of our football Team A from the Super Lig\", a club statement read.FIFA President Gianni Infantino condemned the incident earlier on Monday, saying violence in the Turkish Super Lig is \"unacceptable\".March 18 (Reuters) - Fenerbahce will consider withdrawing from the Turkish top flight after some of their players were attacked by Trabzonspor fans following their weekend away win, the Super Lig club said on Monday.Trabzonspor supporters stormed the pitch and brawled with security forces and Fenerbahce players after their team lost 3-2 on Sunday in the latest incident in a league that has been marred by controversy this season.Fenerbahce will hold an Extraordinary General Assembly Meeting on April 2, the Board of Directors decided on Monday."},"Russia government becoming more aggressive towards Olympic movement, Bach says":{"img":null,"link":"https://www.reuters.com/sports/russia-government-becoming-more-aggressive-towards-olympic-movement-bach-says-2024-03-19/","content":"\"In the Olympic world, we have had for 30 years what the political world calls a two-state solution: we have an Israeli National Olympic Committee and a Palestinian National Olympic Committee.\"Unlike the Russian Olympic Committee, the Israeli Olympic Committee has not violated the Olympic Charter,\" the German said.\"The Russian Olympic Committee wants to exercise its authority over the regions annexed by the Russian government.The IOC will allow Russian and Belarusian athletes who qualify to take part as neutrals without their countries' flags, emblems or national anthems.We will be able to rely on our Olympic solidarity programme, which stipulates that at least six athletes per National Olympic Committee are required,\" he said."},"Germany to play Ukraine and Greece in last friendlies before Euro 2024":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/NOBFTUEXEJKJTCOWZ3WOTJ73CA.jpg","link":"https://www.reuters.com/sports/soccer/germany-play-ukraine-greece-last-friendlies-before-euro-2024-2024-03-19/","content":"BERLIN, March 19 (Reuters) - Hosts Germany will play two friendly matches against Ukraine and Greece in June days before the start of the European championships on home soil, the team said on Tuesday.The Germans will host Ukraine in Nuremberg on June 3 before taking on Greece in Moenchengladbach four days later.The Germans travel to France on March 23 and host the Netherlands three days later in their friendly matches this month.There is now mounting pressure in Germany for Nagelsmann and his team to start delivering with the Euros less than 100 days away.Ukraine and Greece are two fighting, passionate teams and we had problems with such opponents lately."},"Acerbi leaves Italy squad amid allegations of racist remarks":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/NXI425WYKRJCXIRHQ4QU6TRGMU.jpg","link":"https://www.reuters.com/sports/soccer/acerbi-leaves-italy-squad-amid-claims-racist-remarks-2024-03-18/","content":"March 18 (Reuters) - Italy's Inter Milan defender Francesco Acerbi has left the national team camp ahead of this month's friendlies after being accused of using a racist expression by Napoli's Juan Jesus in a Serie A game, the Italian Football Federation (FIGC) said.to let things settle for the national team and the player himself, who will return to his club today.I'm sorry I had to leave the national team training camp, but that's how it was and it's right.From the Nerazzurri defender's report, in waiting for what happened to be reconstructed in compliance with the autonomy of sporting justice, it emerged that there was no defamatory, denigrating or racist intent on his part,\" the FIGC said in a statement.I have been playing football for 20 years and I know what I say,\" Acerbi told Italian journalists when he returned from the camp."},"British government to introduce independent football regulator":{"img":null,"link":"https://www.reuters.com/sports/soccer/premier-league-study-football-governance-bill-2024-03-18/","content":"\"The government announcement comes after the Premier League last week failed to agree a new financial settlement with the English Football League (EFL), which runs the professional game in lower tiers.\"If over the coming seasons the Premier League ceases to be the best league in the world, it will be down to an interfering government.\"This means we will be competing with teams from leagues in Europe who give a fraction of the money Premier League clubs give to both the EFL and grassroots football.The regulator will be independent of government and football authorities with the power to fine clubs up to 10% of their turnover for non-compliance with financial regulations, the government said in a press release, opens new tab.This bill is a historic moment for football fans – it will make sure their voices are front and centre, prevent a breakaway league, protect the financial sustainability of clubs, and protect the heritage of our clubs big and small."},"WSL season attendance record broken with 36 games to play - BBC":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/IWK6SFAVIFILPIYPZYG4QNKKWI.jpg","link":"https://www.reuters.com/sports/soccer/wsl-season-attendance-record-broken-with-36-games-play-bbc-2024-03-19/","content":"This season also saw a new attendance record set for a WSL match in Arsenal's victory over Manchester United at the Emirates Stadium last month.March 18 (Reuters) - The Women's Super League set a new cumulative attendance record of 717,721 fans with six rounds to go this season, the BBC reported on Monday.All WSL teams except West Ham United will have played at least one match in their main stadium this season by the conclusion of the next round of matches at the weekend.The current campaign figure surpassed the previous record of 689,297 fans from the 2022-23 season after Chelsea Women's record 32,970 fans watched their 3-1 win over Arsenal on Friday."},"Raducanu withdraws from Miami Open - media reports say":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/MDEPUNC3WNNSZB6ZTY4MGDTNY4.jpg","link":"https://www.reuters.com/sports/tennis/raducanu-withdraws-miami-open-media-reports-say-2024-03-19/","content":"Raducanu received a wildcard into the main draw at the Miami Open and was scheduled to face China's Wang Xiyu in their first round match on Tuesday.March 18 (Reuters) - Britain's Emma Raducanu has withdrawn from the Miami Open on the eve of her first-round match due to a lower back injury, multiple news outlets reported on Monday.Open champion missed most of last season after having surgeries on her ankle and both wrists.Open, is scheduled to play in Britain's Billie Jean King Cup tie against France next month.The 21-year-old was looking to build on her performance at Indian Wells, where she played well but lost in the third round to world number two Aryna Sabalenka last week."},"Messi sidelined for Argentina friendlies with injury":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/DP6VTJIY45NKFPWVBBTTNQAJNQ.jpg","link":"https://www.reuters.com/sports/soccer/messi-sidelined-argentina-friendlies-with-injury-2024-03-18/","content":"due to a minor right hamstring injury sustained in the Inter Miami game against Nashville,\" the AFA said on its official X account.March 18 (Reuters) - Argentina captain Lionel Messi is out of this month's friendlies in the United States due to a hamstring injury, the country's FA (AFA) said on Monday.The 36-year-old forward missed Inter Miami's Major League Soccer game at DC United on Saturday after coming off injured in their midweek CONCACAF Champions League win against Nashville.Argentina will face El Salvador on Friday at Lincoln Financial Field in Philadelphia before playing Costa Rica four days later at the Los Angeles Coliseum.Messi is the latest absence for Lionel Scaloni's side following injuries to AS Roma forward Paulo Dybala, Bayer Leverkusen midfielder Exequiel Palacios and Bournemouth defender Marcos Senesi."},"Lazio appoint Tudor as manager":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/46K5QHHIIRLT7CSDD74LJNKLJA.jpg","link":"https://www.reuters.com/sports/soccer/lazio-appoint-tudor-manager-2024-03-18/","content":"March 18 (Reuters) - Lazio have appointed Igor Tudor as manager following the resignation of Maurizio Sarri, the Serie A club said on Monday.Italian media reported that Tudor, 45, has signed an 18-month contract with the Rome club.Tudor last coached French side Olympique de Marseille, leaving in June last year after leading them to a third-place finish.Sarri resigned on March 13 and Lazio assistant coach Giovanni Martusciello took charge for Saturday's 3-2 win at Frosinone.Lazio are ninth in the standings, four points outside the European qualifying places."},"Mbappe's reduced playing time with PSG may benefit France, Deschamps says":{"img":null,"link":"https://www.reuters.com/sports/soccer/mbappes-reduced-playing-time-with-psg-may-benefit-france-deschamps-says-2024-03-19/","content":"France under-23 coach Thierry Henry said on Monday that Real had turned down a request to release players for the Games.\"If that fatigue can be reduced a little (all the better),\" the French coach added ahead of a friendly against Germany on March 23.March 19 (Reuters) - Kylian Mbappe's reduced playing time with Paris St Germain in recent weeks could be good news for the France national team as it may keep him fresh for the European Championship and Olympic Games, manager Didier Deschamps said.Mbappe, who has been linked with a move to Real Madrid, has said he hopes to participate at this summer's Paris Olympics but a move to the LaLiga leaders may prevent him from doing that.14, a 2-1 Champions League win at Real Sociedad, a 3-1 French Cup win over Nice and a 6-2 league win over Montpellier on Sunday."},"Alex Ovechkin nets pair to reach milestone as Caps top Flames":{"img":null,"link":"https://www.reuters.com/sports/nhl/alex-ovechkin-nets-pair-reach-milestone-capitals-douse-flames-2024-03-19/","content":"March 19 - Alex Ovechkin scored twice and the visiting Washington Capitals rode a three-goal second period to a 5-2 victory over the Calgary Flames on Monday that lifted them into the Eastern Conference's second wild-card position.Lapierre restored the three-goal lead at 14:22 of the middle frame with a chip shot of a bounding puck in the slot that banked off the crossbar and into the net for his eighth of the campaign.Ovechkin reached the 20-goal mark for the 19th time in his 19-year career at 5:58 of the second period.However, Wilson sealed the victory with an empty-net goal, his 17th of the season, to round out the scoring with 2:29 left in the third.He set up at the top of the right circle and ripped a glove-side wrist shot for his 23rd goal of the season, which matches his career high."},"F1 driver Gasly invests in French third-tier soccer club":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/H7EYSOMGGNJK3DDBO66KCHYYIQ.jpg","link":"https://www.reuters.com/sports/formula1/f1-driver-gasly-invests-french-third-tier-soccer-club-2024-03-19/","content":"PARIS, March 18 (Reuters) - Formula One driver and Paris St Germain fan Pierre Gasly has become an investor in third-tier French semi-professional soccer club FC Versailles.\"I am delighted to get involved with FC Versailles because I have always wanted to get involved in professional football,\" said the 2020 Italian Grand Prix winner.\"\"Versailles once had France great Thierry Henry as a youth player as well as former France midfielder Hatem Ben Arfa.Go Versailles.The 28-year-old, who drives for Renault-owned Alpine, was announced on the club's website on Monday as the third partner owner."},"Jeff Skinner's hat trick powers Sabres past Kraken":{"img":null,"link":"https://www.reuters.com/sports/nhl/jeff-skinners-hat-trick-powers-sabres-past-kraken-2024-03-19/","content":"Skinner gave Buffalo the lead on a three-on-two rush at 3:56 of the first on a wrist shot from the left faceoff circle high to the goalie's stick side.Eberle gave the Kraken the lead 24 seconds into the first on a wrist shot from the high slot.Girgensons left a drop pass for Thompson, who beat Daccord high to the glove side with a snap shot from just outside the right faceoff dot.Tage Thompson and Alex Tuch each had a goal and an assist and Owen Power also scored for the Sabres (33-31-5, 71 points), who won for the fourth time in five games to pull within four points of the second and final Eastern Conference wild-card berth.Skinner completed his hat trick at 18:01 of the third period on a slap shot from the slot."},"Mumbai skipper Pandya fit to bowl in IPL, Kohli back in action for Bangalore":{"img":null,"link":"https://www.reuters.com/sports/cricket/mumbai-skipper-pandya-fit-bowl-ipl-kohli-back-action-bangalore-2024-03-19/","content":"\"A fully fit Pandya will be India's preferred seam bowling all-rounder at the T20 World Cup in West Indies.NEW DELHI, March 19 (Reuters) - All-rounder Hardik Pandya has declared himself fit to bowl in the upcoming Indian Premier League (IPL), a major boost for Mumbai as well as India ahead of the T20 World Cup in June.Pandya has been out of action since last October after suffering an ankle injury during a 50-overs World Cup match in Pune.It will be a nice feeling because we've been playing (together) for 10 years,\" said Pandya, who led Gujarat Titans to the 2022 IPL title in their debut season.My injury in (the) World Cup was a freak injury."}}