{"Spanish police arrest six over robberies of LaLiga footballers' homes":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/6E7KM37YTVLHZDTBBBSGJQU3WU.jpg","link":"https://www.reuters.com/world/europe/spanish-police-arrest-six-over-robberies-laliga-footballers-homes-2024-03-13/","content":"MADRID, March 13 (Reuters) - Spanish police have arrested six suspects in the robberies of the Madrid homes of eight wealthy individuals, including top soccer players Radamel Falcao and Rodrygo Goes.The string of burglaries were carried out from July 2022 in wealthy neighbourhoods in and around Madrid, according to police.Colombian Radamel Falcao, a player for LaLiga club Rayo Vallecano, and Brazilian Rodrygo Silva de Goes, who plays for Real Madrid, were among the victims, a police source told Reuters.The suspects also scoped out the security systems to determine how to gain entry, police added.Three of those detained are being held in custody, and an investigation into charges of robbery with force, one robbery with violence or intimidation, forgery of documents and money laundering is ongoing, police said."},"Horse racing-Henderson withdraws runners including Gold Cup hope Shishkin":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/L7VEW444ZBM7PA5262KS4PILWE.jpg","link":"https://www.reuters.com/sports/horse-racing-henderson-withdraws-runners-including-gold-cup-hope-shishkin-2024-03-13/","content":"Henderson, the active trainer with the second most Festival wins after Willie Mullins, said it was not possible for Shishkin to race on Friday after he had shown \"an unsatisfactory picture on which he couldn't possibly run\".March 13 (Reuters) - Trainer Nicky Henderson withdrew Gold Cup hope Shishkin on Wednesday after pulling several other runners, including Champion Chase contender Jonbon, from the Cheltenham Festival due to health concerns.It was there for all to see that there is obviously something affecting nearly all our horses and consequently we have reluctantly decided that Jonbon, First Street and Kingston Pride will not run today.\"It's impossible to identify any reason for all the disappointments and none of these three horses have given us any cause for concern and all yesterday's runners were scoped clean post-race and I'm glad to say all are sound this morning.\""},"Paris mayor wants Russian athletes banned from Olympics":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/LS7UHAI5DZOEVAARPWTDL7DKCM.jpg","link":"https://www.reuters.com/sports/paris-mayor-wants-russian-athletes-banned-olympics-2024-03-13/","content":"The International Olympic Committee, which decides on such matters, is due to discuss at a next session the question of the participation of Russian and Belarusian athletes in the opening ceremony.The International Paralympic Committee (IPC) said last week that Russian and Belarusian athletes joining the Paralympics would not be part of their opening ceremony.PARIS, March 13 (Reuters) - Paris mayor Anne Hidalgo on Wednesday said she hoped Russian athletes would be banned from taking part in the Paris Olympics and their opening ceremony.The mayor of Paris confirmed that, ahead of the Olympics, a ceremony would commemorate the victims of the attack on Israeli athletes and team members at the 1972 Munich Olympics.For now, Russian and Belarusian athletes cannot take part under their countries' flag, but are allowed to participate as neutrals - without flags or anthems being played."},"Irish talent factory primed for sustained success":{"img":null,"link":"https://www.reuters.com/sports/irish-talent-factory-primed-sustained-success-2024-03-13/","content":"While the Irish union's drive to keep their best players at one of the four home provinces began to change fortunes in the 2000s, the now critical sub-academy bridge between rugby-focussed private schools producing the likes of Brian O'Driscoll and national academy did not exist until 2007.3 million people where rugby is the fourth most popular sport, the conveyer belt of talent is testament to a joined up and finely tuned system from schools to the national team that Scotland coach Gregor Townsend predicted could see Ireland dominate world rugby for the next 5-10 years.The under-20 team's bid for a third successive Six Nations in a race that is going down to the wire is part of an unbeaten run in the competition that stretches back almost three years and includes two Grand Slams.That's honestly the difference,\" said Declan Fassbender, who led Dublin's Gonzaga College to their first ever Leinster Schools senior cup title last year and is also head coach of All Ireland League club side Lansdowne.\"To be a professional rugby player I would say is in a lot of kids' thoughts who have ability as opposed to maybe having an auld dream about 10 years, 15 years ago,\" said Fassbender."},"Barca into Champions League last eight with 3-1 win over Napoli":{"img":null,"link":"https://www.reuters.com/sports/soccer/barcelona-into-champions-league-last-eight-with-3-1-win-over-napoli-2024-03-12/","content":"The excellent Lamine Yamal's cross-field pass found Raphinha who cut into the area and wrong-footed Giovanni Di Lorenzo before curling a shot which came back off the far post and Cancelo was there to drive his first time effort into the net.BARCELONA, Spain, March 12 (Reuters) - Barcelona reached the Champions League quarter-finals for the first time in four years after a thrilling 3-1 home win over Napoli in their last-16 second leg gave them a deserved 4-2 aggregate victory on Tuesday.\"Napoli finally found a way through on the half hour when Matteo Politano went past Cancelo in the area before playing the ball back to Rrahmani whose run from the back was rewarded with a sidefooted shot past goalkeeper Marc-Andre ter Stegen.Minutes earlier Napoli had their best chance to level but Jesper Lindstrom headed just wide and the Italian champions go out after reaching the quarter-finals last season for the first time.The opening goal came in the 15th minute when Cancelo played in Raphinha down the left wing and he cut into the area and pulled a ball back which Lewandowski let run to the unmarked Fermin who calmly slotted his shot into the bottom left corner."},"Edwards' appointment as football chief executive great for Liverpool, says Klopp":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/LXMQ5BN7YRKVDC73M5Q355JCTA.jpg","link":"https://www.reuters.com/sports/soccer/edwards-appointment-football-chief-executive-great-liverpool-says-klopp-2024-03-13/","content":"don't think about next game on Sunday, even when it is Manchester United.he could have started last game, but I'm not sure for how long.\"We need the best legs for (tomorrow's) game,\" Klopp said.\"I can only see Sparta Prague wants to put things right and we have to play a good football match because it's our home game and our stadium.\"Liverpool host Sparta Prague in the second leg of their Europa League last 16 tie on Thursday with a 5-1 lead."},"Exclusive: Olympics-Paris City Hall to house flame on Bastille Day - mayor":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/G27T4E7CRVMNPN2GAC6FA4XHNU.jpg","link":"https://www.reuters.com/sports/olympics-paris-city-hall-house-flame-bastille-day-mayor-2024-03-13/","content":"PARIS, March 13 (Reuters) - The Olympic flame will stay within the Paris City Hall on the night of July 14 when France celebrates Bastille Day ahead of the 2024 Summer Games, mayor Anne Hidalgo said on Wednesday.The flame will then be handed over to Paris Games organisers in Athens on April 26 before spending a night at the French Embassy in the Greek capital and then departing the next day for France on board a three-masted ship, the 'Belem'.After the traditional lighting ceremony, Mina will then pass the flame to the first torchbearer, Olympic rowing champion Stefanos Douskos, at the edge of the ancient Olympic stadium for the start of an 11-day Greek relay.\"The flame will be carried across Paris on July 14-15.It will then travel through the wider Paris region and return to the capital for the opening ceremony on July 26, concluding a 68-days torch relay in the Games' host country."},"Lecce appoint Gotti as coach":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/VO5SVBY5K5K25KWGHPLZ6Z2IUU.jpg","link":"https://www.reuters.com/sports/soccer/lecce-appoint-gotti-coach-2024-03-13/","content":"March 13 (Reuters) - Lecce have appointed Luca Gotti as coach until the end of the season to replace Roberto D'Aversa who was sacked for head-butting an opposing player last weekend, the Serie A club said on Wednesday.Gotti has managed Udinese and his most recent coaching job was at Spezia last season when he was dismissed with the club in relegation trouble after 22 games.Lecce are 16th in the standings on 25 points, one above the relegation zone, and travel to bottom club Salernitana on Saturday.The coach has signed an agreement until June 30, 2024, with renewal in the event of avoiding relegation,\" Lecce said in a statement.\"Lecce announces that the technical management of the 1st team has been entrusted to coach Luca Gotti."},"Arsenal edge past Porto on penalties":{"img":null,"link":"https://www.reuters.com/sports/soccer/arsenal-edge-past-porto-penalties-2024-03-12/","content":"LONDON, March 12 (Reuters) - Arsenal survived a penalty shootout to scrape past Porto and reach the quarter-finals of the Champions League for the first time in 14 years after a tense last-16 duel had ended 1-1 on aggregate on Tuesday.The hosts coolly converted their first four penalties with Porto's Wendell hitting the post before David Raya saved Galeno's effort to send Arsenal through 4-2 in the shootout after the match finished 1-0 to the London club after extra time.Extra time failed to separate the sides but Mike Arteta's team held their nerve to snap a run of seven successive exits at the last-16 stage.Leandro Trossard's effort levelled the contest on aggregate shortly before halftime but Premier League leaders Arsenal were frustrated by the Portuguese side."},"Lopes volley takes 10-man Marinos into Asian Champions League semis":{"img":null,"link":"https://www.reuters.com/sports/soccer/lopes-volley-takes-10-man-marinos-into-asian-champions-league-semis-2024-03-13/","content":"Katsuya Nagato had been sent off for a second bookable offence two minutes into the second half in Yokohama for a Marinos side that held a slender 2-1 lead over the Chinese side from the first leg last week.Marinos will face Ulsan Hyundai in the semi-finals on April 17 and 24 after Hong Myung-bo's side saw off fellow South Korean side Jeonbuk Motors with a 2-1 aggregate win in their semi-final on Tuesday.\"Marinos will be playing in the semi-finals for the first time in the club's history and were rarely troubled by a Shandong side needing to score to keep alive their hopes of progressing.After a tight first half, the complexion of the game changed when Nagato was sent off in the 47th minute for a foul on Tong Lei having picked up his first booking just before halftime.YOKOHAMA, March 13 (Reuters) - Ten-man Yokohama F Marinos booked their place in the semi-finals of the Asian Champions League on Wednesday as Anderson Lopes' volley earned Harry Kewell's side a 1-0 win over Shandong Taishan to complete a 3-1 aggregate victory."},"Arsenal's defeat of Porto can fuel English title bid":{"img":null,"link":"https://www.reuters.com/sports/soccer/arsenals-defeat-porto-can-fuel-english-title-bid-2024-03-13/","content":"With no FA Cup involvement this weekend and then the international break, Arsenal will not play again until March 31 when they go to Manchester City in a crunch title clash.LONDON, March 13 (Reuters) - Arsenal's penalty shootout victory against Porto on Tuesday not only snapped their Champions League last-16 jinx but could also fuel their belief as they try to hold off Liverpool and Manchester City in the English league title race.\"Former Arsenal defender Martin Keown said Arsenal's progress to the quarter-finals of the Champions League will be a huge confidence boost in the run-in.\"Arsenal will discover their quarter-final opponents on Friday when they will join the likes of Man City, Paris St Germain, Bayern Munich, Real Madrid and Barcelona in the draw.As the emotion poured out inside the Emirates it felt like a psychological turning point for Arsenal as they ended a run of seven successive last-16 exits in the Champions League."},"Porto coach Conceicao says Arteta insulted his family":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/2V62IKXGBVJ63JPVCREF5QENQQ.jpg","link":"https://www.reuters.com/sports/soccer/porto-coach-conceicao-says-arteta-insulted-his-family-2024-03-13/","content":"\"During the game he (Arteta) turned to the bench and in Spanish, he insulted my family,\" Conceicao told reporters.\"Tensions were running high at the Emirates and the managers were seen having a heated conversation at the end of the game.March 13 (Reuters) - Porto manager Sergio Conceicao said Arsenal boss Mikel Arteta insulted his family during the London club's penalty shootout win over the Portuguese side in their Champions League last-16 tie on Tuesday.At the end I called over to get Arteta's attention, because the person he insulted is no longer with us.Arsenal won 4-2 on penalties following a 1-1 draw on aggregate, booking their place in the Champions League quarter-finals for the first time since 2010."},"Al-Hilal set world record for consecutive victories with 28th win":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/ML7I2PVLNFOZLO6PL33YBQZGNA.jpg","link":"https://www.reuters.com/sports/soccer/al-hilal-set-world-record-consecutive-victories-with-28th-win-2024-03-12/","content":"March 12 (Reuters) - Saudi Pro League side Al-Hilal have set a world record for consecutive victories by a top-flight team after beating Al-Ittihad 2-0 in the Asian Champions league quarter-finals on Tuesday for a 28th straight win.”Jesus' side lead the Saudi league with 65 points, 12 ahead of Cristiano Ronaldo’s Al-Nassr, who were eliminated from the Asian Champions League on Monday after a penalty shootout loss to Al-Ain.Jorge Jesus' side beat the previous record of 27 consecutive victories by Welsh Premier League champions The New Saints (TNS) from the 2016-17 season.Jesus's side can extend their winning run when they host Damac in the league on Saturday.It is up to everyone at Al Hilal to ensure that we close out the season as Roshn Saudi League champions and meet our targets in the cup competitions."},"Tapestry celebrating Olympic athletes unveiled in Paris":{"img":null,"link":"https://www.reuters.com/sports/tapestry-celebrating-olympic-athletes-unveiled-paris-2024-03-12/","content":"PARIS, March 12 (Reuters) - A tapestry depicting Olympic athletes competing around the Eiffel Tower, and designed by French-Iranian artist Marjane Satrapi, was unveiled in Paris on Tuesday, in the lead up to the 2024 Games.The tapestry will be displayed on the Hotel de la Marine in the Place de la Concorde in the French capital from late June.It features the silhouette of athletes in bright colours, poised to race or mid-competition, against the base of the Eiffel Tower and Paris skyline.The artist said she thought she was being pranked when asked to design the piece.\"When I got the call, I thought it was a hoax, but it wasn't."},"Who's laughing now? Xavi hits back at Barca critics":{"img":null,"link":"https://www.reuters.com/sports/soccer/whos-laughing-now-xavi-hits-back-barca-critics-2024-03-13/","content":"Barca's 3-1 home win over Napoli saw them advance 4-2 on aggregate in the last-16 tie.\"Xavi had said before the match that the second leg of the last-16 tie was Barca's biggest game of the season.\"The five-times Champions League winners had failed to progress from the group stage in the last two seasons and were defeated in the round of 16 in 2020-21.March 13 (Reuters) - Barcelona manager Xavi Hernandez had the last laugh on Tuesday after his side defied the critics by reaching the Champions League quarter-finals for the first time in four years.We had to be better than Napoli and we were, it's a more than deserved qualification, it's one of my best moments as Barcelona coach."},"Lazio's Sarri resigns, Martusciello named as new manager":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/VPLIDM3LBJN5DFTGGP7RRWCV3Q.jpg","link":"https://www.reuters.com/sports/soccer/sarri-resigns-lazio-coach-2024-03-13/","content":"March 13 (Reuters) - Maurizio Sarri has resigned from his role as Lazio coach and assistant coach Giovanni Martusciello has been nominated to lead the team, the Serie A club said on Wednesday.Lazio announce that Maurizio Sarri has handed in his resignation as head coach of the first team,\" the club said in a statement, opens new tab on Wednesday.The club last Thursday dismissed media reports saying Lazio considered sacking Sarri after their 3-0 defeat at Bayern Munich in the Champions League, the result that saw them out of the competition, stressing that his contract was expiring in 2025.Sarri has been criticised of late as Lazio, who finished second last season ahead of rivals Inter Milan and AC Milan to directly qualify for the Champions League, won only two of their last eight league games.Former Chelsea and Napoli manager Sarri took over Lazio in June 2021 from Simone Inzaghi, who left to sign with Inter Milan."},"Train tickets to main Paris main stations not yet available for Olympics opening ceremony":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/UI6KYSYHBBLVFN62676YTED5TA.jpg","link":"https://www.reuters.com/sports/train-tickets-main-paris-main-stations-not-yet-available-olympics-opening-2024-03-13/","content":"PARIS, March 13 (Reuters) - Passengers cannot yet book train tickets to and from three of Paris' main stations for July 26, when the Olympics opening ceremony will be held, France's state-owned railway operator said on Wednesday, as it opened ticket sales for the summer season.SNCF, as the railway operator is known, said tickets for its signature TGV bullet trains as well as regional trains for that day to and from the Lyon, Austerlitz and Bercy stations will only be issued for sale once authorities \"validate organisation conditions for the opening ceremony\".The Olympics opening ceremony, expected to be attended by hundreds of thousands of people, is due to start at 7.On Wednesday, SNCF had opened the sale of train tickets for the period from July 6 to Sept.(1730 GMT) and will comprise a 6-km long parade on the Seine river between the Austerlitz and d'Iena bridges, finishing in front of the Trocadero esplanade."},"Kings use big first half to banish Bucks with ease":{"img":null,"link":"https://www.reuters.com/sports/basketball/kings-use-big-first-half-banish-bucks-with-ease-2024-03-13/","content":"March 13 - Harrison Barnes and Kevin Huerter led a first-half barrage of 3-pointers, De'Aaron Fox scored a team-high 29 points and the Sacramento Kings held the visiting Milwaukee Bucks at arm's length throughout the final two periods en route to a 129-94 triumph Tuesday night.Giannis Antetokounmpo led all scorers with 30 points and added a game-high 13 rebounds for the Bucks, who completed a 1-3 tour of California with their second 35-point loss in seven days.Fox dominated his head-to-head with longtime rival Lillard, outscoring him 29-10 while running up seven assists, six rebounds and two steals.Antetokounmpo's game-high point total featured 10-for-14 success at the free-throw line.Malik Monk chipped in 25 points and Domantas Sabonis 22 for the Kings, who led by 22 in the second period en route to their third win in the last four games."},"Retiring North returns to Wales side against Italy":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/IUQV6TZ3VZJOVPOWUQVF6WT46E.jpg","link":"https://www.reuters.com/sports/north-back-wales-jenkins-returns-lock-against-italy-2024-03-13/","content":"March 13 (Reuters) - Wales coach Warren Gatland's has restored George North to his starting line-up for the final Six Nations fixture against Italy in Cardiff on Saturday as the centre confirmed he will retire after this year's championship.Wales team:15-Cameron Winnett, 14-Josh Adams, 13-George North, 12-Nick Tompkins, 11-Rio Dyer, 10-Sam Costelow, 9-Tomos Williams; 1-Gareth Thomas, 2-Elliot Dee, 3-Dillon Lewis, 4-Dafydd Jenkins (captain), 5-Adam Beard, 6-Alex Mann, 7-Tommy Reffell, 8-Aaron WainwrightReplacements: 16-Evan Lloyde, 17-Kemsley Mathias, 18-Harri O’Connor, 19-Will Rowlands, 20-Mackenzie Martin, 21-Kieran Hardy, 22-Ioan Lloyd, 23-Mason Grady.Gatland left out North and midfield partner Nick Tompkins for the 45-24 home defeat to France this past weekend, as Wales now face a fifth defeat in a row in this year's competition.\"Wales captain Jenkins Dafydd Jenkins is back in the second row to partner Adam Beard against Italy, while North and Tompkins come in for Joe Roberts and Owen Watkin respectively.After 14 years it feels like now is right time to step away,\" North, 31, said in a statement."}}