{"Bucs bring back K Chase McLaughlin on 3-year deal":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/OUWEZ3463VIDZGBZ33PHDCZXOQ.jpg","link":"https://www.reuters.com/sports/bucs-bring-back-k-chase-mclaughlin-3-year-deal-2024-03-11/","content":"March 11 - The Tampa Bay Buccaneers are re-signing kicker Chase McLaughlin to a new three-year deal, multiple outlets reported Monday.Financial terms were not reported.Tampa is McLaughlin's seventh team since entering the league in 2019."},"Liverpool robbed of a penalty in thrilling 1-1 draw with Man City, says Klopp":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/SKKS774QBNNNBBE5RL57OF3YIM.jpg","link":"https://www.reuters.com/sports/soccer/liverpool-robbed-penalty-thrilling-1-1-draw-with-man-city-says-klopp-2024-03-10/","content":"Alexis Mac Allister fired home a second-half penalty as Liverpool claimed a point against City at Anfield that left Arsenal top of the table in the tight title race.Liverpool are second on goal difference, while City are third with a point separating the top three teams.LIVERPOOL, England, March 10 (Reuters) - While Liverpool manager Juergen Klopp gushed about Sunday's breathless 1-1 Premier League draw with Manchester City, calling it the best his squad has ever played against the reigning champions, he was adamant his team were robbed of a penalty.So it must be good fun to watch it from the stands as well.But just before the final whistle Liverpool were screaming for a penalty to no avail when Jeremy Doku challenged Mac Allister in the box, with his boot catching the Argentine in the chest."},"Dominant Real Madrid thrash Celta Vigo 4-0 to cement top spot":{"img":null,"link":"https://www.reuters.com/sports/soccer/dominant-real-madrid-thrash-celta-vigo-4-0-cement-top-spot-2024-03-10/","content":"MADRID, March 10 (Reuters) - LaLiga leaders Real Madrid cruised to a 4-0 home win over relegation-threatened Celta Vigo on Sunday to restore their seven-point lead at the top of the table with a dominant display.Real were on top in the first half but were thwarted by some fine saves from Guaita, although he failed to stop the opener when Vinicius fired home from close range in the 21st minute, for his 10th goal of the season.Goals from Vinicius Jr and Arda Guler, the 19-year-old's first for the club, as well own goals from Celta's Carlos Dominguez and keeper Vicente Guaita sealed the victory for Real.Real doubled their lead in the 79th when Antonio Rudiger's thunderous header from a Luka Modric corner hit the bar and found the net after going in off Guaita's back.\"I'm very happy, I'm trying to be at my best, it's a good time of the season with good games and I want to continue like this, hopefully without injuries,\" Vinicius said.\""},"Lecce sack manager D'Aversa over headbutting incident":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/ZKZ3YLNVYJOU7LPGA6QPNBUR74.jpg","link":"https://www.reuters.com/sports/soccer/lecce-sack-manager-daversa-over-headbutting-incident-2024-03-11/","content":"March 11 (Reuters) - Lecce have fired manager Roberto D'Aversa after he headbutted an opposing player at the end of their loss to Hellas Verona at the weekend, the Serie A club said on Monday.D'Aversa headbutted Verona striker Thomas Henry in the aftermath of their 1-0 home defeat on Sunday, and the club released a statement later that day condemning the incident, and have now dismissed the 48-year-old.\"After the events that took place at the end of the Lecce - Verona match, U.D'Aversa was shown the red card along with Henry, and afterwards the manager, who joined Lecce in June 2023, apologised while saying his players had been continually provoked towards the end of the game.Lecce won five of their 28 league games this season which leaves them in 15th place on 25 points, one point above the relegation zone, while Verona overtook them with their win to move to 13th on 26 points."},"Mac Allister penalty earns 1-1 draw for Liverpool in Man City thriller":{"img":null,"link":"https://www.reuters.com/sports/soccer/mac-allister-penalty-earns-1-1-draw-liverpool-man-city-thriller-2024-03-10/","content":"We will fight for it and see what we can get.\"They will find an explanation."},"Llorente strikes late for Roma to rescue 2-2 draw at Fiorentina":{"img":null,"link":"https://www.reuters.com/sports/soccer/llorente-strikes-late-roma-rescue-2-2-draw-fiorentina-2024-03-10/","content":"Luca Ranieri put Fiorentina ahead after 18 minutes when he managed to get just ahead of his marker, heading in a flicked corner inside the far post.Llorente was in the right place five minutes into stoppage time when a cross was nodded down for him to volley it into the far corner.Fiorentina went ahead again in the 69th minute when Rolando Mandragora was played free inside the box, putting it away from a short distance, but Llorente silenced the home fans in stoppage time.The result put Roma in fifth place in the standings with 48 points, three points behind Bologna, who occupy the fourth and last automatic Champions League qualification spot.However, Roma equalised in the 58th minute when Houssem Aouar headed in from close range."},"Haas impressed by Bearman, Ferrari to wait on Sainz":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/4WQLCQCLNJNUJDRW2VKMDNAGMA.jpg","link":"https://www.reuters.com/sports/formula1/haas-impressed-by-bearman-ferrari-wait-sainz-2024-03-11/","content":"LONDON, March 11 (Reuters) - Haas team boss Ayao Komatsu hailed Oliver Bearman as \"a total package\" after the British teenager's hugely-impressive stand-in debut with Ferrari fuelled speculation he would be in Formula One full time next season.\"Last year when we ran him in FP1 (first practice) sessions in Mexico and Abu Dhabi straight away it was obvious that he’s a total package, he’s so impressive,\" he told Sky Sports.\"The Briton also has a Formula Two campaign to think about, with no points on the board so far due to missing the Jeddah round -- despite taking pole position for the feature race -- while Barbadian Zane Maloney leads the standings with 47.At the same time Haas, who slumped to last overall in 2023 and replaced Guenther Steiner with Japanese engineer Komatsu, scored their first point of the campaign with Nico Hulkenberg finishing 10th.A second Formula One outing in Melbourne in two weeks' time cannot be completely ruled out, however, and depends on Sainz's recovery."},"Leverkusen stay firmly on course with 2-0 win over Wolfsburg":{"img":null,"link":"https://www.reuters.com/sports/soccer/leverkusen-stay-firmly-course-with-2-0-win-over-wolfsburg-2024-03-10/","content":"Florian Wirtz hit the post in the 22nd minute before the visitors went down to 10 men following a second booking for Moritz Jenz six minutes later.Germany international Wirtz made amends for his earlier miss, volleying in their second goal in the 87th to seal their win and set a new club record with a 25th consecutive league game without defeat.LEVERKUSEN, Germany, March 10 (Reuters) - Unbeaten Bayer Leverkusen eased past 10-man VfL Wolfsburg 2-0 on Sunday to restore their 10-point lead at the top of the table and stay firmly on course for a first Bundesliga title.Leverkusen, who had to come from two goals down to rescue a 2-2 draw at Qarabag in Azerbaijan on Thursday, showed no signs of fatigue and it did not take long for the hosts to make the extra man count.Leverkusen are now unbeaten this season across all competitions, stretching their run to 36 games without defeat."},"Tottenham Hotspur thump Aston Villa 4-0 as McGinn sees red":{"img":null,"link":"https://www.reuters.com/sports/soccer/tottenham-hotspur-thump-aston-villa-4-0-mcginn-sees-red-2024-03-10/","content":"Spurs struck twice early in the second half with James Maddison volleying the opener in the 50th minute and Son Heung-min setting up Brennan Johnson to net the second three minutes later after Villa gave the ball away cheaply.With Villa on the ropes, Spurs captain Son swept home the third a minute into stoppage time, and he notched his second assist of the afternoon by setting up substitute Timo Werner to score three minutes later.Villa's decision to start with a five-man backline cost them dearly in the second half as they conceded four times, with John McGinn getting sent off for a violent tackle that will likely incur a three-match ban.BIRMINGHAM, England, March 10 (Reuters) - Tottenham Hotspur hammered 10-man Aston Villa 4-0 in the Premier League on Sunday thanks to four second-half goals, allowing them to close the gap with their Birmingham rivals to two points in the chase for Champions League football next season.Villa had an appeal for a penalty turned down in the 34th minute as Leon Bailey went tumbling under an innocuous challenge from Yves Bissouma, and their only promising chance of the first half came in stoppage time as Lucas Digne sent a looping header just wide from a well-worked corner."},"Talking points from European soccer":{"img":null,"link":"https://www.reuters.com/sports/soccer/talking-points-european-soccer-2024-03-10/","content":"While the league title looks to have slipped away with the team 10 points behind leaders Bayer Leverkusen with nine games left, they still have the Champions League to look forward to.REAL MADRID CEMENT TOP SPOTReal Madrid maintained their seven-point lead over second-placed Girona by crushing Celta Vigo 4-0 on Sunday and Carlo Ancelotti's squad are beginning to look like the title is theirs to lose.Despite the absence of midfielder Jude Bellingham due to a two-match suspension, Real were dominant against Celta with 19-year-old Arda Guler scoring his first goal for the Spanish side, and Vinicius Jr netting his 10th of the season.March 10 (Reuters) - Talking points from the weekend in European soccer leagues:NICE IN A RUTNice's promising start to the season feels like a distant memory as they extended their winless streak to six league matches with a 2-1 loss to Montpellier on Friday.With Harry Kane scoring seemingly at will and the defence that had been leaking goals all season showing signs of stability, the team looks to be finding form after February's announcement of Tuchel's departure."},"Premier League talking points":{"img":null,"link":"https://www.reuters.com/sports/soccer/premier-league-talking-points-2024-03-10/","content":"With Conor Bradley (20) and Harvey Elliott (20) also starting, it was the first time Liverpool had named three players aged 21 or under in a league clash against City since 2015.Five points ahead of Tottenham Hotspur ahead of Sunday's clash, Aston Villa's pursuit of Champions League football for the first time suffered a serious blow as their defensive tactics back-fired, resulting in a 4-0 drubbing for Unai Emery's side.On the face of it, Saturday's 2-0 win over struggling Everton is a run-of-the-mill Premier League victory for Erik ten Hag's Manchester United, but winning thanks to two penalties suggests that all is not yet right at Old Trafford.LONDON, March 10 (Reuters) - Talking points from weekend's Premier League games:When Manchester City's Kevin De Bruyne was substituted after 69 minutes of a rip-roaring contest at Anfield with the game locked at 1-1 and top spot up for grabs there was widespread surprise, not least from the Belgian playmaker.Though Ten Hag will likely chalk it down as one league game of 38, his data analysts may have some strong feedback for him on Monday morning after another underwhelming display."},"Alcaraz, Swiatek advance at Indian Wells":{"img":null,"link":"https://www.reuters.com/sports/tennis/alcaraz-swiatek-advance-indian-wells-2024-03-11/","content":"\"I think the first thing that you have to do if you want to defend the title is you forget about you won the title last year,\" said the 20-year-old.\"Spaniard Alcaraz, who next plays Fabian Marozsan, said one of the keys to defending his title was to put the previous year's victory out of his mind.Alcaraz also said the ankle injury which forced him to withdraw from the Rio Open last month was not an issue during his matches.I don't think about the ankle in matches, in training.INDIAN WELLS, California, March 10 (Reuters) - Defending champion Carlos Alcaraz moved into the fourth round at Indian Wells on Sunday with a 6-2 6-3 win over Felix Auger-Aliassime."},"PSG held 2-2 at home by Reims after Enrique benches Mbappe":{"img":null,"link":"https://www.reuters.com/sports/soccer/psg-held-2-2-home-by-reims-after-enrique-benches-mbappe-2024-03-10/","content":"PARIS, March 10 (Reuters) - Ligue 1 leaders Paris St Germain were held to a 2-2 home draw by Reims on Sunday after PSG boss Luis Enrique benched top scorer Kylian Mbappe, who played only the last 20 minutes.PSG extended their unbeaten run in Ligue 1 to 20 games but it was a third straight draw for the defending champions after Reims impressed despite an own goal.But PSG took little time to get the home crowd going again thanks to an own goal when a corner kick delivery into the box went in off defender Yunis Abdelhamid.Reims shocked the league leaders by taking the lead in the seventh minute to silence the fans at the Parc des Princes after an error from PSG's Achraf Hakimi.Two minutes later, Goncalo Ramos gave PSG the lead when Lee Kang-in's floated ball into the box was not cleared and it fell kindly to the Portuguese forward, who fired home to make it 2-1."},"Hurricanes build big lead, cruise past Flames":{"img":null,"link":"https://www.reuters.com/sports/nhl/hurricanes-build-big-lead-cruise-past-flames-2024-03-11/","content":"Chatfield's sixth goal of the season came 17 seconds into the second period.Hunt put the Flames on the board 4:11 into the second with his third goal, before Carolina cranked up again.After Martinook began the scoring with his 11th goal, Aho's 25th of the season made it 2-0 late in the first period.The Flames had only two shots on goal through the first 20 minutes.Burns notched a goal for the first time in nine games for his 10th of the season, extending the Hurricanes' lead to 5-1."},"Honours even, respect shared, as Klopp and Guardiola Premier League rivalry ends on a high":{"img":null,"link":"https://www.reuters.com/sports/soccer/honours-even-respect-shared-klopp-guardiola-premier-league-rivalry-ends-high-2024-03-10/","content":"\"While Sunday's clash was the last time Klopp and Guardiola will face off for Premier League points, as far as this year's title race is concerned it merely made things even more interesting with Arsenal ahead of Liverpool on goal difference and City one point back.Former Spain midfielder Guardiola has enjoyed mastery over just about every coach in world football since making his name in charge of Barcelona, but will end his Premier League series with Klopp with five wins, four defeats and seven draws.A compelling 1-1 draw between Liverpool and Manchester City left the honours shared, a three-way title race wide open and further proof of the football philosophy that unites two men who have stamped their trademark all over their respective clubs.LIVERPOOL, England, March 10 (Reuters) - And so the curtain came down on one of the greatest Premier League managerial rivalries as Juergen Klopp and Pep Guardiola hugged heartily after their sides had slugged each other to a standstill at Anfield on Sunday.Klopp will walk away at the end of the season after a glittering near decade-long reign on Merseyside that has seen the club scoop every major prize and go head-to-head with Guardiola's City in several epic title races."},"76ers squeeze past Knicks in lowest-scoring game of season":{"img":null,"link":"https://www.reuters.com/sports/basketball/76ers-squeeze-past-knicks-lowest-scoring-game-season-2024-03-11/","content":"5 percent (9 of 40) from 3-point range and had 21 turnovers to finish with the NBA's lowest point total for a game this season.1 percent from the floor and making just 3 of 15 attempts from 3-point range.The Knicks, in turn, made 30 percent of their shots and 5 of 23 attempts from 3-point range while committing 14 turnovers.Brunson scored eight straight points for New York early in the third quarter and added a mid-range jumper to forge a tie at 47 with 5:09 remaining.Order was restored and Reed made a 3-pointer and a reverse layup to give Philadelphia a 75-66 lead with 3:08 remaining in the fourth quarter."},"Lakers get historic night from Anthony Davis, sink Wolves":{"img":null,"link":"https://www.reuters.com/sports/basketball/lakers-get-historic-night-anthony-davis-sink-wolves-2024-03-11/","content":"Los Angeles stormed out to an 83-70 lead with 7:50 remaining in the third quarter before Minnesota fashioned a 15-1 run to go up by one at 85-84.March 11 - Anthony Davis scored 27 points to go along with a season-high 25 rebounds, LeBron James added 29 points and the host Los Angeles Lakers finished off a 120-109 victory over the short-handed Minnesota Timberwolves on Sunday night.7 percent from the floor in the first half but led just 69-68 at the break, in part due to 11 turnovers that the Timberwolves turned into 14 points.The Lakers shot 53 percent from the floor for the game and were 10 of 24 (41.Davis added five assists, seven steals and three blocks to become the first player in NBA history with at least 25 points, 25 rebounds, five assists, five steals and three blocks in a game."},"Cricket-Carey shines as Australia find a way to win in Christchurch":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/ZAGWA36IFVJDNE4FHQ6EO7VDNU.jpg","link":"https://www.reuters.com/sports/cricket/careys-98-drives-australia-victory-christchurch-run-chase-2024-03-11/","content":"\"New Zealand, chasing a first home win over their neighbours in 31 years, had put the tourists on the back foot with four wickets in the last 90 minutes of play on day three.March 11 (Reuters) - Alex Carey scored a magnificent unbeaten 98 to drive Australia to victory over New Zealand by three wickets in a tense conclusion to the second test in Christchurch on Monday, sealing a 2-0 series sweep for the visitors.Wicketkeeper Carey combined with Mitchell Marsh in a match-winning partnership of 140 for the sixth wicket and then teamed up with captain Pat Cummins as Australia chased down their 279-run victory target before tea on day four.\"New Zealand seamer Matt Henry was named Player of the Series for his 17 wickets over the two matches, the first of which finished with Australian victors by 172 runs in Wellington.\"Carey was ultimately denied his second test century but cared little as he and his captain steered their side to their target 281-7 and a sixth win in seven tests over the Australasian summer."},"Women's Top 25 roundup: Caitlin Clark, No. 3 Iowa win Big Ten tourney":{"img":null,"link":"https://www.reuters.com/sports/womens-top-25-roundup-caitlin-clark-no-3-iowa-win-big-ten-tourney-2024-03-11/","content":"Kayla Padilla had 13 points and Rayah Marshall added 10 points and 18 rebounds for Southern Cal (26-5), the tournament's second seed, which won its only other Pac-12 tournament in 2014.River Baldwin powered second-seeded North Carolina State (27-6) with 14 points, while Aziaha James recorded 12 points, six rebounds and a team-high five assists.21 Creighton 46Kelsey Ransom finished with 14 points, six assists and three steals and Alex Cowan added 12 points as the Hoyas knocked off the Bluejays in their Big East Conference tournament semifinal in Uncasville, Conn.Hidalgo also recorded six assists, six rebounds and two steals as fourth-seeded Notre Dame (26-6) won its first ACC tournament title since 2019 and sixth since joining the league in 2013.2 Stanford 61McKenzie Forbes scored 26 points and the Trojans led for all but a few early minutes in defeating the Cardinal in the Pac-12 Conference tournament championship game at Las Vegas."}}