{"Thunder, Mavericks look for more from stars as series opens":{"img":null,"link":"https://www.reuters.com/sports/thunder-mavericks-look-more-stars-series-opens-2024-05-07/","content":"\"That defender, Luguentz Dort, was a big reason Oklahoma City dispatched the Pelicans quickly in the first round and advanced to the second round for the first time since the 2016 run to the Western Conference finals.\"But as they prepare for their Western Conference second-round matchup, which begins Tuesday in Oklahoma City, both teams likely will need more from their top players -- the Thunder's Shai Gilgeous-Alexander and the Mavericks' Luka Doncic.\"Though Hardaway will be back, Dallas will be without reserve power forward/center Maxi Kleber, who suffered a dislocated AC joint in his right shoulder in the series-clinching Game 6 win over the Clippers, and Olivier-Maxence Prosper, who suffered an ankle injury early in the first-round series.8 rebounds in the Mavericks' 4-2 first-round series win over the Clippers, but he shot just 40."},"Braves face Red Sox looking to get back on track":{"img":null,"link":"https://www.reuters.com/sports/braves-face-red-sox-looking-get-back-track-2024-05-06/","content":"The Braves open a two-game home series on Tuesday against the Boston Red Sox after they lost five of their last six games and were swept in a three-game series over the weekend by the surging Los Angeles Dodgers.The Red Sox won three of four games against the Braves last season and split the two that were played at Atlanta one year ago this week.But Acuna did hit a home run Friday, with his first three-hit game of the season Saturday.In his most recent outing Tuesday at Seattle, he took a loss after giving up a season-high three runs on six hits, two walks and seven strikeouts in five innings."},"Mavericks sign coach Jason Kidd to extension":{"img":null,"link":"https://www.reuters.com/sports/mavericks-sign-coach-jason-kidd-extension-2024-05-06/","content":"Kidd, 51, is 140-106 in three seasons leading the Mavs, who are set to play the Oklahoma City Thunder in the Western Conference semifinals starting Tuesday.\"We are excited to have Coach Kidd continue to lead our team throughout the coming years with this well-earned contract extension,\" Mavericks governor Patrick Dumont said in a statement.Kidd led the Mavericks to the Western Conference finals in 2022.\"Kidd led our team to two playoff appearances in three seasons, and we are looking forward to his leadership in continuing to build and grow this already great franchise.\""},"Guardians place AL batting leader Steven Kwan (hamstring) on IL":{"img":null,"link":"https://www.reuters.com/sports/guardians-place-al-batting-leader-steven-kwan-hamstring-il-2024-05-06/","content":"May 6 - The Cleveland Guardians placed American League batting leader Steven Kwan on the 10-day injured list with a left hamstring strain and selected the contract of top prospect Kyle Manzardo among multiple moves Monday.The leadoff batter was injured while making a play in the outfield Saturday against the Los Angeles Angels and left that game after three innings.Hentges, 27, was 1-0 with no runs allowed, two hits, three walks and seven strikeouts in 6 2/3 innings over six games (three starts) between Columbus and Double-A Akron.He had been on the injured list since March with swelling in his left middle finger."},"Jets coach Rick Bowness announces retirement":{"img":null,"link":"https://www.reuters.com/sports/jets-coach-rick-bowness-announces-retirement-2024-05-06/","content":"Bowness, 69, was named a Jack Adams Award finalist this season for the first time in his 14 years as a head coach.Bowness led the Dallas Stars to the Stanley Cup Final in 2020 as interim head coach.May 6 - Winnipeg Jets head coach Rick Bowness announced his retirement Monday after nearly 50 years in the NHL as a player and coach.\"(My wife) Judy and I were all set to call it a day (two years ago), but if I was going to come back to coaching, I couldn't have picked a better place to come back to and to finish my career,\" Bowness said."},"MLB roundup: Red Sox extinguish Twins' 12-game win streak":{"img":null,"link":"https://www.reuters.com/sports/mlb-roundup-red-sox-extinguish-twins-12-game-win-streak-2024-05-06/","content":"Dodgers 5, Braves 1Shohei Ohtani hit two home runs, Teoscar Hernandez also went deep and left-hander James Paxton pitched into the seventh inning as host Los Angeles finished off a three-game sweep of Atlanta.Jake Diekman (1-1) allowed two runs (one earned) on one hit in the extra inning for New York, which has lost three straight and five of its past seven.Marcell Ozuna hit a home run and Max Fried (2-1) gave up four runs on four hits over seven innings after delivering a complete-game shutout and six no-hit innings in his previous two starts.Marlins 12, Athletics 3Nick Gordon collected two singles, a double and a home run, drove in three runs and scored twice as Miami avoided an interleague series sweep at the hands of host Oakland."},"Aberg withdraws from Quail Hollow with knee issue":{"img":null,"link":"https://www.reuters.com/sports/golf/aberg-withdraws-quail-hollow-with-knee-issue-2024-05-06/","content":"May 6 (Reuters) - Swedish sensation Ludvig Aberg, who finished solo second in his Masters debut last month, withdrew on Monday from this week's PGA Tour event with a knee issue but expects to return in time for next week's PGA Championship.Aberg's runner-up finish at Augusta National, where he made his major championship debut, was the best by a Swede at the Masters.\"Unfortunately, I'm dealing with a knee issue and after consulting with my doctors, we think it's best that I take some additional time to rest,\" Aberg said in a statement released by the PGA Tour.World number six Aberg was set to make his Quail Hollow debut in Charlotte, North Carolina where a field headlined by world number two Rory McIlroy are competing in the final tune-up ahead of the May 16-19 PGA Championship."},"Rublev to return to hospital after taking Madrid title":{"img":null,"link":"https://www.reuters.com/sports/tennis/rublev-return-hospital-after-taking-madrid-title-2024-05-06/","content":"Rublev, who came into the Madrid tournament in poor form having lost his previous four matches on the tour, eliminated second seed and home favourite Carlos Alcaraz and also beat American Taylor Fritz to reach the final.May 5 (Reuters) - Andrey Rublev battled through a suspected virus and an anaesthetised foot to beat Felix Auger-Aliassime 4-6 7-5 7-5 to claim the Madrid Open title on Sunday, but revealed that he will now have to return to hospital to make a full recovery.\"The seventh seed added that he needed an anaesthetic to play the final.\"\"I'm still sick and tomorrow I think I'll go back to the hospital for a full check-up to know exactly what's going on,\" Rublev told a news conference.\""},"Donovan Mitchell-led Cavaliers rally from 18 down, win series over Magic":{"img":null,"link":"https://www.reuters.com/sports/donovan-mitchell-led-cavaliers-rally-18-down-win-series-over-magic-2024-05-05/","content":"scored 13 points and Jalen Suggs had 10 points and nine rebounds for the fifth-seeded Magic, who mustered just 15 points in the third quarter.The Cavaliers shaved an 18-point deficit to 10 at halftime before Mitchell erupted for 17 points in the third quarter, capped by a driving layup to stake Cleveland to a 68-66 lead with 3:08 left.Mitchell, who scored 17 points in the third quarter, made 15 of 17 free-throw attempts and added nine rebounds.May 5 - Donovan Mitchell scored 39 points to fuel the host Cleveland Cavaliers to the Eastern Conference semifinals with a 106-94 victory over the Orlando Magic on Sunday in Game 7 of their first-round series."},"Tsitsidosa era ends as Badosa announces split with Tsitsipas":{"img":null,"link":"https://www.reuters.com/sports/tennis/tsitsidosa-era-ends-badosa-announces-split-with-tsitsipas-2024-05-06/","content":"He won the Monte Carlo Masters and finished runner-up in Barcelona to prime himself for the French Open which will begin on May 26.Badosa and Tsitsipas made their relationship official on social media during last year's French Open and have often been seen at each other's matches, while also posting pictures on their joint Instagram account.\"Former French Open quarter-finalist Badosa said recently that doctors had told her it would be complicated to continue her career because of her chronic back pain.May 6 (Reuters) - Former world number two Paula Badosa is no longer in a romantic relationship with fellow tennis player Stefanos Tsitsipas after nearly a year together in the spotlight, the Spaniard said."},"Sinner to play in French Open only if 100% fit":{"img":null,"link":"https://www.reuters.com/sports/tennis/sinner-play-french-open-only-if-100-fit-2024-05-06/","content":"Sinner sustained the injury at Madrid and pulled out of his quarter-final against Canada's Felix Auger-Aliassime last week, before the Italian decided to skip the Rome tournament which runs from May 8-19.May 6 (Reuters) - Jannik Sinner has cast doubt on his French Open participation, with the world number two saying he will only compete at Roland Garros later this month if he fully recovers from a hip issue that forced him out of Madrid and Rome.\"At Roland Garros, I'll only play if I'm 100%, if there's any doubt we have to see,\" Sinner told reporters.\"\"Sinner said he could prioritise his health over the year's second Grand Slam, which begins on May 26.\""},"Rublev downs Auger-Aliassime to win Madrid Open title":{"img":null,"link":"https://www.reuters.com/sports/tennis/rublev-downs-auger-aliassime-win-madrid-open-title-2024-05-05/","content":"May 5 (Reuters) - Andrey Rublev overcame an opening set wobble to beat Felix Auger-Aliassime 4-6 7-5 7-5 in the final of the Madrid Open on Sunday to win his second Masters 1000 title.Auger-Aliassime was chasing his first ever Masters title and looked well set for victory before a resurgent Rublev, who had been struggling with a fever during the tournament, recovered to prevail in a little under three hours.Auger-Aliassime was under pressure as he served to stay in the contest but he made two double faults, the second handing the title to Rublev in an anti-climactic end to the final.The seventh seed fought back and managed to break Auger-Aliassime but the Canadian was well in control by then, serving well to make optimal use of his strong forehand before sealing the opening set on serve with a resounding winner at the net."},"Inoue knocks out Nery to defend unified super bantamweight title":{"img":null,"link":"https://www.reuters.com/sports/inoue-knocks-out-nery-defend-unified-super-bantamweight-title-2024-05-06/","content":"Nery's left hook knocked down Inoue for the first time in his career, but the 31-year-old got back up and knocked Nery down in the second round with his own left hook to regain momentum.Another left hook from Inoue dropped Nery in the fifth before a right hand finished the bout in the next round, ensuring Inoue retained his WBC, WBO, WBA and IBF belts in front of a sold out home crowd.May 6 (Reuters) - Undefeated Japanese boxer Naoya Inoue survived a first round knockdown to knock out challenger Luis Nery in the sixth and defend his undisputed super bantamweight world championship at the Tokyo Dome on Monday.Mexico's Nery suffered the second knockout of his professional career, and fell to 35-2."},"Wolves wrestle home-court advantage from Nuggets with Game 1 win":{"img":null,"link":"https://www.reuters.com/sports/wolves-wrestle-home-court-advantage-nuggets-with-game-1-win-2024-05-05/","content":"Edwards, who had 25 points in the first half, hit a driving layup through traffic and a pullup 18-footer to put the Timberwolves back in front.Conley hit his third 3-pointer of the game to give Minnesota an 80-77 lead, but Murray answered from deep and was fouled by Towns.Minnesota jumped out to an 18-4 lead with 5:12 left in the first quarter, but the Nuggets turned up the defense.May 5 - Anthony Edwards scored 43 points, Karl-Anthony Towns finished with 20 and the visiting Minnesota Timberwolves took home-court advantage from Denver with a 106-99 win over the Nuggets in Game 1 of a Western Conference semifinal series on Saturday night."},"Red Sox snap Twins' 12-game winning streak":{"img":null,"link":"https://www.reuters.com/sports/red-sox-snap-twins-12-game-winning-streak-2024-05-05/","content":"Moments after Grissom's first hit, Smith belted a two-run double to left field.May 5 - Ceddanne Rafaela and Rafael Devers each hit two-run home runs, and the Boston Red Sox pulled away for a 9-2 win over the Minnesota Twins on Sunday afternoon in Minneapolis.Ryan Jeffers hit a solo home run for Minnesota, whose 12-game winning streak ended.Jeffers hit a solo shot to left-center field for his sixth homer of the season."},"Knicks' Jalen Brunson, Pacers' Rick Carlisle have history as series begins":{"img":null,"link":"https://www.reuters.com/sports/knicks-jalen-brunson-pacers-rick-carlisle-have-history-series-begins-2024-05-05/","content":"Hard to imagine Brunson needs any extra motivation as he leads the New York Knicks into the opening game of the Eastern Conference second-round series against the visiting Pacers on Monday night.Brunson is a bona fide star in his second season in New York but that wasn't the case when he was a member of the Mavericks, who faced the Los Angeles Clippers during the first round of the 2021 playoffs.Sixth-seeded Indiana eliminated the third-seeded Milwaukee Bucks in the first round, while the second-seeded Knicks ousted the seventh-seeded Philadelphia 76ers in their opening series.3 ppg in the regular season) in this series, while the Knicks are stingy, ranking second in scoring defense at 108."},"Leafs' Auston Matthews first-time finalist for Selke Trophy":{"img":null,"link":"https://www.reuters.com/sports/leafs-auston-matthews-first-time-finalist-selke-trophy-2024-05-05/","content":"Staal, 35, is seeking to become the first member of the Carolina Hurricanes to win the Selke award since the team's current coach, Rod Brind'Amour, won following the 2006-07 season.Staal is a two-time finalist, first being named in the 2009-10 season as a member of the Pittsburgh Penguins.The Bruins eliminated the Maple Leafs (46-26-10) from the playoffs with their Game 7 first-round win on Saturday.Should Matthews, 26, win the Selke Trophy, he'd be the first Toronto player to win the award since Doug Gilmour in 1992-93."},"J.J. Watt leaves door open (slightly) for potential return to Texans":{"img":null,"link":"https://www.reuters.com/sports/jj-watt-leaves-door-open-slightly-potential-return-texans-2024-05-05/","content":"I told (former teammate and current Texans coach DeMeco Ryans) last year, I said, ‘Don't call unless you absolutely need it, but if you ever do call, I'll be there.This is the last year I'll tell him that, because I'm not going to keep training the way I've been training, but he knows that if he ever truly does need it, I'll be there for him.Watt is a three-time NFL Defensive Player of the Year, five-time All-Pro and five-time Pro Bowl selection.Watt, who announced his retirement after the 2022 season, said at his charity softball game on Saturday in Houston that he'd suit up for the Texans if he was truly needed."},"Stars host Golden Knights in Game 7: 'Nothing better'":{"img":null,"link":"https://www.reuters.com/sports/stars-host-golden-knights-game-7-nothing-better-2024-05-05/","content":"May 5 - After missing a chance to eliminate the defending Stanley Cup champions in a tightly contested Game 6 on Friday, Dallas Stars coach Peter DeBoer was already looking forward to Sunday's home showdown with the Vegas Golden Knights.\"This is exactly the spot you want to be in, playing to advance, one game at home, and let it fly.\"\"The Stars secured home ice for the deciding game in this first-round series by earning the top seed in the Western Conference with 113 points, proving that the regular season does actually mean something when it comes to the playoffs.\"\"Dallas' Radek Faksa will return for Sunday's game after being sidelined with an undisclosed injury since the third period of Game 2."}}