{"Rublev to return to hospital after taking Madrid title":{"img":null,"link":"https://www.reuters.com/sports/tennis/rublev-return-hospital-after-taking-madrid-title-2024-05-06/","content":"May 5 (Reuters) - Andrey Rublev battled through a suspected virus and an anaesthetised foot to beat Felix Auger-Aliassime 4-6 7-5 7-5 to claim the Madrid Open title on Sunday, but revealed that he will now have to return to hospital to make a full recovery.Rublev, who came into the Madrid tournament in poor form having lost his previous four matches on the tour, eliminated second seed and home favourite Carlos Alcaraz and also beat American Taylor Fritz to reach the final.\"I'm still sick and tomorrow I think I'll go back to the hospital for a full check-up to know exactly what's going on,\" Rublev told a news conference.\"\"The seventh seed added that he needed an anaesthetic to play the final.\""},"Tsitsidosa era ends as Badosa announces split with Tsitsipas":{"img":null,"link":"https://www.reuters.com/sports/tennis/tsitsidosa-era-ends-badosa-announces-split-with-tsitsipas-2024-05-06/","content":"He won the Monte Carlo Masters and finished runner-up in Barcelona to prime himself for the French Open which will begin on May 26.\"Former French Open quarter-finalist Badosa said recently that doctors had told her it would be complicated to continue her career because of her chronic back pain.Badosa and Tsitsipas made their relationship official on social media during last year's French Open and have often been seen at each other's matches, while also posting pictures on their joint Instagram account.May 6 (Reuters) - Former world number two Paula Badosa is no longer in a romantic relationship with fellow tennis player Stefanos Tsitsipas after nearly a year together in the spotlight, the Spaniard said."},"Sinner to play in French Open only if 100% fit":{"img":null,"link":"https://www.reuters.com/sports/tennis/sinner-play-french-open-only-if-100-fit-2024-05-06/","content":"May 6 (Reuters) - Jannik Sinner has cast doubt on his French Open participation, with the world number two saying he will only compete at Roland Garros later this month if he fully recovers from a hip issue that forced him out of Madrid and Rome.\"At Roland Garros, I'll only play if I'm 100%, if there's any doubt we have to see,\" Sinner told reporters.\"Sinner sustained the injury at Madrid and pulled out of his quarter-final against Canada's Felix Auger-Aliassime last week, before the Italian decided to skip the Rome tournament which runs from May 8-19.\"Sinner said he could prioritise his health over the year's second Grand Slam, which begins on May 26.\""},"Donovan Mitchell-led Cavaliers rally from 18 down, win series over Magic":{"img":null,"link":"https://www.reuters.com/sports/donovan-mitchell-led-cavaliers-rally-18-down-win-series-over-magic-2024-05-05/","content":"scored 13 points and Jalen Suggs had 10 points and nine rebounds for the fifth-seeded Magic, who mustered just 15 points in the third quarter.The Cavaliers shaved an 18-point deficit to 10 at halftime before Mitchell erupted for 17 points in the third quarter, capped by a driving layup to stake Cleveland to a 68-66 lead with 3:08 left.Mitchell, who scored 17 points in the third quarter, made 15 of 17 free-throw attempts and added nine rebounds.May 5 - Donovan Mitchell scored 39 points to fuel the host Cleveland Cavaliers to the Eastern Conference semifinals with a 106-94 victory over the Orlando Magic on Sunday in Game 7 of their first-round series."},"Red Sox snap Twins' 12-game winning streak":{"img":null,"link":"https://www.reuters.com/sports/red-sox-snap-twins-12-game-winning-streak-2024-05-05/","content":"Moments after Grissom's first hit, Smith belted a two-run double to left field.May 5 - Ceddanne Rafaela and Rafael Devers each hit two-run home runs, and the Boston Red Sox pulled away for a 9-2 win over the Minnesota Twins on Sunday afternoon in Minneapolis.Ryan Jeffers hit a solo home run for Minnesota, whose 12-game winning streak ended.Jeffers hit a solo shot to left-center field for his sixth homer of the season."},"Wolves wrestle home-court advantage from Nuggets with Game 1 win":{"img":null,"link":"https://www.reuters.com/sports/wolves-wrestle-home-court-advantage-nuggets-with-game-1-win-2024-05-05/","content":"Conley hit his third 3-pointer of the game to give Minnesota an 80-77 lead, but Murray answered from deep and was fouled by Towns.Minnesota jumped out to an 18-4 lead with 5:12 left in the first quarter, but the Nuggets turned up the defense.Edwards, who had 25 points in the first half, hit a driving layup through traffic and a pullup 18-footer to put the Timberwolves back in front.May 5 - Anthony Edwards scored 43 points, Karl-Anthony Towns finished with 20 and the visiting Minnesota Timberwolves took home-court advantage from Denver with a 106-99 win over the Nuggets in Game 1 of a Western Conference semifinal series on Saturday night."},"Rublev downs Auger-Aliassime to win Madrid Open title":{"img":null,"link":"https://www.reuters.com/sports/tennis/rublev-downs-auger-aliassime-win-madrid-open-title-2024-05-05/","content":"May 5 (Reuters) - Andrey Rublev overcame an opening set wobble to beat Felix Auger-Aliassime 4-6 7-5 7-5 in the final of the Madrid Open on Sunday to win his second Masters 1000 title.Auger-Aliassime was chasing his first ever Masters title and looked well set for victory before a resurgent Rublev, who had been struggling with a fever during the tournament, recovered to prevail in a little under three hours.The seventh seed fought back and managed to break Auger-Aliassime but the Canadian was well in control by then, serving well to make optimal use of his strong forehand before sealing the opening set on serve with a resounding winner at the net.Auger-Aliassime was under pressure as he served to stay in the contest but he made two double faults, the second handing the title to Rublev in an anti-climactic end to the final."},"Knicks' Jalen Brunson, Pacers' Rick Carlisle have history as series begins":{"img":null,"link":"https://www.reuters.com/sports/knicks-jalen-brunson-pacers-rick-carlisle-have-history-series-begins-2024-05-05/","content":"Hard to imagine Brunson needs any extra motivation as he leads the New York Knicks into the opening game of the Eastern Conference second-round series against the visiting Pacers on Monday night.Sixth-seeded Indiana eliminated the third-seeded Milwaukee Bucks in the first round, while the second-seeded Knicks ousted the seventh-seeded Philadelphia 76ers in their opening series.Brunson is a bona fide star in his second season in New York but that wasn't the case when he was a member of the Mavericks, who faced the Los Angeles Clippers during the first round of the 2021 playoffs.3 ppg in the regular season) in this series, while the Knicks are stingy, ranking second in scoring defense at 108."},"Leafs' Auston Matthews first-time finalist for Selke Trophy":{"img":null,"link":"https://www.reuters.com/sports/leafs-auston-matthews-first-time-finalist-selke-trophy-2024-05-05/","content":"Staal, 35, is seeking to become the first member of the Carolina Hurricanes to win the Selke award since the team's current coach, Rod Brind'Amour, won following the 2006-07 season.Staal is a two-time finalist, first being named in the 2009-10 season as a member of the Pittsburgh Penguins.The Bruins eliminated the Maple Leafs (46-26-10) from the playoffs with their Game 7 first-round win on Saturday.Matthews, a first-time Selke finalist, also is a finalist for the Lady Byng Trophy, given for both skill and gentlemanly play on the ice."},"J.J. Watt leaves door open (slightly) for potential return to Texans":{"img":null,"link":"https://www.reuters.com/sports/jj-watt-leaves-door-open-slightly-potential-return-texans-2024-05-05/","content":"I told (former teammate and current Texans coach DeMeco Ryans) last year, I said, ‘Don't call unless you absolutely need it, but if you ever do call, I'll be there.Watt is a three-time NFL Defensive Player of the Year, five-time All-Pro and five-time Pro Bowl selection.This is the last year I'll tell him that, because I'm not going to keep training the way I've been training, but he knows that if he ever truly does need it, I'll be there for him.Watt, who announced his retirement after the 2022 season, said at his charity softball game on Saturday in Houston that he'd suit up for the Texans if he was truly needed."},"Stars host Golden Knights in Game 7: 'Nothing better'":{"img":null,"link":"https://www.reuters.com/sports/stars-host-golden-knights-game-7-nothing-better-2024-05-05/","content":"May 5 - After missing a chance to eliminate the defending Stanley Cup champions in a tightly contested Game 6 on Friday, Dallas Stars coach Peter DeBoer was already looking forward to Sunday's home showdown with the Vegas Golden Knights.\"The Stars secured home ice for the deciding game in this first-round series by earning the top seed in the Western Conference with 113 points, proving that the regular season does actually mean something when it comes to the playoffs.\"\"This is exactly the spot you want to be in, playing to advance, one game at home, and let it fly.\"\"Dallas' Radek Faksa will return for Sunday's game after being sidelined with an undisclosed injury since the third period of Game 2."},"MLB roundup: A's hang 20 runs on Marlins":{"img":null,"link":"https://www.reuters.com/sports/mlb-roundup-as-hang-20-runs-marlins-2024-05-05/","content":"Blue Jays 6, Nationals 3Kevin Gausman pitched into the sixth inning, Kevin Kiermaier hit a two-run homer and Toronto ended a three-game losing streak with a win against host Washington.Ha-Seong Kim smacked a three-run homer and Jurickson Profar hit a two-run blast, both during an eight-run seventh inning for the Padres, who have outscored the Diamondbacks 20-2 while winning the first two contests of the three-game series.The A's batted around in a game-changing third inning, where they scored 10 runs on eight hits, including three home runs, to put the game out of reach early and extend their winning streak to six games.Korey Lee hit a game-tying two-run single in the sixth inning for the White Sox, who snapped their four-game losing streak."},"Bruins end Leafs' season with OT win in Game 7":{"img":null,"link":"https://www.reuters.com/sports/bruins-end-leafs-season-with-ot-win-game-7-2024-05-05/","content":"May 5 - David Pastrnak scored 1:54 into overtime as the Boston Bruins beat the visiting Toronto Maple Leafs 2-1 on Saturday night in Game 7 of an Eastern Conference first-round playoff series.Jeremy Swayman made 30 saves for Boston, which has now won seven consecutive playoff series against Toronto dating back to 1969 and will meet the Florida Panthers in the second round.Boston combined for just three first-period shots in Games 5 and 6, but it got off to a much better start on Saturday, outshooting the Maple Leafs 11-9 through the first 20 minutes of action.After Boston defenseman Brandon Carlo slipped and lost the puck in the corner, Auston Matthews -- who returned from a two-game absence (illness) -- picked it up and dished it to an open Nylander for him to deposit into the back of the net."},"Magic's Gary Harris to play in Game 7, Cavs' Jarrett Allen ruled out":{"img":null,"link":"https://www.reuters.com/sports/magics-gary-harris-play-game-7-cavs-jarrett-allen-ruled-out-2024-05-05/","content":"May 5 - Orlando Magic starting guard Gary Harris is available to play in Sunday's decisive Game 7 of the Eastern Conference first-round series against the host Cleveland Cavaliers, coach Jamahl Mosley said.Harris sat out Orlando's 103-96 victory over Cleveland in Game 6 on Friday due to a right hamstring strain.Like Harris, Cleveland All-Star center Jarrett Allen had been listed as questionable on the NBA injury report.He sustained the injury in the Magic's 104-103 loss to the Cavaliers in Game 5 on Tuesday."},"Pogacar powers into Maglia Rosa with Giro stage win":{"img":null,"link":"https://www.reuters.com/sports/cycling/pogacar-powers-into-maglia-rosa-with-giro-stage-win-2024-05-05/","content":"May 5 (Reuters) - Race favourite Tadej Pogacar made light of a mechanical problem to blast into the lead of the Giro d'Italia with victory on the summit finish to the 161km second stage on Sunday.No one could stay with the UAE Team Emirates rider who poured on the power to win by 27 seconds and take possession of the Maglia Rosa two days into his maiden Giro.Dani Martinez (BORA-Hansgrohe) was second just ahead of Ineos Grenadiers leader Geraint Thomas.The Slovenian suffered a puncture at the foot of the steep 11km climb to Santuario di Oropa but he was helped back into the group by his team mates before launching a devastating solo attack."},"Sabalenka takes positives from Madrid Open defeat to Swiatek":{"img":null,"link":"https://www.reuters.com/sports/tennis/sabalenka-takes-positives-madrid-open-defeat-swiatek-2024-05-05/","content":"May 5 (Reuters) - Aryna Sabalenka said she was encouraged by the level of her performances in the Madrid Open despite her defeat to world number one Iga Swiatek in the final on Saturday.However, she looked in fine fettle in Madrid, claiming wins over former Wimbledon champion Elena Rybakina and Miami Open winner Danielle Collins, before pushing Swiatek to the limit in the final.Sabalenka, who lost 7-5 4-6 7-6(7) in the gripping final, has struggled in recent months, winning just four matches in the four tournaments that followed her Australian Open title defence in January.I think after the Australian Open, I struggled for a couple of months."},"Flavor Flav backs US women's water polo team on road to Paris":{"img":null,"link":"https://www.reuters.com/sports/flavor-flav-backs-us-womens-water-polo-team-road-paris-2024-05-05/","content":"Veteran Maggie Steffens led the Americans to a stunning third consecutive Olympic title in Tokyo but said this weekend that she and her team mates are still in need of financial support ahead of the Games.\"The all-time Olympic scoring record-holder Steffens, who is currently at test event in Paris, has long called for greater support and recognition for her sport.\"NEW YORK, May 5 (Reuters) - Hall of Fame rapper Flavor Flav is throwing his support behind the United States women's water polo team, pledging to back the defending champions at the Paris Olympics.Olympians around the world have long relied on outside financial support to pursue their dreams, with many spending more to train and compete than they earn from their sport."},"Alvarez retains titles with unanimous victory over Munguia":{"img":null,"link":"https://www.reuters.com/sports/alvarez-retains-titles-with-unanimous-victory-over-munguia-2024-05-05/","content":"I'm the best fighter right now, for sure.That's why I'm the best.\"Jaime Munguia is a great fighter."},"Cavs, Magic set for decisive Game 7 in Cleveland":{"img":null,"link":"https://www.reuters.com/sports/cavs-magic-set-decisive-game-7-cleveland-2024-05-04/","content":"Home cooking has proven beneficial for the hosts, as each team has won all three contests on its home floor heading into Game 7 on Sunday afternoon in Cleveland.\"Orlando has its own injury to address, as starting shooting guard Gary Harris sat out Friday after sustaining a right hamstring injury in Game 5.\"Orlando held serve Friday night to set up its first Game 7 since the 2009 playoffs.As a result, the Cavaliers were able to lock up the fourth seed in the Eastern Conference -- and more importantly, home-court advantage for their first-round series with the Magic."}}