{"Sabalenka takes positives from Madrid Open defeat to Swiatek":{"img":null,"link":"https://www.reuters.com/sports/tennis/sabalenka-takes-positives-madrid-open-defeat-swiatek-2024-05-05/","content":"May 5 (Reuters) - Aryna Sabalenka said she was encouraged by the level of her performances in the Madrid Open despite her defeat to world number one Iga Swiatek in the final on Saturday.However, she looked in fine fettle in Madrid, claiming wins over former Wimbledon champion Elena Rybakina and Miami Open winner Danielle Collins, before pushing Swiatek to the limit in the final.Sabalenka, who lost 7-5 4-6 7-6(7) in the gripping final, has struggled in recent months, winning just four matches in the four tournaments that followed her Australian Open title defence in January.I think after the Australian Open, I struggled for a couple of months."},"J.J. Watt leaves door open (slightly) for potential return to Texans":{"img":null,"link":"https://www.reuters.com/sports/jj-watt-leaves-door-open-slightly-potential-return-texans-2024-05-05/","content":"I told (former teammate and current Texans coach DeMeco Ryans) last year, I said, ‘Don't call unless you absolutely need it, but if you ever do call, I'll be there.Watt is a three-time NFL Defensive Player of the Year, five-time All-Pro and five-time Pro Bowl selection.This is the last year I'll tell him that, because I'm not going to keep training the way I've been training, but he knows that if he ever truly does need it, I'll be there for him.Houston bolstered its pass-rushing group by signing Danielle Hunter and Denico Autry, who last season recorded 16."},"Bruins end Leafs' season with OT win in Game 7":{"img":null,"link":"https://www.reuters.com/sports/bruins-end-leafs-season-with-ot-win-game-7-2024-05-05/","content":"May 5 - David Pastrnak scored 1:54 into overtime as the Boston Bruins beat the visiting Toronto Maple Leafs 2-1 on Saturday night in Game 7 of an Eastern Conference first-round playoff series.Jeremy Swayman made 30 saves for Boston, which has now won seven consecutive playoff series against Toronto dating back to 1969 and will meet the Florida Panthers in the second round.Boston combined for just three first-period shots in Games 5 and 6, but it got off to a much better start on Saturday, outshooting the Maple Leafs 11-9 through the first 20 minutes of action.After Boston defenseman Brandon Carlo slipped and lost the puck in the corner, Auston Matthews -- who returned from a two-game absence (illness) -- picked it up and dished it to an open Nylander for him to deposit into the back of the net."},"Pogacar powers into Maglia Rosa with Giro stage win":{"img":null,"link":"https://www.reuters.com/sports/cycling/pogacar-powers-into-maglia-rosa-with-giro-stage-win-2024-05-05/","content":"May 5 (Reuters) - Race favourite Tadej Pogacar made light of a mechanical problem to blast into the lead of the Giro d'Italia with victory on the summit finish to the 161km second stage on Sunday.Dani Martinez (BORA-Hansgrohe) was second just ahead of Ineos Grenadiers leader Geraint Thomas.No one could stay with the UAE Team Emirates rider who poured on the power to win by 27 seconds and take possession of the Maglia Rosa two days into his maiden Giro.The Slovenian suffered a puncture at the foot of the steep 11km climb to Santuario di Oropa but he was helped back into the group by his team mates before launching a devastating solo attack."},"Magic's Gary Harris to play in Game 7, Cavs' Jarrett Allen ruled out":{"img":null,"link":"https://www.reuters.com/sports/magics-gary-harris-play-game-7-cavs-jarrett-allen-ruled-out-2024-05-05/","content":"May 5 - Orlando Magic starting guard Gary Harris is available to play in Sunday's decisive Game 7 of the Eastern Conference first-round series against the host Cleveland Cavaliers, coach Jamahl Mosley said.Harris sat out Orlando's 103-96 victory over Cleveland in Game 6 on Friday due to a right hamstring strain.Like Harris, Cleveland All-Star center Jarrett Allen had been listed as questionable on the NBA injury report.The winner of Sunday's game will face the top-seeded Boston Celtics in the conference semifinals."},"Alvarez retains titles with unanimous victory over Munguia":{"img":null,"link":"https://www.reuters.com/sports/alvarez-retains-titles-with-unanimous-victory-over-munguia-2024-05-05/","content":"Alvarez, who received scores of 117-110, 116-111 and 115-112 from the three judges to seal the win, sent his opponent to the canvas in the fourth round, the first knockdown of Munguia's career.It was Alvarez's fourth time defending his WBC, WBO, IBF and WBA super middleweight titles.I did really good and I feel proud about it,\" Alvarez said after handing Munguia the first defeat of his professional career.\"Saturday's fight, which bettered Alvarez's record to 61-2-2, was the 33-year-old's first since beating American Jermell Charlo last year."},"Cavs, Magic set for decisive Game 7 in Cleveland":{"img":null,"link":"https://www.reuters.com/sports/cavs-magic-set-decisive-game-7-cleveland-2024-05-04/","content":"Home cooking has proven beneficial for the hosts, as each team has won all three contests on its home floor heading into Game 7 on Sunday afternoon in Cleveland.\"Orlando has its own injury to address, as starting shooting guard Gary Harris sat out Friday after sustaining a right hamstring injury in Game 5.\"As a result, the Cavaliers were able to lock up the fourth seed in the Eastern Conference -- and more importantly, home-court advantage for their first-round series with the Magic.Orlando held serve Friday night to set up its first Game 7 since the 2009 playoffs."},"Anthony Rizzo stays hot as Yankees get past Tigers":{"img":null,"link":"https://www.reuters.com/sports/anthony-rizzo-stays-hot-yankees-get-past-tigers-2024-05-04/","content":"The Yankees have won the first two games of the three-game series and three of the last four overall.Clarke Schmidt (3-1) earned the win after allowing three runs on four hits over five innings with no walks and seven strikeouts.May 4 - Anthony Rizzo continues to deliver offensively Saturday afternoon, with a three-run home run to cap a four-run third inning that lifted the host New York Yankees to a 5-3 victory over the Detroit Tigers.A trio of relievers combined to blank the Tigers on three hits over the final four innings."},"Canucks edge Preds 1-0 on late goal, reach West semifinals":{"img":null,"link":"https://www.reuters.com/sports/canucks-edge-preds-1-0-late-goal-reach-west-semifinals-2024-05-04/","content":"Nashville, which failed to score even one power-play goal on home ice during the series, wasted one such opportunity in the second period.\"It was the second consecutive game of the series with no scoring in the first two periods, in big part due to the close-checking style both clubs used as well as the netminders.From the end boards, Brock Boeser fired a no-look pass to the front of the net, and Suter converted the one-timer for his second goal of the series.May 4 - Pius Suter's goal with 99 seconds remaining in regulation was the difference as the visiting Vancouver Canucks claimed a 1-0 victory over the Nashville Predators on Friday night and clinched their Western Conference first-round series."},"Lakers G D'Angelo Russell fined $25K for verbal abuse":{"img":null,"link":"https://www.reuters.com/sports/lakers-g-dangelo-russell-fined-25k-verbal-abuse-2024-05-04/","content":"Russell finished the 108-106 loss to the Nuggets with 14 points on 6-of-15 shooting, six assists and one rebound.May 4 - The NBA fined Los Angeles Lakers guard D'Angelo Russell $25,000 on Saturday for verbally abusing a game official.His actions occurred on the court after the Lakers' season-ending Game 5 loss at Denver on Monday night, the league said.Russell, 28, averaged 18."},"Biden gives Katie Ledecky, Michelle Yeoh the Medal of Freedom":{"img":null,"link":"https://www.reuters.com/world/us/biden-honor-olympian-katie-ledecky-actor-michelle-yeoh-with-medal-freedom-2024-05-03/","content":"WASHINGTON, May 3 (Reuters) - A winner of seven Olympic gold medals, a leader of the Mississippi civil rights struggle and a pioneer of television's tabloid talk show genre are part of this year's class of Presidential Medal of Freedom recipients.Also included are several one-time presidential candidates, former Senator Elizabeth Dole, former Vice President Al Gore, one-time Secretary of State John Kerry and previous New York City Mayor Michael Bloomberg.Biden also celebrated some key political allies in the Democratic Party, from Representative Jim Clyburn, who rescued his 2020 presidential primary bid with an endorsement in South Carolina, to Nancy Pelosi, who shepherded his legislative agenda through Congress as House of Representatives speaker until last year.The honoree list plays special homage to \"firsts\" in their field, including the \"Everything Everywhere All at Once\" actress Michelle Yeoh, who was the first Asian to win the Academy Award for Best Actress; Ellen Ochoa, the first Hispanic woman in space; and Jim Thorpe, the versatile athlete who became the first Native American to win an Olympic gold medal in 1912."},"IOC bans former senior Olympic member Sheikh Ahmad for 15 years":{"img":null,"link":"https://www.reuters.com/sports/olympics/ioc-bans-sheikh-ahmad-15-years-2024-05-04/","content":"\"The IOC Executive Board decided to confirm the seriousness of the breaches of ethical principles by Sheikh Ahmad Al-Sabah, including a betrayal of his IOC Member’s oath, as well as the seriousness of the damage to the IOC’s reputation, which has jeopardised its interests,\" De Kepper said in the May 3 letter.\"And consequently, to sanction Sheikh Ahmad Al-Sabah by suspending all the rights, prerogatives and functions deriving from his IOC membership for a period of fifteen years starting from the date of the previous sanction decision by the IOC Executive Board on 27 July 2023.\"As a consequence, the IOC Ethics Commission considers that the specific behaviour of Sheikh Ahmad Al-Sabah in orchestrating a fake arbitration procedure exclusively for his own benefit constitutes extremely unethical behaviour by an IOC Member,\" the IOC Ethics Commission said in its decision.In a letter seen by Reuters, IOC Director General Christophe De Kepper informed all IOC members of the Executive Board decision to sanction the once-powerful Sheikh Ahmad over a court case in Switzerland."},"Real Madrid secure LaLiga title after Girona thrash Barcelona 4-2":{"img":null,"link":"https://www.reuters.com/sports/soccer/real-madrid-secure-laliga-title-after-girona-thrash-barcelona-4-2-2024-05-04/","content":"May 4 (Reuters) - Real Madrid claimed a record-extending 36th LaLiga title on Saturday after Girona fought-back to beat Barcelona 4-2, a result that left Carlo Ancelotti's side with an unassailable lead in the standings.On Saturday Andreas Christiansen gave Barca the lead in the third minute before Girona hit back a minute later with LaLiga top-scorer Artem Dovbyk heading in the equaliser.However, in the 65th minute, in his first action after coming off the bench, Portu netted the equaliser and Miguel Gutierrez scored from a rebound two minutes later to give Girona the lead.Real Madrid, who have lost only once in the league this season, beat lowly Cadiz earlier on Saturday."},"MLB roundup: Twins down Red Sox for 11th straight win":{"img":null,"link":"https://www.reuters.com/sports/mlb-roundup-twins-down-red-sox-11th-straight-win-2024-05-04/","content":"Miami then saw a three-game winning streak end when Brent Rooker smacked a two-run homer, Sears worked 6 1/3 shutout innings and the A's recorded a season-best fifth straight win.hit home runs and right-hander Charlie Morton gave up two runs on five hits over six innings as the Braves lost for the fourth time in their last six games and fell to 1-3 on a six-game West Coast road trip.The Mariners forged their lead with a pair of homers off Astros starter Ronel Blanco, who worked six innings and allowed three runs on five hits and two walks with six strikeouts.The Blue Jays, who began a five-game road trip, have lost three games in a row and eight of their past 10."},"LeBron James favored to stay with Lakers as potential suitors emerge":{"img":null,"link":"https://www.reuters.com/sports/lebron-james-favored-stay-with-lakers-potential-suitors-emerge-2024-05-04/","content":"Despite having the shortest odds among teams outside of the Lakers, Cleveland has been backed by only 4 percent of the money for James to spend a third stint with the Cavaliers.The Lakers are the -500 favorite at DraftKings to be the team James begins the 2024-25 season with, but the sportsbook is also offering odds on nine other potential NBA destinations.James just completed his 21st NBA season, which included his 20th consecutive All-Star Game selection.May 4 - LeBron James is going to take some time away from the court to decide where -- and even if -- he will play his 22nd NBA season."},"Lakers fire head coach Darvin Ham after 2 seasons":{"img":null,"link":"https://www.reuters.com/sports/lakers-fire-head-coach-darvin-ham-after-2-seasons-2024-05-03/","content":"May 3 - The Los Angeles Lakers fired head coach Darvin Ham on Friday after two seasons and a 90-74 regular-season record.It's been a hell of a two years,\" Ham said Monday after the Game 5 loss.The Lakers hired Ham on June 3, 2022, to replace Frank Vogel following a 33-49 record in 2021-22, two years removed from winning the NBA championship.\"We greatly appreciate Darvin's efforts on behalf of the Lakers and recognize the many accomplishments achieved over the past two seasons including last year's remarkable run to the Western Conference finals,\" general manager Rob Pelinka said in a team-released statement.\""},"Injured Sinner withdraws from Rome Masters":{"img":null,"link":"https://www.reuters.com/sports/tennis/injured-sinner-withdraws-rome-masters-2024-05-04/","content":"May 4 (Reuters) - Jannik Sinner has been forced to withdraw from the Masters 1000 event in Rome next week due to a hip injury he suffered at the Madrid Open, the world number two said on Saturday, hampering his preparations for the French Open.Sinner pulled out before his quarter-final against Canada's Felix Auger-Aliassime in Madrid and the 22-year-old Italian said he was heartbroken to take the decision to skip his home tournament which runs from May 8-19.\"Sinner is the second major loss for the tournament in Rome after Spain's world number three and claycourt specialist Carlos Alcaraz withdrew as he recovers from an arm injury.Sinner was in fine form in the first few months of the season, winning his first Grand Slam title at the Australian Open before clinching trophies in Rotterdam and at the Miami Masters."},"Beterbiev injury forces postponement of title bout with Bivol":{"img":null,"link":"https://www.reuters.com/sports/beterbiev-injury-forces-postponement-title-bout-with-bivol-2024-05-04/","content":"May 4 (Reuters) - The undisputed light heavyweight championship bout between Artur Beterbiev and Dmitry Bivol in Saudi Arabia has been postponed after Beterbiev suffered a ruptured meniscus in training, promoters Top Rank Boxing said on Friday.\"The plan is to reschedule Beterbiev-Bivol before the end of the year, and additional details will be provided in due course,\" Top Rank Boxing said in a statement.In a post on X, Saudi entertainment head and organiser Turki Alalshikh said the event would still go ahead, with former WBC champion Deontay Wilder taking on Chinese heavyweight Zhilei Zhang on the undercard.The bout, scheduled for June 1 in Riyadh, was set to unify Russian-born Canadian Beterbiev's WBC, IBF and WBO belts with his Russian rival's WBA championship."},"Red Bull's Max Verstappen takes pole for Miami Grand Prix":{"img":null,"link":"https://www.reuters.com/sports/soccer/red-bulls-max-verstappen-wins-miami-sprint-race-2024-05-04/","content":"MIAMI, May 4 (Reuters) - Red Bull's triple world champion Max Verstappen claimed pole position on Saturday for the Miami Grand Prix, to start from the front of the grid for the sixth straight race this season.Ferarri's Carlos Sainz, the only driver other than Verstappen to win a race this season, will start third alongside the second Red Bull of Sergio Perez.The pole, Verstappen's seventh in a row going back to last year in Abu Dhabi, adds to what has so far been a perfect weekend for the Dutchman, who topped the timesheets in the only practice session and sprint qualifying on Friday then winning the sprint race earlier on Saturday.\"I don't know what it is, every single year we come here, I find it extremely difficult to be consistent with the car feeling, the tyre feeling over one lap,\" said Verstappen, who will start on pole in Miami for the first time."}}