{"Wembanyama named NBA's rookie of the year in unanimous vote":{"img":null,"link":"https://www.reuters.com/sports/basketball/wembanyama-named-nbas-rookie-year-unanimous-vote-2024-05-06/","content":"May 6 (Reuters) - French phenom Victor Wembanyama of the San Antonio Spurs was named the unanimous winner of the NBA's rookie of the year award on Monday after a dominant season in which he lead all first-year players in scoring, rebounds and blocks.The 20-year-old Wembanyama is the first player from France to win the NBA's rookie of the year award and the third player to earn the honor as a member of the Spurs, joining David Robinson (1989-90) and Tim Duncan (1997-98).The NBA said Wembanyama received all 99 first-place votes from a media panel, making him the first unanimous rookie of the year since Karl-Anthony Towns in the 2015-16 season.Wembanyama is only the second rookie to lead all NBA players in blocks per game in a season, joining Manute Bol (1985-86).Wembanyama is also one of three finalists for the defensive player of the year award along with Minnesota's Rudy Gobert and Miami's Bam Adebayo."},"Pegula unsure about French Open participation":{"img":null,"link":"https://www.reuters.com/sports/tennis/pegula-unsure-about-french-open-participation-2024-05-07/","content":"May 7 (Reuters) - World number five Jessica Pegula said she is feeling better after shaking off an injury that derailed her claycourt season but the American is unsure if she will play at the French Open, which starts on May 26.Open, but has struggled this season due to illness and injuries.Pegula, who also missed tournaments in the Middle East in February due to a neck issue, last competed in the Billie Jean King Cup in April.The 30-year-old was one of the most consistent players on the WTA Tour last season, winning the Montreal title in the build-up to the U.Having withdrawn from Stuttgart and Madrid, Pegula confirmed she was also skipping Rome this week and said she may have to miss the year's second Grand Slam at Roland Garros (RG)."},"Thunder, Mavericks look for more from stars as series opens":{"img":null,"link":"https://www.reuters.com/sports/thunder-mavericks-look-more-stars-series-opens-2024-05-07/","content":"\"That defender, Luguentz Dort, was a big reason Oklahoma City dispatched the Pelicans quickly in the first round and advanced to the second round for the first time since the 2016 run to the Western Conference finals.\"But as they prepare for their Western Conference second-round matchup, which begins Tuesday in Oklahoma City, both teams likely will need more from their top players -- the Thunder's Shai Gilgeous-Alexander and the Mavericks' Luka Doncic.\"Though Hardaway will be back, Dallas will be without reserve power forward/center Maxi Kleber, who suffered a dislocated AC joint in his right shoulder in the series-clinching Game 6 win over the Clippers, and Olivier-Maxence Prosper, who suffered an ankle injury early in the first-round series.May 7 - The Oklahoma City Thunder and Dallas Mavericks advanced out of the first round without stellar performances from their superstars.8 rebounds in the Mavericks' 4-2 first-round series win over the Clippers, but he shot just 40."},"Braves face Red Sox looking to get back on track":{"img":null,"link":"https://www.reuters.com/sports/braves-face-red-sox-looking-get-back-track-2024-05-06/","content":"The Braves open a two-game home series on Tuesday against the Boston Red Sox after they lost five of their last six games and were swept in a three-game series over the weekend by the surging Los Angeles Dodgers.The Red Sox won three of four games against the Braves last season and split the two that were played at Atlanta one year ago this week.In his most recent outing Tuesday at Seattle, he took a loss after giving up a season-high three runs on six hits, two walks and seven strikeouts in five innings.But Acuna did hit a home run Friday, with his first three-hit game of the season Saturday.In his last start on Wednesday against San Francisco, he pitched a career-high seven innings and allowed two runs on four hits, two walks and six strikeouts."},"Mavericks sign coach Jason Kidd to extension":{"img":null,"link":"https://www.reuters.com/sports/mavericks-sign-coach-jason-kidd-extension-2024-05-06/","content":"Kidd, 51, is 140-106 in three seasons leading the Mavs, who are set to play the Oklahoma City Thunder in the Western Conference semifinals starting Tuesday.\"We are excited to have Coach Kidd continue to lead our team throughout the coming years with this well-earned contract extension,\" Mavericks governor Patrick Dumont said in a statement.May 6 - The Dallas Mavericks signed coach Jason Kidd to a multi-year extension on Monday amid speculation that he was linked to the coaching vacancy with the Los Angeles Lakers.Kidd led the Mavericks to the Western Conference finals in 2022.\"Kidd led our team to two playoff appearances in three seasons, and we are looking forward to his leadership in continuing to build and grow this already great franchise.\""},"Guardians place AL batting leader Steven Kwan (hamstring) on IL":{"img":null,"link":"https://www.reuters.com/sports/guardians-place-al-batting-leader-steven-kwan-hamstring-il-2024-05-06/","content":"Just got to make sure that he's back to a hundred percent before we get him back out there.They're going to make sure he's dialed in and ready to go.You can't replace somebody like that, but hopefully he's back soon.\"I know he's going to be smart,\" Vogt said."},"Jets coach Rick Bowness announces retirement":{"img":null,"link":"https://www.reuters.com/sports/jets-coach-rick-bowness-announces-retirement-2024-05-06/","content":"Bowness, 69, was named a Jack Adams Award finalist this season for the first time in his 14 years as a head coach.Bowness led the Dallas Stars to the Stanley Cup Final in 2020 as interim head coach.May 6 - Winnipeg Jets head coach Rick Bowness announced his retirement Monday after nearly 50 years in the NHL as a player and coach.\"(My wife) Judy and I were all set to call it a day (two years ago), but if I was going to come back to coaching, I couldn't have picked a better place to come back to and to finish my career,\" Bowness said.His first stint as head coach came in 1988-89 with the original Jets franchise after they fired Dan Maloney."},"Vingegaard back on bike outside, hopeful for Tour defence":{"img":null,"link":"https://www.reuters.com/sports/cycling/vingegaard-back-bike-outside-hopeful-tour-defence-2024-05-07/","content":"May 7 (Reuters) - Denmark's twice Tour de France champion Jonas Vingegaard is back riding outside for the first time since his crash last month, and is hopeful of defending his title, the Team Visma-Lease a Bike rider said on Tuesday.Vingegaard won the last two editions of the Tour de France, but his participation was in doubt after suffering a broken collarbone and several broken ribs during the Tour of the Basque Country.\"The Tour de France begins on June 29 in Florence, Italy, and ends on July 21 in Nice.\"This is the first time back on the bike for me, riding outside, and it's really nice to be able to ride like normal again,\" Vingegaard said in a video on social media platform X.\"Of course, I hope to be there at the start of the Tour de France, we don't know exactly how my shape and how my recovery will go, but I will do everything I can to get there in my top shape."},"Maradona's Golden Ball trophy goes to auction":{"img":null,"link":"https://www.reuters.com/sports/soccer/maradonas-golden-ball-trophy-goes-auction-2024-05-07/","content":"May 7 (Reuters) - Diego Maradona's Golden Ball trophy won for being named the best player at the 1986 World Cup will be auctioned in France in June, the Aguttes auction house said on Tuesday.The Golden Ball award was introduced at the 1982 World Cup, and its list of winners include Italy's Paolo Rossi, Romario and Ronaldo of Brazil, Zinedine Zidane of France, while Argentine great Lionel Messi is the only player to have won the accolade twice.Maradona, who died in 2020, won the award after leading Argentina to World Cup victory in Mexico, scoring five goals at the finals where he captained his country and played every minute of the tournament.This is the first Golden Ball to go for auction and while the value is still to be confirmed, the auction house expects it to fetch millions on June 6.After his display against England, Maradona went on to score the two goals which defeated Belgium in the semi-final and Argentina won a thrilling final 3-2 against West Germany."},"Aberg withdraws from Quail Hollow with knee issue":{"img":null,"link":"https://www.reuters.com/sports/golf/aberg-withdraws-quail-hollow-with-knee-issue-2024-05-06/","content":"May 6 (Reuters) - Swedish sensation Ludvig Aberg, who finished solo second in his Masters debut last month, withdrew on Monday from this week's PGA Tour event with a knee issue but expects to return in time for next week's PGA Championship.Aberg's runner-up finish at Augusta National, where he made his major championship debut, was the best by a Swede at the Masters.\"Unfortunately, I'm dealing with a knee issue and after consulting with my doctors, we think it's best that I take some additional time to rest,\" Aberg said in a statement released by the PGA Tour.World number six Aberg was set to make his Quail Hollow debut in Charlotte, North Carolina where a field headlined by world number two Rory McIlroy are competing in the final tune-up ahead of the May 16-19 PGA Championship.In his most recent start, at the RBC Heritage on Hilton Head Island, South Carolina, Aberg earned his fifth top-10 finish of the year."},"Rublev to return to hospital after taking Madrid title":{"img":null,"link":"https://www.reuters.com/sports/tennis/rublev-return-hospital-after-taking-madrid-title-2024-05-06/","content":"May 5 (Reuters) - Andrey Rublev battled through a suspected virus and an anaesthetised foot to beat Felix Auger-Aliassime 4-6 7-5 7-5 to claim the Madrid Open title on Sunday, but revealed that he will now have to return to hospital to make a full recovery.Rublev, who came into the Madrid tournament in poor form having lost his previous four matches on the tour, eliminated second seed and home favourite Carlos Alcaraz and also beat American Taylor Fritz to reach the final.\"I'm still sick and tomorrow I think I'll go back to the hospital for a full check-up to know exactly what's going on,\" Rublev told a news conference.\"\"The seventh seed added that he needed an anaesthetic to play the final.\"I think I showed a great level of tennis from the first match and in the end I was able to win the title."},"MLB roundup: Red Sox extinguish Twins' 12-game win streak":{"img":null,"link":"https://www.reuters.com/sports/mlb-roundup-red-sox-extinguish-twins-12-game-win-streak-2024-05-06/","content":"Marcell Ozuna hit a home run and Max Fried (2-1) gave up four runs on four hits over seven innings after delivering a complete-game shutout and six no-hit innings in his previous two starts.Pirates 5, Rockies 3Oneil Cruz doubled and hit a two-run homer as Pittsburgh rallied from an early deficit to edge visiting Colorado in the rubber match of a three-game series.Dodgers 5, Braves 1Shohei Ohtani hit two home runs, Teoscar Hernandez also went deep and left-hander James Paxton pitched into the seventh inning as host Los Angeles finished off a three-game sweep of Atlanta.had four hits, including a home run, and drove in four runs while Jesse Winker had a three-run homer and a double for the Nationals, who took two of three games from Toronto.Eloy Jimenez hit a solo homer and Bryan Ramos got his first career RBI for the White Sox, who won two of three games to earn their second series victory of the season."},"Donovan Mitchell-led Cavaliers rally from 18 down, win series over Magic":{"img":null,"link":"https://www.reuters.com/sports/donovan-mitchell-led-cavaliers-rally-18-down-win-series-over-magic-2024-05-05/","content":"scored 13 points and Jalen Suggs had 10 points and nine rebounds for the fifth-seeded Magic, who mustered just 15 points in the third quarter.The Cavaliers shaved an 18-point deficit to 10 at halftime before Mitchell erupted for 17 points in the third quarter, capped by a driving layup to stake Cleveland to a 68-66 lead with 3:08 left.Mitchell, who scored 17 points in the third quarter, made 15 of 17 free-throw attempts and added nine rebounds.May 5 - Donovan Mitchell scored 39 points to fuel the host Cleveland Cavaliers to the Eastern Conference semifinals with a 106-94 victory over the Orlando Magic on Sunday in Game 7 of their first-round series.Caris LeVert scored 15 points off the bench and Max Strus added 13 for the fourth-seeded Cavaliers, who overcame an 18-point deficit to record their fourth win at home in the series."},"Tsitsidosa era ends as Badosa announces split with Tsitsipas":{"img":null,"link":"https://www.reuters.com/sports/tennis/tsitsidosa-era-ends-badosa-announces-split-with-tsitsipas-2024-05-06/","content":"He won the Monte Carlo Masters and finished runner-up in Barcelona to prime himself for the French Open which will begin on May 26.Badosa and Tsitsipas made their relationship official on social media during last year's French Open and have often been seen at each other's matches, while also posting pictures on their joint Instagram account.\"Former French Open quarter-finalist Badosa said recently that doctors had told her it would be complicated to continue her career because of her chronic back pain.May 6 (Reuters) - Former world number two Paula Badosa is no longer in a romantic relationship with fellow tennis player Stefanos Tsitsipas after nearly a year together in the spotlight, the Spaniard said.But the 26-year-old Badosa, who has fallen to number 126 in the world with a string of injuries derailing her career, said that the sport's power couple dubbed Tsitsidosa by fans had split amicably."},"Sinner to play in French Open only if 100% fit":{"img":null,"link":"https://www.reuters.com/sports/tennis/sinner-play-french-open-only-if-100-fit-2024-05-06/","content":"\"At Roland Garros, I'll only play if I'm 100%, if there's any doubt we have to see,\" Sinner told reporters.\"Sinner sustained the injury at Madrid and pulled out of his quarter-final against Canada's Felix Auger-Aliassime last week, before the Italian decided to skip the Rome tournament which runs from May 8-19.May 6 (Reuters) - Jannik Sinner has cast doubt on his French Open participation, with the world number two saying he will only compete at Roland Garros later this month if he fully recovers from a hip issue that forced him out of Madrid and Rome.\"Sinner said he could prioritise his health over the year's second Grand Slam, which begins on May 26.\"The 22-year-old, who claimed his maiden Grand Slam title at the Australian Open in January, said the injury was more serious than initially suspected."},"Rublev downs Auger-Aliassime to win Madrid Open title":{"img":null,"link":"https://www.reuters.com/sports/tennis/rublev-downs-auger-aliassime-win-madrid-open-title-2024-05-05/","content":"May 5 (Reuters) - Andrey Rublev overcame an opening set wobble to beat Felix Auger-Aliassime 4-6 7-5 7-5 in the final of the Madrid Open on Sunday to win his second Masters 1000 title.The seventh seed fought back and managed to break Auger-Aliassime but the Canadian was well in control by then, serving well to make optimal use of his strong forehand before sealing the opening set on serve with a resounding winner at the net.Auger-Aliassime was chasing his first ever Masters title and looked well set for victory before a resurgent Rublev, who had been struggling with a fever during the tournament, recovered to prevail in a little under three hours.Auger-Aliassime was under pressure as he served to stay in the contest but he made two double faults, the second handing the title to Rublev in an anti-climactic end to the final.Questions about whether the unseeded Canadian deserved to be in the final were put to rest in the opening set when he clinically dismantled Rublev's serve."},"Inoue knocks out Nery to defend unified super bantamweight title":{"img":null,"link":"https://www.reuters.com/sports/inoue-knocks-out-nery-defend-unified-super-bantamweight-title-2024-05-06/","content":"Nery's left hook knocked down Inoue for the first time in his career, but the 31-year-old got back up and knocked Nery down in the second round with his own left hook to regain momentum.Another left hook from Inoue dropped Nery in the fifth before a right hand finished the bout in the next round, ensuring Inoue retained his WBC, WBO, WBA and IBF belts in front of a sold out home crowd.May 6 (Reuters) - Undefeated Japanese boxer Naoya Inoue survived a first round knockdown to knock out challenger Luis Nery in the sixth and defend his undisputed super bantamweight world championship at the Tokyo Dome on Monday.Mexico's Nery suffered the second knockout of his professional career, and fell to 35-2.Inoue progressed to a professional record of 27-0, with 24 of his victories coming by KO or TKO."},"Wolves wrestle home-court advantage from Nuggets with Game 1 win":{"img":null,"link":"https://www.reuters.com/sports/wolves-wrestle-home-court-advantage-nuggets-with-game-1-win-2024-05-05/","content":"Conley hit his third 3-pointer of the game to give Minnesota an 80-77 lead, but Murray answered from deep and was fouled by Towns.Minnesota jumped out to an 18-4 lead with 5:12 left in the first quarter, but the Nuggets turned up the defense.May 5 - Anthony Edwards scored 43 points, Karl-Anthony Towns finished with 20 and the visiting Minnesota Timberwolves took home-court advantage from Denver with a 106-99 win over the Nuggets in Game 1 of a Western Conference semifinal series on Saturday night.Edwards, who had 25 points in the first half, hit a driving layup through traffic and a pullup 18-footer to put the Timberwolves back in front.Reid hit a pair of 3-pointers, converted a layup and dunked an Edwards miss to give Minnesota a 94-88 lead with 4:20 left."}}