{"Explainer: Soccer-How will an independent football regulator change the English game":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/DQUJQHB6UVMI3C6QETURLKPP7M.jpg","link":"https://www.reuters.com/sports/soccer/soccer-how-will-an-independent-football-regulator-change-english-game-2024-03-19/","content":"6 billion pounds ($2.04 billion) distributed to all levels across the current three-year term."},"Osasuna deny there were racist chants at home game with Real Madrid":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/HXOKNUUVLBPPTFL57SZNJP2WTQ.jpg","link":"https://www.reuters.com/sports/soccer/osasuna-deny-there-were-racist-chants-home-game-with-real-madrid-2024-03-19/","content":"March 19 (Reuters) - Osasuna have denied that there were any racist chants from their fans during the 4-2 home defeat by Real Madrid last weekend, the LaLiga club said in a statement on Tuesday.\"Given the information published in the media after Real Madrid's press release, which presents El Sadar with racist behaviour, Osasuna wants to clarify that no racist chants were uttered (during) Saturday's match,\" Osasuna said.\"Real Madrid have filed a complaint against the referee who handled Saturday's game at El Sadar stadium for not including in his match report alleged insults aimed at their Brazilian forward Vinicius Jr, the capital club said on Monday.In addition, Osasuna wants to show its rejection of the insults - which had no racist references - that a minority proffered last Saturday at El Sadar,\" they added.The club will not tolerate the tarnishing of the reputation of the Osasuna fans, who, throughout its history, have been known for their anti-racist stance."},"Man Utd's Mainoo gets first England call-up":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/6QM74BVRRNOGJNN6TUDJQNNCC4.jpg","link":"https://www.reuters.com/sports/soccer/manchester-utds-mainoo-gets-first-england-call-up-2024-03-19/","content":"March 19 (Reuters) - Manchester United midfielder Kobbie Mainoo has received his first England senior call-up ahead of their two friendlies, the national team said on Tuesday, after the youngster's impressive run at the Premier League club.\"It's an honour to receive my first senior call-up,\" Mainoo posted on Instagram.Everton defender Jarrad Branthwaite and Newcastle United winger Anthony Gordon were also handed their first international call-ups by Southgate last week .The 18-year-old, who was initially part of the Under-21s squad for this month's U-21 Euro 2025 qualifiers, has been drafted into manager Gareth Southgate's team for matches at Wembley against Brazil on March 23 and Belgium on March 26.Mainoo is a graduate of United's youth academy and has made 14 appearances for the Old Trafford side in the Premier League this season."},"Real goalkeeper Courtois suffers new knee injury in training":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/PBBHPNBAZBPHJFPGE62KKNEANQ.jpg","link":"https://www.reuters.com/sports/soccer/real-madrid-goalkeeper-courtois-suffers-new-knee-injury-training-2024-03-19/","content":"MADRID, March 19 (Reuters) - Real Madrid goalkeeper Thibaut Courtois will be out of action for several weeks after incurring a meniscus tear in his right knee during training on Tuesday, the LaLiga club said.The injury is a major blow for Real who will have to make do without the services of one of their key players for their highly anticipated Champions League quarter-final tie against Manchester City in early April.Real, who had only one other goalkeeper, Ukraine's Andriy Lunin, in their first team squad when Courtois sustained his injury, recruited former Chelsea keeper Kepa Arrizabalaga on a season-long loan deal, although the Ukrainian eventually won the battle to be first-choice.He was named Player-of-the-Match in the 2022 Champions League final, making nine saves against Liverpool in Paris, as Real secured a record extending 14th European title with a 1-0 win.Ancelotti had said the plan was for them to play two friendlies against Real's youth team during the international break before returning to the first team for the final stretch of the season."},"Russians, Belarusians will not take part in Paris Games opening parade of teams-IOC":{"img":null,"link":"https://www.reuters.com/sports/russians-belarusians-will-not-take-part-paris-games-opening-parade-teams-ioc-2024-03-19/","content":"LAUSANNE, Switzerland, March 19 (Reuters) - Russians and Belarusians will not take part in the parade of athletes at the opening ceremony of the Paris 2024 Olympics in July, the International Olympic Committee (IOC) said on Tuesday.\"They will not participate in the parade of delegations during the opening ceremony, since they are individual athletes,\" the Olympic body said following an executive board meeting.The Russians and Belarusians, who will be competing as individual neutral athletes (AINs) under a specially-created flag and with an anthem without lyrics produced by the IOC, will not be part of that parade.\"This decision is the logical consequence of the fact that the athletes with Russian and Belarusian passports are not selected as delegations but as individual athletes,\" Paris 2024 Games organisers said in a statement following the IOC decision.The IOC said those athletes who do qualify will then be vetted by a three-member IOC panel in order to meet the eligibility criteria that the Olympic body established for Russians and Belarusians."},"MLB power rankings: Braves, Dodgers sit on top":{"img":null,"link":"https://www.reuters.com/sports/mlb-power-rankings-braves-dodgers-sit-top-2024-03-19/","content":"Unfazed after succumbing to too much of a good thing last October, the defending regular-season champs added Chris Sale, Reynaldo Lopez and Jarred Kelenic.It's March Madness time, so it's probably a good thing to mention the Mariners has all five starters back from last year's 88-win team.The traditionally pitching-challenged club was really good at preventing stolen bases last season.The team that Derek Jeter couldn't save made the playoffs last season and then decided to get younger.March 19 - The Texas Rangers and Arizona Diamondbacks shocked the world by making the World Series last year."},"Fiorentina GM Barone dies after suffering cardiac arrest":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/Y34XUUA55ZKALI6ZNQ2ALCP4UY.jpg","link":"https://www.reuters.com/sports/soccer/fiorentina-gm-barone-dies-after-suffering-cardiac-arrest-2024-03-19/","content":"General Director Giuseppe Barone passed away today at the San Raffaele Hospital in Milan after suddenly falling ill on Sunday,\" it said.March 19 (Reuters) - Fiorentina general manager Joe Barone has died aged 57 after suffering a cardiac arrest, the Serie A club said on Tuesday.Fiorentina had said on Monday that Barone remained in hospital on life support after collapsing on Sunday as the team were leaving the hotel for their Serie A match at Atalanta, which was postponed.\"It is with deep sorrow and immense sadness that Fiorentina confirms the loss of one of its figureheads, a person who has marked the recent history of the club and who will never be forgotten,\" the club said in a statement, opens new tab.\""},"Fenerbahce to consider withdrawing from Super Lig after players attacked":{"img":null,"link":"https://www.reuters.com/sports/soccer/fenerbahce-consider-withdrawing-super-lig-after-players-attacked-2024-03-18/","content":"March 18 (Reuters) - Fenerbahce will consider withdrawing from the Turkish top flight after some of their players were attacked by Trabzonspor fans following their weekend away win, the Super Lig club said on Monday.FIFA President Gianni Infantino condemned the incident earlier on Monday, saying violence in the Turkish Super Lig is \"unacceptable\".The agenda points include evaluation of the actions to be taken following the incident \"including the withdrawal of our football Team A from the Super Lig\", a club statement read.Trabzonspor supporters stormed the pitch and brawled with security forces and Fenerbahce players after their team lost 3-2 on Sunday in the latest incident in a league that has been marred by controversy this season.Fenerbahce will hold an Extraordinary General Assembly Meeting on April 2, the Board of Directors decided on Monday."},"Holders Italy to face Belgium, Brazil and Netherlands in Davis Cup":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/TK3QWBEILVK2HGI5LBQBVYYWZA.jpg","link":"https://www.reuters.com/sports/tennis/holders-italy-face-belgium-brazil-netherlands-davis-cup-2024-03-19/","content":"LONDON, March 19 (Reuters) - Champions Italy will face Belgium, Brazil and the Netherlands in the Davis Cup Finals Group Stage in September.Italy, who claimed the title for the first time since 1976 thanks to the brilliant play of Jannik Sinner, will have home advantage in Group A with Bologna one of four host cities selected by the ITF.Britain will also have home advantage in Group D as they face 2022 champions Canada, Argentina and Finland in Manchester.The group stage will take place after the U.Last year's runners-up Australia will be in Group B in Valencia alongside the Czech Republic, France and Spain."},"Russia's 'Friendship Games' are politically motivated and violate Olympic Charter-IOC":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/Z7QMFTX3E5KXHBNA7YTLH6BGQI.jpg","link":"https://www.reuters.com/sports/russias-friendship-games-are-politically-motivated-violate-olympic-charter-ioc-2024-03-19/","content":"The IOC, which banned the Russian Olympic Committee (ROC) in October for recognising regional Olympic councils for Russian-occupied regions of Ukraine - Luhansk, Donetsk, Kherson and Zaporizhzhia, has allowed athletes from Russia and Belarus to qualify for and compete at the Paris 2024 Olympics this year.\"The IOC notes that, contrary to the Fundamental Principles of the Olympic Charter and the resolutions by the UN General Assembly, the Russian government intends to organise purely politically motivated sports events in Russia,\" the IOC said in a statement.\"The Russian government created and funded the 'International Friendship Association' (IFA), in order to host the summer and winter 'Friendship Games',\" it said.Russia's announcement last year came with their athletes and those of ally Belarus having been largely frozen out of international competition by federations in the wake of the Russian invasion of Ukraine, which Moscow calls a \"special military operation\".\"For this purpose, the Russian government has launched a very intensive diplomatic offensive by having government delegations and ambassadors, as well as ministerial and other governmental authorities, approaching governments around the world,\" the IOC said.\""},"Real Madrid slam referee for not reporting abuse against Vinicius Jr":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/CUOJ6LETWRJRFEFZ6SRNW3I2AM.jpg","link":"https://www.reuters.com/sports/soccer/real-madrid-slam-referee-not-reporting-abuse-against-vinicius-jr-2024-03-18/","content":"March 18 (Reuters) - Real Madrid have filed a complaint against the referee who handled their game at Osasuna on Saturday for not including alleged racist insults aimed at their forward Vinicius Jr in his match report, the club said in a statement on Monday.\"Real have also extended the complaint they filed with the state prosecutor's office on Friday over hate and discrimination offences after alleged racist chanting by Atletico Madrid and Barcelona fans directed at the Brazil forward.\"\"Our club has filed a complaint with the Disciplinary Committee of the Spanish Football Federation (RFEF) against the referee of the match Juan Martinez Munuera,\" Real said.\"Real Madrid once again condemns these violent attacks of racism, discrimination and hatred, and demands that the necessary measures be taken, once and for all, to eradicate the violence that our player Vinicius Junior has been suffering.The 23-year-old Brazil international, who scored twice as La Liga leaders Real won 4-2 at the El Sadar Stadium, has been subjected to racial abuse on several occasions in Spain."},"Kroos relaxed about new deal with Real Madrid and Germany comeback":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/Y23H6IS7RZNAJLWFVZDJOUKMEY.jpg","link":"https://www.reuters.com/sports/soccer/kroos-relaxed-about-new-deal-with-real-madrid-germany-comeback-2024-03-19/","content":"FRANKFURT, Germany, March 19 (Reuters) - Germany midfieder Toni Kroos, who has returned to the national team after coming out of a three-year international retirement, did not rule out staying on past Euro 2024 while also eyeing a new deal with club Real Madrid.\"It helps a team when three of four people who have played tournaments are there but they still have to be good.\"\"The midfielder's contract with Real runs out at the end of the current campaign but Kroos said he had also extended his previous deal late in the season and there were no problems with the club.\"The club is having a good season and so am I.My relationship with the club is too good to have any issues."},"Messi sidelined for Argentina friendlies with injury":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/DP6VTJIY45NKFPWVBBTTNQAJNQ.jpg","link":"https://www.reuters.com/sports/soccer/messi-sidelined-argentina-friendlies-with-injury-2024-03-18/","content":"due to a minor right hamstring injury sustained in the Inter Miami game against Nashville,\" the AFA said on its official X account.The 36-year-old forward missed Inter Miami's Major League Soccer game at DC United on Saturday after coming off injured in their midweek CONCACAF Champions League win against Nashville.March 18 (Reuters) - Argentina captain Lionel Messi is out of this month's friendlies in the United States due to a hamstring injury, the country's FA (AFA) said on Monday.Messi is the latest absence for Lionel Scaloni's side following injuries to AS Roma forward Paulo Dybala, Bayer Leverkusen midfielder Exequiel Palacios and Bournemouth defender Marcos Senesi.Argentina will face El Salvador on Friday at Lincoln Financial Field in Philadelphia before playing Costa Rica four days later at the Los Angeles Coliseum."},"Germany to play Ukraine and Greece in last friendlies before Euro 2024":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/NOBFTUEXEJKJTCOWZ3WOTJ73CA.jpg","link":"https://www.reuters.com/sports/soccer/germany-play-ukraine-greece-last-friendlies-before-euro-2024-2024-03-19/","content":"BERLIN, March 19 (Reuters) - Hosts Germany will play two friendly matches against Ukraine and Greece in June days before the start of the European championships on home soil, the team said on Tuesday.The Germans will host Ukraine in Nuremberg on June 3 before taking on Greece in Moenchengladbach four days later.The Germans travel to France on March 23 and host the Netherlands three days later in their friendly matches this month.There is now mounting pressure in Germany for Nagelsmann and his team to start delivering with the Euros less than 100 days away.Ukraine and Greece are two fighting, passionate teams and we had problems with such opponents lately."},"Asian champions Qatar shift focus as World Cup preliminaries resume":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/N4VZ3BDAMNMQLCOBWSLUECVFZI.jpg","link":"https://www.reuters.com/sports/soccer/asian-champions-qatar-shift-focus-world-cup-preliminaries-resume-2024-03-19/","content":"Group G leaders Saudi Arabia play second-placed Tajikistan with Roberto Mancini's side holding a two-point lead over the surprise Asian Cup quarter-finalists.On Thursday, the Japanese face the first of two meetings with North Korea, playing in Tokyo before a tricky trip to Pyongyang on Tuesday for Hajime Moriyasu's side in their first internationals since underperforming at the Asian Cup.HONG KONG, March 19 (Reuters) - Qatar will resume their quest for a first-ever qualification for the World Cup against Kuwait on Thursday with stability in the dugout but change on the pitch six weeks after retaining the Asian Cup on home soil.Qatar hosted the 2022 World Cup but have never qualified for the finals, with Japan, South Korea, Australia, Iran and Saudi Arabia claiming the Asian berths at the most recent edition.South Korea go into their meeting with Thailand under Hwang Sun-hong, the interim replacement for Juergen Klinsmann following the German's post-Asian Cup sacking."},"British government to introduce independent football regulator":{"img":null,"link":"https://www.reuters.com/sports/soccer/premier-league-study-football-governance-bill-2024-03-18/","content":"\"The government announcement comes after the Premier League last week failed to agree a new financial settlement with the English Football League (EFL), which runs the professional game in lower tiers.\"If over the coming seasons the Premier League ceases to be the best league in the world, it will be down to an interfering government.\"This means we will be competing with teams from leagues in Europe who give a fraction of the money Premier League clubs give to both the EFL and grassroots football.The regulator will be independent of government and football authorities with the power to fine clubs up to 10% of their turnover for non-compliance with financial regulations, the government said in a press release, opens new tab.The establishment of the independent football regulator will be at the heart of this reform, and we are encouraged that the regulator will be given backstop powers to deliver financial redistributions should the game be unable to agree a deal itself."},"Russia government becoming more aggressive towards Olympic movement, Bach says":{"img":null,"link":"https://www.reuters.com/sports/russia-government-becoming-more-aggressive-towards-olympic-movement-bach-says-2024-03-19/","content":"\"In the Olympic world, we have had for 30 years what the political world calls a two-state solution: we have an Israeli National Olympic Committee and a Palestinian National Olympic Committee.\"PARIS, March 19 (Reuters) - Russia's government is becoming increasingly aggressive towards the International Olympic Committee as the Paris Games draw near, IOC President Thomas Bach said on Tuesday.Unlike the Russian Olympic Committee, the Israeli Olympic Committee has not violated the Olympic Charter,\" the German said.The IOC will allow Russian and Belarusian athletes who qualify to take part as neutrals without their countries' flags, emblems or national anthems.We will be able to rely on our Olympic solidarity programme, which stipulates that at least six athletes per National Olympic Committee are required,\" he said."},"Mbappe's reduced playing time with PSG may benefit France, Deschamps says":{"img":null,"link":"https://www.reuters.com/sports/soccer/mbappes-reduced-playing-time-with-psg-may-benefit-france-deschamps-says-2024-03-19/","content":"France under-23 coach Thierry Henry said on Monday that Real had turned down a request to release players for the Games.\"If that fatigue can be reduced a little (all the better),\" the French coach added ahead of a friendly against Germany on March 23.March 19 (Reuters) - Kylian Mbappe's reduced playing time with Paris St Germain in recent weeks could be good news for the France national team as it may keep him fresh for the European Championship and Olympic Games, manager Didier Deschamps said.14, a 2-1 Champions League win at Real Sociedad, a 3-1 French Cup win over Nice and a 6-2 league win over Montpellier on Sunday.Mbappe, who has been linked with a move to Real Madrid, has said he hopes to participate at this summer's Paris Olympics but a move to the LaLiga leaders may prevent him from doing that."},"Phillies, Bryce Harper not yet concerned by back trouble":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/564Z5JBXYJJXPJ7EV5ER2DT2Q4.jpg","link":"https://www.reuters.com/sports/phillies-bryce-harper-not-yet-concerned-by-back-trouble-2024-03-19/","content":"Harper sat out Monday for the fourth consecutive spring training game with soreness in his lower back.March 19 - Philadelphia Phillies first baseman Bryce Harper was prescribed rest for his ailing back and anticipates rejoining the lineup on Friday.Given back issues in the past, Harper is aware of outside concern about his availability early in the season.\"I said, ‘If it's back field or big field, I'll get my at-bats.'Harper said he discussed slowing his workload to be prepared to play the opener with Phillies manager Rob Thomson, whose greater concern for Harper was having him get work at first base as he transitions from the outfield."}}