{"Jokic named NBA MVP for third time":{"img":null,"link":"https://www.reuters.com/sports/basketball/jokic-named-nba-mvp-third-time-2024-05-09/","content":"It marks the sixth year in a row that an international player has claimed the title in the North American league, after Cameroonian center Joel Embiid won last year and Greek forward Giannis Antetokounmpo won in 2020 and 2019.NEW YORK, May 8 (Reuters) - Denver Nuggets center Nikola Jokic won the NBA's Most Valuable Player award for the third time in four seasons, the league announced on Wednesday.The Serbian big man is the ninth player to claim the honor three or more times, previously winning in 2021 and 2022, after averaging 26.He was only the second player ever to have at least 2,000 points, 900 rebounds and 700 assists in a season, after Oscar Robertson (1961-62).Jokic beat Oklahoma City Thunder's Shai Gilgeous-Alexander and Luka Doncic of the Dallas Mavericks for the honor, receiving 79 first-place votes from a panel of broadcasters and journalists."},"NHLPA announces Ted Lindsay Award finalists":{"img":null,"link":"https://www.reuters.com/sports/nhlpa-announces-ted-lindsay-award-finalists-2024-05-08/","content":"The 26-year-old forward became just the 10th player in NHL history to record six or more hat tricks in a season.The 28-year-old forward opened the season with a 35-game points streak at home and led the NHL in shots (405).The 30-year-old forward also topped the league with 53 points on the power play.Kucherov set a Tampa Bay franchise record and topped the NHL with 144 points (44 goals, 100 assists) in 81 games for the Lightning.Matthews led the NHL with 69 goals and scored a career-high 107 points in 81 games for the Toronto Maple Leafs."},"Adidas names Candace Parker president of women's basketball":{"img":null,"link":"https://www.reuters.com/sports/adidas-names-candace-parker-president-womens-basketball-2024-05-08/","content":"\"\"In her new role as President, Parker will collaborate with the brand to create a powerful platform aimed at influencing and elevating the future of women's sports,\" Adidas basketball global GM Eric Wise said in a statement.May 8 - Candace Parker was named Adidas' new president of women's basketball on Wednesday.In 2010 Parker became the first woman to have a signature basketball shoe with Adidas, the ACE Commander.A two-time WNBA MVP, Parker won league titles with the Los Angeles Sparks (2016), the Chicago Sky (2021) and the Las Vegas Aces (2023).\"I said to (Adidas), 'I don't want to be a mascot,'\" Parker told Fast Company in an interview."},"Fever add 11 TV markets for Caitlin Clark's rookie season":{"img":null,"link":"https://www.reuters.com/sports/fever-add-11-tv-markets-caitlin-clarks-rookie-season-2024-05-09/","content":"\"This is a pivotal moment for our Fever team and women's basketball, more broadly, and this groundbreaking partnership with TEGNA (a broadcast and digital media company) will ensure more fans than ever will be able to watch this historic season,\" Pacers Sports and Entertainment chief executive officer Rick Fuson said in a statement.Next Tuesday marks Indiana's season opener, and the first broadcast of this expanded coverage will occur two days later when they take on the visiting New York Liberty.May 9 - Former Iowa standout Caitlin Clark is getting the Indiana Fever some more screen time.Indiana, Illinois, Ohio, Iowa and Kentucky will each have at least one station showing Clark and teammates take the court this summer.Twelve television markets will aid in broadcasting 17 of Indiana's games for free this season, allowing fans to get a better glimpse at Clark, the No."},"MLB roundup: Cubs top Padres on Michael Busch's walk-off HR":{"img":null,"link":"https://www.reuters.com/sports/mlb-roundup-cubs-top-padres-michael-buschs-walk-off-hr-2024-05-08/","content":"Diamondbacks 6, Reds 2Corbin Carroll drilled a three-run homer and drove in his team's first five runs and Zac Gallen threw six shutout innings, helping Arizona down host Cincinnati.Arozarena homered for the second time in three games by launching his sixth blast of the year, a two-run shot, in the third.Josh Naylor clubbed a two-run homer -- his ninth long ball of the season -- and Jose Ramirez had three hits and two RBIs for the Guardians, who had won three straight.Angels 9, Pirates 0Kevin Pillar clubbed two home runs and tallied a career-high six RBIs to complement Patrick Sandoval's seven shutout innings as visiting Los Angeles pounded Pittsburgh.Jonathan India belted his second homer of the season with two outs in the seventh off Arizona reliever Bryce Jarvis for the Reds' first long ball since May 1."},"Flame arrives in Marseille amid tight security":{"img":null,"link":"https://www.reuters.com/sports/olympics/flame-arrive-marseille-amid-tight-security-2024-05-08/","content":"MARSEILLE, France, May 8 (Reuters) - The Olympic flame landed on French soil amid tight security on Wednesday, firing the starting gun on a summer extravaganza of sport that President Emmanuel Macron hopes will showcase the splendours of France and burnish his legacy.Sun-baked Marseille, France's second city, provides a different spectacle to the formal elegance of Paris and large crowds gathered around the Old Port to watch.The flame arrived in Marseille, a port city in southern France founded by Greek merchants, after a 12-day trip from Greece onboard the Belem, a 128-year-old three-masted tall ship that once transported sugar from France's colonies in the West Indies to the metropole.From Marseille, the torch will continue on an 11-week odyssey that will see it criss-cross France and visit French overseas territories in the Caribbean as well as the Indian and Pacific oceans.Some 7,000 law enforcement officers including snipers and dog units secured Marseille's Old Port, a stress test for the Paris 2024 organisers with France on its highest state of security alert against a complex geopolitical backdrop."},"Rudy Gobert named Defensive Player of Year for 4th time":{"img":null,"link":"https://www.reuters.com/sports/rudy-gobert-named-defensive-player-year-4th-time-2024-05-08/","content":"Gobert, who is the first player in Timberwolves franchise history to win the award, won his first three Defensive Player of the Year awards with the Utah Jazz (2018, 2019, 2021).Minnesota ranked first in the regular season in points allowed per game (106.May 8 - Minnesota Timberwolves center Rudy Gobert was named the NBA's Defensive Player of the Year for the fourth time on Tuesday.Miami Heat center Bam Adebayo (91 points) finished third, Los Angeles Lakers forward Anthony Davis (83) was fourth and New Orleans Pelicans forward Herbert Jones (14) rounded out the top five.1 blocks in 757 regular-season games during his 11-year career with the Jazz (2013-2022) and Timberwolves (2023-2024)."},"Confidence boosted, Rory McIlroy targets fourth win at Wells Fargo":{"img":null,"link":"https://www.reuters.com/sports/golf/confidence-boosted-rory-mcilroy-targets-fourth-win-wells-fargo-2024-05-08/","content":"The only player ranked higher in the Official World Golf Ranking, Scottie Scheffler, is taking another week off as he and his wife Meredith Scheffler await the birth of their first child.The $20 million signature event is the last tune-up for some of the best players in the world before the PGA Championship next week.May 8 - Three-time tournament champion Rory McIlroy headlines a field of just 69 players at this week's Wells Fargo Championship at Quail Hollow Club in Charlotte, N.McIlroy, the Wells Fargo champion in 2010, 2015 and 2021, is the highest-ranked player in the field (No.A lot has changed for the 30-year-old, who entered last year's Wells Fargo ranked No."},"Korda keeping it simple ahead of LPGA record attempt":{"img":null,"link":"https://www.reuters.com/sports/golf/korda-keeping-it-simple-ahead-lpga-record-attempt-2024-05-08/","content":"Korda clinched her second major title and fifth straight win at the Chevron Championship last month, equalling the record held by Nancy Lopez (1978) and Annika Sorenstam (2004–2005) for the most consecutive LPGA victories.NEW YORK, May 8 (Reuters) - American Nelly Korda is keeping it simple as she vies for a record sixth consecutive LPGA win this week at the Cognizant Founders Cup on a tricky course at Upper Montclair Country Club.\"Korda, who underwent surgery to remove a blood clot in her arm two years ago and missed five weeks due to a lower back issue in 2023, withdrew from the LPGA's Los Angeles tournament late last month citing exhaustion.The Florida native said she does not consider herself lucky in the Garden State, after missing the cut last year at the LPGA Championship in nearby Springfield, but is keeping her nerves in check.Korda has embraced the star power that comes with her success, becoming the first golfer since Tiger Woods to attend the famed Met Gala in New York City on Monday on a spur of the moment invite."},"Nuggets' Murray fined $100,000 for throwing objects onto court":{"img":null,"link":"https://www.reuters.com/sports/basketball/nuggets-murray-fined-100000-throwing-objects-onto-court-2024-05-08/","content":"May 7 (Reuters) - Denver Nuggets guard Jamal Murray has been fined $100,000 for throwing a towel and a heating pad in the direction of an official during a playoff game this week, the NBA said on Tuesday.Murray was not suspended over the incident, which occurred while the Nuggets game against the Minnesota Timberwolves was in progress on Monday.Minnesota, who lead the best-of-seven Western Conference semi-finals series 2-0, host Game Three on Friday.Reigning champions Denver lost the game."},"Blues remove interim tag from coach Drew Bannister":{"img":null,"link":"https://www.reuters.com/sports/blues-remove-interim-tag-coach-drew-bannister-2024-05-07/","content":"Before being named interim coach, Bannister compiled a 93-58-19 record in three seasons with Springfield of the American Hockey League.Louis Blues removed the interim tag from coach Drew Bannister and signed him to a two-year contract on Tuesday.The Blues went 30-19-5 under Bannister's leadership but missed the playoffs for a second straight season.From Bannister's arrival through the end of the season, the Blues had the 12th-most points (65) and the 10th-best home record (18-9-2) in the league.A defenseman from Ontario, Bannister played 164 games over six NHL seasons after being drafted by Tampa Bay in the second round in 1992."},"Gauff puts Paris Olympics in same bracket as Grand Slams":{"img":null,"link":"https://www.reuters.com/sports/olympics/gauff-puts-paris-olympics-same-bracket-grand-slams-2024-05-08/","content":"\"Gauff's immediate focus is to prepare for the French Open, which begins on May 26, and the world number three said improving her serve could be key to collecting another Grand Slam title following last year's U.The 20-year-old is eager to make her Games debut when the tennis event gets underway on July 27 at Roland Garros, the same venue where she will bid for a second Grand Slam title at the French Open, which kicks off later this month.\"I think for me it's just serving better than I did last week, honestly,\" added Gauff, who finished runner-up in the 2022 French Open runner-up.\"I'd say equal to the Grand Slams,\" Gauff told reporters at the Italian Open.May 8 (Reuters) - Coco Gauff was denied the chance to compete at the Tokyo Olympics in 2021 after testing positive for COVID and the American says winning a medal at the Paris Games would be on a par with Grand Slam success for her this year."},"McIlroy says he is not rejoining PGA Tour policy board":{"img":null,"link":"https://www.reuters.com/sports/golf/mcilroy-says-he-is-not-rejoining-pga-tour-policy-board-2024-05-08/","content":"\"The best course of action is if there are some people on there who aren't comfortable with me coming back on, then I think Webb stays on and sees out his term.And I think there was a subset of people on the board who were uncomfortable with me coming back on for some reason,\" McIlroy told reporters.It's probably not going to feel great for either side, but if it's a place where the game of golf starts to thrive again and we can all get back together, then I think that's ultimately a really good thing.I would just say it was a complicated process to put me back on there so that's all fine.McIlroy had stepped down from the board last year but said last month that he was ready to return and take Webb Simpson's place, with the American offering to resign from his role as one of the player directors."},"FIA's first CEO Robyn to leave after 18 months":{"img":null,"link":"https://www.reuters.com/sports/formula1/fias-first-ceo-robyn-leave-after-18-months-2024-05-08/","content":"Robyn was one of the most senior female executives in motorsport and her arrival from the auto industry was hailed by the FIA as a \"transformative moment\" for an organisation led by Emirati Mohammed Ben Sulayem.The relationship between Liberty Media-owned Formula One and the FIA deteriorated last year, with the two sides at loggerheads over a number of issues including possible expansion to 11 teams.May 8 (Reuters) - Natalie Robyn is leaving Formula One's governing body after serving just 18 months as its first chief executive, the FIA said on Wednesday.The FIA is facing legal action brought by Susie Wolff, the director of the all-female F1 Academy support series and wife of Mercedes team boss Toto, after a conflict of interest enquiry last year.The governing body said Robyn had decided to pursue opportunities elsewhere and was leaving by mutual agreement at the end of May."},"Moss hailed as true racer at memorial service":{"img":null,"link":"https://www.reuters.com/sports/formula1/moss-hailed-true-racer-memorial-service-2024-05-08/","content":"Triple Formula One world champion Jackie Stewart led the tributes for a driver, widely regarded as the greatest never to win the title, who died aged 90 in April 2020.Seven times world champion Lewis Hamilton was represented by his father Anthony while title-winning team boss Ross Brawn and Red Bull's Christian Horner also attended.The son of Argentina's late five times world champion Juan Manuel Fangio, Moss's friend, rival and team mate, attended the service along with champions Nigel Mansell and Damon Hill.And I had just won the world championship,\" said Stewart.LONDON, May 8 (Reuters) - Stirling Moss was hailed as a true racer and all-time Formula One great at a memorial service in London's Westminster Abbey on Wednesday for a man who remains a byword for speed and sportsmanship."},"Miami GP sets F1 record for a live U.S. television audience":{"img":null,"link":"https://www.reuters.com/sports/formula1/miami-gp-sets-f1-record-live-us-television-audience-2024-05-07/","content":"1 million viewers watching the race on ABC and a peak of 3.6 million, for the inaugural Miami Grand Prix in 2022.May 7 (Reuters) - Sunday's Miami Grand Prix drew Formula One's biggest live U.6 million, according to broadcaster ESPN.1 million."},"Sphere in Las Vegas to host 2024 NHL Draft":{"img":null,"link":"https://www.reuters.com/sports/nhl/sphere-las-vegas-host-2024-nhl-draft-2024-05-07/","content":"May 7 (Reuters) - The 2024 National Hockey League Draft will be held in Las Vegas at Sphere in what will be the first televised event from the futuristic venue, the league announced on Tuesday.The NHL Draft, which has never been held in Las Vegas before, will take place June 28-29 when the San Jose Sharks are widely expected to select Canadian forward Macklin Celebrini with the first overall pick.\"The first day of the draft will consist of the opening round followed by rounds two-seven on the second day.\"The NHL is proud to bring the first sports event and the first live television broadcast to Sphere,\" NHL Senior Executive Vice President Steve Mayer said in a news release.\"San Jose earned the right to select Celebrini by winning the NHL Draft Lottery on Tuesday that consisted of the 16 teams that failed to qualify for the 2024 Stanley Cup Playoffs."},"Connor McDavid chasing fourth Hart Trophy":{"img":null,"link":"https://www.reuters.com/sports/connor-mcdavid-chasing-fourth-hart-trophy-2024-05-07/","content":"Kucherov, who won the Hart Trophy in 2018-19, led the NHL and set a Tampa Bay Lightning record with 144 points (44 goals, league-leading 100 assists) in 81 games this season.McDavid won his third Hart Trophy last season and is looking to join Wayne Gretzky (nine), Gordie Howe (six) and Eddie Shore (four) as the only players in NHL history to win at least four.He would be the fourth active player with multiple Hart Trophy wins: McDavid (three), Ovechkin (three) and Sidney Crosby (two).In addition to winning his second Art Ross Trophy, the forward led the league in power-play points (53), power-play assists (40) and three-point games (23).McDavid, 27, contributed 132 points (32 goals, league- and career-high 100 assists) in 76 games this season while leading the Oilers to the playoffs following a 2-9-1 start to the season."},"Sparks move Fever game; Indy writer suspended after Caitlin Clark interaction":{"img":null,"link":"https://www.reuters.com/sports/sparks-move-fever-game-indy-writer-suspended-after-caitlin-clark-interaction-2024-05-07/","content":"In other Clark-related news, news emerged Tuesday that Gregg Doyel, a longtime columnist for the Indianapolis Star, is in the midst of a two-week suspension.The punishment was levied by the publication and its corporate owner, Gannett, after Doyel's awkward encounter with Clark at her introductory news conference last month.May 7 - The Los Angeles Sparks have moved their May 24 game against Caitlin Clark and the Indiana Fever to the 19,000-seat Crypto.com Arena, the team announced Tuesday.Tickets to see the Fever and Clark, who was the No."}}