{"AB de Villiers gives take on IPL 2024 playoffs scenario: RCB need to win big vs CSK":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/faf-du-plessis-and-virat-kohli-101114325-16x9_2.jpg?VersionId=be9npELViTv6Jb25.2Pzi1Mp3krff0iw&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-rcb-vs-csk-ab-de-villiers-playoff-scenario-2538238-2024-05-12","content":"You got to think SRH will win at least one of their last two matches playing at home, that means there will only be one spot available for RCB to try and claim.The former South Africa captain feels that SRH will win atleast one of their last two home matches, meaning that RCB will have just one spot remaining.The win vs CSK at the Chinnaswamy will have to be a very big one,\" said De Villiers.AB de Villiers feels that RCB will need to claim a big win against CSK if they are to stand a chance of making it to the IPL 2024 Playoffs.De Villiers only a big win against CSK will help RCB at the moment."},"Definitely Not: Suresh Raina says CSK vs RR not MS Dhoni's last IPL game in Chennai":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/ms-dhoni-125815183-16x9_0.jpg?VersionId=Y7wNJTR6veL4cys49Nvsu3BwFphmyU1r&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-csk-vs-rr-ms-dhoni-last-game-chennai-suresh-raina-definitely-not-2538235-2024-05-12","content":"Former India and CSK all-rounder Suresh Raina played down rumours of MS Dhoni not returning to Chepauk to play IPL after their last league game of the 2024 season in Chennai.Fans with banners and posted for CSK and MS Dhoni turned up in huge numbers for the last league game of the season.Speaking to presenter Danny Morrison during the toss at CSK's final league game of that season, Dhoni said it was definitely not his last game in yellow in the IPL.Raina, who was on air during the IPL 2024 match between Chennai and Rajasthan at the MA Chidambaram Stadium, Dhoni was asked if Sunday's game would be MS Dhoni's last in Chennai.Is this MS Dhoni's last game here at Chepauk?"},"RCB vs DC Live Score, IPL 2024: Virat Kohli in focus as RCB look to extend winning run":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/breaking_news/202405/rcb-vs-dc-125308776-16x9_0.jpg?VersionId=Vp9Mb7TyA2LbbLA0knVCOzeqDLaClZYt&size=686:385","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-rcb-vs-dc-live-updates-bengaluru-virat-kohli-axar-patel-faf-du-plessis-2538233-2024-05-12","content":{}},"Stuart Broad reacts to James Anderson retirement: Will love every ball of Lord’s":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/james-anderson-094846798-16x9.jpeg?VersionId=7c88OtF9UWpf0I9XsgjhDLGKQ3U07AWd&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/stuart-broad-reacts-to-england-star-james-andersons-retirement-2538227-2024-05-12","content":"A post shared by Stuart Broad (@stuartbroad)\nAnderson revealed the reason why he was retiring from the game and said it was just looking ahead and felt a '43-year-old couldn't make the next Ashes.Broad said he is looking forward to Anderson's future and hinted that they both will enjoy their time on the golf course and have some fine wine.Broad said he would enjoy every single delivery Anderson will deliver during the Lord's Test against West Indies.For years, Anderson and Broad had formed a successful bowling duo for the England Test team.Stuart Broad wrote an emotional message to England legend James Anderson after the pacer announced his decision to retire from international cricket."},"Tried to learn from Virat Kohli whenever I meet him: Babar Azam on comparisons":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/babar-azam--virat-kohli-123523100-16x9_0.jpg?VersionId=tRPOrogaqkhHVzcT5Dx7gl4FKNiM_mWA&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/tried-to-learn-from-virat-kohli-whenever-i-meet-him-babar-azam-on-comparisons-2538226-2024-05-12","content":"Babar and Kohli met each other during the T20 World Cup 2021 match at the Dubai International Cricket Stadium.Babar will be looking to keep up with the game with the T20 World Cup to be held later this year in the West Indies and the United States of America (USA).Babar is currently in Ireland where Pakistan are playing a 3-match T20I series against the hosts at the Clontarf Cricket Club Ground in Dublin.The duo also rubbed shoulders after India beat Pakistan in the ODI World Cup 2023 game at the Narendra Modi Stadium in Ahmedabad.Babar Azam said that he tries to learn the nitty-gritty of batting whenever he meets Virat Kohli, the holder of a plethora of records in international cricket."},"Zimbabwe all-rounder Sean Williams retires from T20Is after Bangladesh series":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/sean-williams-120352533-16x9_0.jpeg?VersionId=.VwvEXhAC.60gWJgl2xKB17vReF7B_94&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/zimbabwe-all-rounder-sean-williams-retires-t20is-bangladesh-series-2538219-2024-05-12","content":"Williams decided to hang his boots after Zimbabwe secured a consolation victory by 8 wickets on Sunday in the last T20I at the Sher-e-Bangla National Stadium in Mirpur.Zimbabwe all-rounder Sean Williams has retired from T20Is after taking part in the 5-match series against Najmul Hossain Shanto’s Bangladesh.\"He (Williams) decided to retire from T20I and informed about his decision to his team mates following the game,\" the official was quoted as saying to Cricbuzz.A Bangladesh Cricket Board (BCB) official, working with the Zimbabwean team, confirmed the development around Williams.Williams made his T20I debut for Zimbabwe way back in 2006 against Bangladesh."},"Chelsea wants to keep pushing for Champions League berth every season: Reece James":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/reece-james-12393258-16x9_0.jpg?VersionId=EFfP36FimrXKuhxp8DFkv8vMfXKuW.iN&size=690:388","link":"https://www.indiatoday.in/sports/football/story/premier-league-chelsea-vs-nottingham-forest-reece-james-ucl-2538212-2024-05-12","content":"Speaking after the game, James said that the young squad is learning everyday and the team has had a few off days this season and ending it strong at the moment.Chelsea captain Reece James said that the club wants to keep pushing for a UEFA Champions League berth every season after they kept their European hopes alive with the win over Nottingham Forest.\"We’re still young and during the season we’ve had a few off days, but on the whole we’ve improved and we’re coming strong towards the end of the season.\"\"Europe is one of the highest levels in club football and we’re one of the biggest clubs in club football, so we want to be pushing each season to be knocking on the door for the Champions League.I was just determined to get back before the end of the season, be in a good shape to help the team and I’m glad I was able to do that today."},"T20 World Cup-bound Sanju Samson records best ever season in IPL":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/sanju-samson-072056304-16x9_3.jpg?VersionId=GdhTH8wxYQFkmT97CyxEIxML4YL27sya&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/t20-world-cup-bound-sanju-samson-records-best-ever-season-in-ipl-2538202-2024-05-12","content":"Samson has been in serious form this season, recording 485 runs in 12 matches.The form has earned Samson a much deserved call-up in the Indian T20 World Cup squad.IPL 2024, CSK vs RR: Live Updates | ScorecardThis season has seen Samson in his most matured form.RR captain Sanju Samson registered his best-ever season with the bat in the Indian Premier League.I feel I need to spend more time and understand conditions,\" Samson said in the post-match presentation after their game against RR."},"Sunil Gavaskar rooting for emotional farewell for MS Dhoni at Chepauk":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/ms-dhoni-111602432-16x9_1.jpg?VersionId=wlzL2Vvc_bIPdFlqf3OkIlUDhNRx9HaA&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-on-ms-dhoni-ipl-2024-cskvsrr-2538185-2024-05-12","content":"Ahead of CSK’s last home game of the season, Gavaskar expressed his desire to see the legendary cricketer going out on a high by smashing a couple of sixes.Hence, the defending champions will look to give their all in the field to make sure that the legendary skipper goes out on a high if he decides to hang up his boots at the end of the season.Notably, the ongoing season is expected to be the last one for the former CSK skipper who’s led his side to joint-most five IPL titles.I think it is going to be emotional just like when Sachin Tendulkar played his last match at the Wankhede Stadium.But it’s going to be emotional, I mean as the match progresses they will know where the match is standing whether CSK is going to win or RR is going to win."},"India targetting double-digit medal tally in Paris Olympics: Anurag Thakur":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/paris-olympics-065750837-16x9.jpg?VersionId=DbRAeRDl0LzLuBKHQSPjnA3jpCKXnnfb&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/india-targetting-double-digit-medal-tally-in-paris-olympics-anurag-thakur-2538186-2024-05-12","content":"India are targetting a medal tally in the double digits at the Paris Olympics, said Union Minister of Youth Affairs and Sports Anurag Thakur.The Khelo India Games, a cornerstone of India's initiative to bolster sports at the grassroots level, have emerged as a pivotal platform for nurturing young talent across the nation.Speaking to PTI in an interview just months ahead of the tournament, Thakur said that India had done enough preparation to better their medal tally.India will have high hopes for Javelin, shooting and badminton this time around as a few of the top-ranked athletes in the world take part in the games.India wish to host the Summer Olympics in 2036, we will bid for that,\" Anurag Thakur said in an interview with PTI."},"IPL 2024: Virat Kohli, Faf du Plessis leaders behind RCB revival, says coach Flower":{"img":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/faf-du-plessis-and-virat-kohli-101114325-16x9_1.jpg?VersionId=88ACAHqbGopx1ZbLYt7gTIXVDLytdCWq&size=690:388","link":"https://www.indiatoday.in/sports/cricket/story/ipl-2024-rcb-vs-dc-virat-kohli-faf-du-plessis-leader-andy-flower-2538178-2024-05-12","content":"RCB are all set to face off against DC in a must-win fixture on May 12 at the M Chinnaswamy stadium in Bengaluru, and yet again, the majority of the focus will fall on the opening stand between du Plessis and Kohli.Since the SRH clash, RCB have clinched a four-match winning streak, which has only amped up the excitement around the DC clash on Sunday.com/pA0haTMLqV\n— Royal Challengers Bengaluru (@RCBTweets) May 12, 2024RCB skipper du Plessis and Virat also gave an insight into their side's mindset ahead of the high-value clash against DC.IPL 2024 Full Coverage | IPL 2024 Points Table and Standings | 2024 IPL Full ScheduleThe DC clash will not feature their skipper Rishabh Pant, who has been handed a one-match ban for his side maintaining a slow over-rate in their previous clash against RR.With Axar Patel leading the side in Pant's absence, both RCB and DC will be looking to go all out for a win at Chinnaswamy."}}