{"McIlroy says he is not rejoining PGA Tour policy board":{"img":null,"link":"https://www.reuters.com/sports/golf/mcilroy-says-he-is-not-rejoining-pga-tour-policy-board-2024-05-08/","content":"And I think there was a subset of people on the board who were uncomfortable with me coming back on for some reason,\" McIlroy told reporters.\"The best course of action is if there are some people on there who aren't comfortable with me coming back on, then I think Webb stays on and sees out his term.It's probably not going to feel great for either side, but if it's a place where the game of golf starts to thrive again and we can all get back together, then I think that's ultimately a really good thing.I would just say it was a complicated process to put me back on there so that's all fine.May 8 (Reuters) - Rory McIlroy will not be rejoining the PGA Tour's policy board as some board members were 'uncomfortable' with his potential return, the world number two said on Wednesday."},"Gauff puts Paris Olympics in same bracket as Grand Slams":{"img":null,"link":"https://www.reuters.com/sports/olympics/gauff-puts-paris-olympics-same-bracket-grand-slams-2024-05-08/","content":"\"Gauff's immediate focus is to prepare for the French Open, which begins on May 26, and the world number three said improving her serve could be key to collecting another Grand Slam title following last year's U.The 20-year-old is eager to make her Games debut when the tennis event gets underway on July 27 at Roland Garros, the same venue where she will bid for a second Grand Slam title at the French Open, which kicks off later this month.\"I think for me it's just serving better than I did last week, honestly,\" added Gauff, who finished runner-up in the 2022 French Open runner-up.\"I'd say equal to the Grand Slams,\" Gauff told reporters at the Italian Open.May 8 (Reuters) - Coco Gauff was denied the chance to compete at the Tokyo Olympics in 2021 after testing positive for COVID and the American says winning a medal at the Paris Games would be on a par with Grand Slam success for her this year."},"Rudy Gobert named Defensive Player of Year for 4th time":{"img":null,"link":"https://www.reuters.com/sports/rudy-gobert-named-defensive-player-year-4th-time-2024-05-08/","content":"\"It's great to the guys for buying in and coming every single night with the same mindset,\" Gobert said.\"We love to give individual awards and all these things and it's great, but you can't do it alone,\" Gobert said.\"I really have a lot of gratitude for (Timberwolves president of basketball operations) Tim Connelly, (head coach) Chris Finch, all my teammates allowing me to do what I do best every day."},"Nuggets' Murray fined $100,000 for throwing objects onto court":{"img":null,"link":"https://www.reuters.com/sports/basketball/nuggets-murray-fined-100000-throwing-objects-onto-court-2024-05-08/","content":"May 7 (Reuters) - Denver Nuggets guard Jamal Murray has been fined $100,000 for throwing a towel and a heating pad in the direction of an official during a playoff game this week, the NBA said on Tuesday.Murray was not suspended over the incident, which occurred while the Nuggets game against the Minnesota Timberwolves was in progress on Monday.Minnesota, who lead the best-of-seven Western Conference semi-finals series 2-0, host Game Three on Friday.Reigning champions Denver lost the game."},"Sparks move Fever game; Indy writer suspended after Caitlin Clark interaction":{"img":null,"link":"https://www.reuters.com/sports/sparks-move-fever-game-indy-writer-suspended-after-caitlin-clark-interaction-2024-05-07/","content":"In other Clark-related news, news emerged Tuesday that Gregg Doyel, a longtime columnist for the Indianapolis Star, is in the midst of a two-week suspension.The punishment was levied by the publication and its corporate owner, Gannett, after Doyel's awkward encounter with Clark at her introductory news conference last month.May 7 - The Los Angeles Sparks have moved their May 24 game against Caitlin Clark and the Indiana Fever to the 19,000-seat Crypto.Tickets to see the Fever and Clark, who was the No.com Arena, the team announced Tuesday."},"Sphere in Las Vegas to host 2024 NHL Draft":{"img":null,"link":"https://www.reuters.com/sports/nhl/sphere-las-vegas-host-2024-nhl-draft-2024-05-07/","content":"May 7 (Reuters) - The 2024 National Hockey League Draft will be held in Las Vegas at Sphere in what will be the first televised event from the futuristic venue, the league announced on Tuesday.The NHL Draft, which has never been held in Las Vegas before, will take place June 28-29 when the San Jose Sharks are widely expected to select Canadian forward Macklin Celebrini with the first overall pick.\"The first day of the draft will consist of the opening round followed by rounds two-seven on the second day.\"The NHL is proud to bring the first sports event and the first live television broadcast to Sphere,\" NHL Senior Executive Vice President Steve Mayer said in a news release.\"San Jose earned the right to select Celebrini by winning the NHL Draft Lottery on Tuesday that consisted of the 16 teams that failed to qualify for the 2024 Stanley Cup Playoffs."},"Blues remove interim tag from coach Drew Bannister":{"img":null,"link":"https://www.reuters.com/sports/blues-remove-interim-tag-coach-drew-bannister-2024-05-07/","content":"Before being named interim coach, Bannister compiled a 93-58-19 record in three seasons with Springfield of the American Hockey League.The Blues went 30-19-5 under Bannister's leadership but missed the playoffs for a second straight season.Louis Blues removed the interim tag from coach Drew Bannister and signed him to a two-year contract on Tuesday.From Bannister's arrival through the end of the season, the Blues had the 12th-most points (65) and the 10th-best home record (18-9-2) in the league.A defenseman from Ontario, Bannister played 164 games over six NHL seasons after being drafted by Tampa Bay in the second round in 1992."},"Connor McDavid chasing fourth Hart Trophy":{"img":null,"link":"https://www.reuters.com/sports/connor-mcdavid-chasing-fourth-hart-trophy-2024-05-07/","content":"Kucherov, who won the Hart Trophy in 2018-19, led the NHL and set a Tampa Bay Lightning record with 144 points (44 goals, league-leading 100 assists) in 81 games this season.McDavid won his third Hart Trophy last season and is looking to join Wayne Gretzky (nine), Gordie Howe (six) and Eddie Shore (four) as the only players in NHL history to win at least four.He would be the fourth active player with multiple Hart Trophy wins: McDavid (three), Ovechkin (three) and Sidney Crosby (two).In addition to winning his second Art Ross Trophy, the forward led the league in power-play points (53), power-play assists (40) and three-point games (23).McDavid, 27, contributed 132 points (32 goals, league- and career-high 100 assists) in 76 games this season while leading the Oilers to the playoffs following a 2-9-1 start to the season."},"Miami GP sets F1 record for a live U.S. television audience":{"img":null,"link":"https://www.reuters.com/sports/formula1/miami-gp-sets-f1-record-live-us-television-audience-2024-05-07/","content":"6 million, for the inaugural Miami Grand Prix in 2022.1 million viewers watching the race on ABC and a peak of 3.May 7 (Reuters) - Sunday's Miami Grand Prix drew Formula One's biggest live U.6 million, according to broadcaster ESPN.1 million."},"NHL: Ratings spike for Bruins-Leafs, first-round playoff games":{"img":null,"link":"https://www.reuters.com/sports/nhl-ratings-spike-bruins-leafs-first-round-playoff-games-2024-05-07/","content":"The average and peak figures were increases of 59 and 37 percent from Game 7 of the first-round series between the New York Rangers and New Jersey Devils last season.1 million -- making it the most-watched first-round game since 2012 and third highest ever.The average viewership of 934,000 was second highest all-time for the first round.Those figures were increases of 49 and 33 percent from the Game 1, second-round average last season.May 7 - The Boston Bruins' overtime victory over the Toronto Maple Leafs in Game 7 on Saturday was the most-watched first-round playoff game across North America on record, the NHL said Tuesday."},"Brazil's bid to host the Women's World Cup tops European rival":{"img":null,"link":"https://www.reuters.com/sports/soccer/brazils-bid-host-womens-world-cup-tops-european-rival-2024-05-08/","content":"\"The Bid Evaluation Task Force has determined that both bids qualify for consideration by the FIFA Council and the FIFA Congress, as both bids have exceeded the minimum requirements for hosting the FIFA Women's World Cup 2027 in the technical evaluation,\" FIFA said in a press release.\"The world soccer governing body bid report came ahead of the vote at the 74th FIFA Congress in Bangkok on May 17, which will decide where the next Women's World Cup will be held.May 7 (Reuters) - Brazil's bid to host the 2027 Women's World Cup scored higher than its rival, a joint bid from Belgium, Netherlands and Germany, in a FIFA's evaluation report released on Tuesday.According to the report, Brazil's bid offers good stadiums, having already hosted the 2021 World Cup.Both bids can therefore be considered by the FIFA Council for submission to the FIFA Congress ahead of the final vote to select the host(s) of the FIFA Women's World Cup 2027,\" it added."},"MLB roundup: Bryce Harper carries Phillies to 6th straight win":{"img":null,"link":"https://www.reuters.com/sports/mlb-roundup-bryce-harper-carries-phillies-6th-straight-win-2024-05-07/","content":"Royals 3, Brewers 2Maikel Garcia hit a go-ahead, two-run single up the middle in the seventh inning as host Kansas City rallied to beat Milwaukee in the opener of a three-game series.Rangers 4, Athletics 2Corey Seager launched a two-out, two-strike, three-run home run in the eighth inning, rallying visiting Texas to a victory over Oakland in the opener of a four-game series.Gary Sanchez hit a two-run homer for the Brewers, who have lost three straight and six of their past nine.Right-hander Roddery Munoz (1-1) was touched for six runs on seven hits with four walks in 4 2/3 innings, his worst outing of his three career starts.May 7 - Bryce Harper homered, singled and drove in three runs, Zack Wheeler tossed seven strong innings and the host Philadelphia Phillies defeated the San Francisco Giants 6-1 to complete a four-game series sweep on Monday."},"Red Bull have taken 220 staff from Mercedes, says Horner":{"img":null,"link":"https://www.reuters.com/sports/formula1/red-bull-have-taken-220-staff-mercedes-says-horner-2024-05-07/","content":"May 7 (Reuters) - Red Bull boss Christian Horner has responded to claims staff were increasingly looking to leave his team by saying the Formula One champions have so far taken 220 from rivals Mercedes.Mercedes boss Toto Wolff, who has been making overtures to Red Bull's triple world champion Max Verstappen with Ferrari-bound Lewis Hamilton's seat to fill, said his team had \"seen Red Bull CVs through all of the levels.Dominant Red Bull have been unsettled by allegations against Horner of misconduct towards a female employee, which the boss has denied and been cleared of.\"We’ve taken 220 people, 220 out of HPP (Mercedes AMG's High Performance Powertrains) into Red Bull Powertrains, so when we’re talking of losing people, I’d be a bit more worried about the 220 than maybe one or two CVs.\"Red Bull are building their own powertrain for 2026, when the sport undergoes a major engine rule change, with a major expansion at their Milton Keynes facility."},"Maradona's Golden Ball trophy goes to auction":{"img":null,"link":"https://www.reuters.com/sports/soccer/maradonas-golden-ball-trophy-goes-auction-2024-05-07/","content":"May 7 (Reuters) - Diego Maradona's Golden Ball trophy won for being named the best player at the 1986 World Cup will be auctioned in France in June, the Aguttes auction house said on Tuesday.The Golden Ball award was introduced at the 1982 World Cup, and its list of winners include Italy's Paolo Rossi, Romario and Ronaldo of Brazil, Zinedine Zidane of France, while Argentine great Lionel Messi is the only player to have won the accolade twice.Maradona, who died in 2020, won the award after leading Argentina to World Cup victory in Mexico, scoring five goals at the finals where he captained his country and played every minute of the tournament.This is the first Golden Ball to go for auction and while the value is still to be confirmed, the auction house expects it to fetch millions on June 6.After his display against England, Maradona went on to score the two goals which defeated Belgium in the semi-final and Argentina won a thrilling final 3-2 against West Germany."},"Thunder, Mavericks look for more from stars as series opens":{"img":null,"link":"https://www.reuters.com/sports/thunder-mavericks-look-more-stars-series-opens-2024-05-07/","content":"\"That defender, Luguentz Dort, was a big reason Oklahoma City dispatched the Pelicans quickly in the first round and advanced to the second round for the first time since the 2016 run to the Western Conference finals.\"\"Though Hardaway will be back, Dallas will be without reserve power forward/center Maxi Kleber, who suffered a dislocated AC joint in his right shoulder in the series-clinching Game 6 win over the Clippers, and Olivier-Maxence Prosper, who suffered an ankle injury early in the first-round series.But as they prepare for their Western Conference second-round matchup, which begins Tuesday in Oklahoma City, both teams likely will need more from their top players -- the Thunder's Shai Gilgeous-Alexander and the Mavericks' Luka Doncic.In Oklahoma City's first-round sweep of New Orleans, Gilgeous-Alexander averaged 27.May 7 - The Oklahoma City Thunder and Dallas Mavericks advanced out of the first round without stellar performances from their superstars."},"Pegula unsure about French Open participation":{"img":null,"link":"https://www.reuters.com/sports/tennis/pegula-unsure-about-french-open-participation-2024-05-07/","content":"May 7 (Reuters) - World number five Jessica Pegula said she is feeling better after shaking off an injury that derailed her claycourt season but the American is unsure if she will play at the French Open, which starts on May 26.Open, but has struggled this season due to illness and injuries.The 30-year-old was one of the most consistent players on the WTA Tour last season, winning the Montreal title in the build-up to the U.Pegula, who also missed tournaments in the Middle East in February due to a neck issue, last competed in the Billie Jean King Cup in April.\"Hi guys - quick update - will miss Rome and possibly RG."},"Milan outsprints Groves to win Giro stage four, Pogacar leads":{"img":null,"link":"https://www.reuters.com/sports/cycling/milan-outsprints-groves-win-giro-stage-four-pogacar-retains-lead-2024-05-07/","content":"May 7 (Reuters) - Italy's Jonathan Milan went one better than the previous day to win the sprint and take the fourth stage of the Giro d'Italia on Tuesday after an early breakaway was reeled in as Tadej Pogacar maintained the overall lead.Lidl-Trek rider Milan went to the front close to the line and, despite the best efforts of Australia's Kaden Groves (Alpecin-Deceuninck), the Italian held on to make up for missing out on winning stage three when he was outsprinted by Tim Merlier.Eritrea's Biniam Girmay of Intermarche-Wanty, who finished third in stage three, crashed in wet conditions and is out of the race.Germany's Phil Bauhaus of Bahrain Victorious finished third on the 190km ride from Acqui Terme to Andora, which featured a very early breakaway before the peloton brought them back to set up the expected sprint finish.\"The Italian won a Giro stage last year where he also took the maglia ciclamino for the points classification, and Milan leads that category after overtaking Merlier who finished fifth."},"Vingegaard back on bike outside, hopeful for Tour defence":{"img":null,"link":"https://www.reuters.com/sports/cycling/vingegaard-back-bike-outside-hopeful-tour-defence-2024-05-07/","content":"May 7 (Reuters) - Denmark's twice Tour de France champion Jonas Vingegaard is back riding outside for the first time since his crash last month, and is hopeful of defending his title, the Team Visma-Lease a Bike rider said on Tuesday.\"This is the first time back on the bike for me, riding outside, and it's really nice to be able to ride like normal again,\" Vingegaard said in a video on social media platform X.\"\"The Tour de France begins on June 29 in Florence, Italy, and ends on July 21 in Nice.Vingegaard won the last two editions of the Tour de France, but his participation was in doubt after suffering a broken collarbone and several broken ribs during the Tour of the Basque Country.Of course, I hope to be there at the start of the Tour de France, we don't know exactly how my shape and how my recovery will go, but I will do everything I can to get there in my top shape."}}