{"Fiorentina GM Barone dies after suffering cardiac arrest":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/Y34XUUA55ZKALI6ZNQ2ALCP4UY.jpg","link":"https://www.reuters.com/sports/soccer/fiorentina-gm-barone-dies-after-suffering-cardiac-arrest-2024-03-19/","content":"General Director Giuseppe Barone passed away today at the San Raffaele Hospital in Milan after suddenly falling ill on Sunday,\" it said.March 19 (Reuters) - Fiorentina general manager Joe Barone has died aged 57 after suffering a cardiac arrest, the Serie A club said on Tuesday.Fiorentina had said on Monday that Barone remained in hospital on life support after collapsing on Sunday as the team were leaving the hotel for their Serie A match at Atalanta, which was postponed.\"It is with deep sorrow and immense sadness that Fiorentina confirms the loss of one of its figureheads, a person who has marked the recent history of the club and who will never be forgotten,\" the club said in a statement, opens new tab.\""},"Man City to play Barca, Chelsea, among others in US pre-season tour":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/NCZCC2SMLVMPJLQRQJ7CLPK3QI.jpg","link":"https://www.reuters.com/sports/soccer/man-city-play-barca-chelsea-among-others-us-pre-season-tour-2024-03-19/","content":"March 19 (Reuters) - Manchester City will face Celtic, AC Milan, Barcelona and Chelsea in their 2024-25 pre-season tour to the United States in July, the Premier League club said on Tuesday.City, third in the league standings and aiming to repeat the treble, will kick off their preparation for the new campaign against Scottish Premiership side Celtic on July 23 before playing Serie A's Milan at the Yankee Stadium four days later.They will then travel to Florida to take on manager Pep Guardiola's former club, Barcelona, on July 30 and end the four-match tour with a game against Chelsea on Aug.Having toured Asia before the current season, City return to the U.following their 2022 pre-season visit."},"Man Utd's Mainoo gets first England call-up":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/6QM74BVRRNOGJNN6TUDJQNNCC4.jpg","link":"https://www.reuters.com/sports/soccer/manchester-utds-mainoo-gets-first-england-call-up-2024-03-19/","content":"March 19 (Reuters) - Manchester United midfielder Kobbie Mainoo has received his first England senior call-up ahead of their two friendlies, the national team said on Tuesday, after the youngster's impressive run at the Premier League club.\"It's an honour to receive my first senior call-up,\" Mainoo posted on Instagram.Everton defender Jarrad Branthwaite and Newcastle United winger Anthony Gordon were also handed their first international call-ups by Southgate last week .The 18-year-old, who was initially part of the Under-21s squad for this month's U-21 Euro 2025 qualifiers, has been drafted into manager Gareth Southgate's team for matches at Wembley against Brazil on March 23 and Belgium on March 26.Mainoo, who has represented England at Under-17, Under-18 and Under-19 levels, reported to St."},"Phillies, Bryce Harper not yet concerned by back trouble":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/564Z5JBXYJJXPJ7EV5ER2DT2Q4.jpg","link":"https://www.reuters.com/sports/phillies-bryce-harper-not-yet-concerned-by-back-trouble-2024-03-19/","content":"Harper sat out Monday for the fourth consecutive spring training game with soreness in his lower back.March 19 - Philadelphia Phillies first baseman Bryce Harper was prescribed rest for his ailing back and anticipates rejoining the lineup on Friday.Given back issues in the past, Harper is aware of outside concern about his availability early in the season.\"I said, ‘If it's back field or big field, I'll get my at-bats.'\"When I talked to Thomper, when I told him I was a little sore, he was like, ‘All right, we'll just throw you down a little bit and pick you back up next week."},"World Rugby reveal plans to speed up the game":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/XR5F7LTW5VII3JSQVTD4KGXEV4.jpg","link":"https://www.reuters.com/sports/world-rugby-reveal-plans-speed-up-game-2024-03-19/","content":"March 19 (Reuters) - World Rugby have revealed plans aimed at \"reimagining rugby’s entertainment factor\", including 20 minute sanctions for red cards, quickening of ball from the ruck and maul, and a set time to complete scrums and lineouts, officials confirmed on Tuesday.The World Rugby Council will also consider further amendments at their May 9 meeting, including an adjustment to the onside law when there are kicks in open play.World Rugby will also ask unions to implement a set of trials in their domestic competitions that will put a limit on the amount of time taken for scrums and lineouts to be completed, similar to the ‘shot clock’ for penalties and conversions.World Rugby will also look at the number and timing of replacements \"to create more space on the field while improving injury rates\", potentially nullifying the Springboks' famed ‘Bomb Squad’ that was used to win the last two World Cups.\"A specialist working group will be set up to explore a revised punishment for red card offences whereby the sanctioned player’s place on the field can be taken by a teammate after 20 minutes, nullifying the numerical advantage for their opponents."},"Fenerbahce to consider withdrawing from Super Lig after players attacked":{"img":null,"link":"https://www.reuters.com/sports/soccer/fenerbahce-consider-withdrawing-super-lig-after-players-attacked-2024-03-18/","content":"FIFA President Gianni Infantino condemned the incident earlier on Monday, saying violence in the Turkish Super Lig is \"unacceptable\".March 18 (Reuters) - Fenerbahce will consider withdrawing from the Turkish top flight after some of their players were attacked by Trabzonspor fans following their weekend away win, the Super Lig club said on Monday.The agenda points include evaluation of the actions to be taken following the incident \"including the withdrawal of our football Team A from the Super Lig\", a club statement read.Trabzonspor supporters stormed the pitch and brawled with security forces and Fenerbahce players after their team lost 3-2 on Sunday in the latest incident in a league that has been marred by controversy this season.Fenerbahce will hold an Extraordinary General Assembly Meeting on April 2, the Board of Directors decided on Monday."},"Germany's teenager Pavlovic to miss matches against France, Netherlands":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/6RFJ7KGLCBIGFD5SWZ4S3S2TJY.jpg","link":"https://www.reuters.com/sports/soccer/germanys-teenager-pavlovic-miss-matches-against-france-netherlands-2024-03-19/","content":"The Germans will also play Ukraine in Nuremberg on June 3 before taking on Greece in Moenchengladbach four days later in their last friendly matches before the start of Euro 2024.FRANKFURT, Germany, March 19 (Reuters) - Bayern Munich midfielder Aleksandar Pavlovic will have to wait a little longer for his Germany debut with the teenager ruled out of their friendly internationals against France and Netherlands later this month, his club said on Tuesday.The 19-year-old, who has been having a sensational season at Bayern as a defensive midfielder, was one of six newcomers named in Germany coach Julian Nagelsmann's squad last week for their two friendly matches but is now out with tonsillitis.The Germans, hosts of Euro 2024 starting on June 14, travel to France on March 23 before hosting the Dutch three days later, with Nagelsmann eager to test players in his effort to build a tournament-ready team in less than 100 days.trip in October followed by two straight losses in Austria and at home against Turkey in November."},"Russia's 'Friendship Games' are politically motivated and violate Olympic Charter-IOC":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/Z7QMFTX3E5KXHBNA7YTLH6BGQI.jpg","link":"https://www.reuters.com/sports/russias-friendship-games-are-politically-motivated-violate-olympic-charter-ioc-2024-03-19/","content":"The IOC, which banned the Russian Olympic Committee (ROC) in October for recognising regional Olympic councils for Russian-occupied regions of Ukraine - Luhansk, Donetsk, Kherson and Zaporizhzhia, has allowed athletes from Russia and Belarus to qualify for and compete at the Paris 2024 Olympics this year.Russia's announcement last year came with their athletes and those of ally Belarus having been largely frozen out of international competition by federations in the wake of the Russian invasion of Ukraine, which Moscow calls a \"special military operation\".The Russian government created and funded the 'International Friendship Association' (IFA), in order to host the summer and winter 'Friendship Games',\" it said.\"The IOC notes that, contrary to the Fundamental Principles of the Olympic Charter and the resolutions by the UN General Assembly, the Russian government intends to organise purely politically motivated sports events in Russia,\" the IOC said in a statement.\"\"For this purpose, the Russian government has launched a very intensive diplomatic offensive by having government delegations and ambassadors, as well as ministerial and other governmental authorities, approaching governments around the world,\" the IOC said.\""},"Germany to play Ukraine and Greece in last friendlies before Euro 2024":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/NOBFTUEXEJKJTCOWZ3WOTJ73CA.jpg","link":"https://www.reuters.com/sports/soccer/germany-play-ukraine-greece-last-friendlies-before-euro-2024-2024-03-19/","content":"BERLIN, March 19 (Reuters) - Hosts Germany will play two friendly matches against Ukraine and Greece in June days before the start of the European championships on home soil, the team said on Tuesday.The Germans will host Ukraine in Nuremberg on June 3 before taking on Greece in Moenchengladbach four days later.The Germans travel to France on March 23 and host the Netherlands three days later in their friendly matches this month.There is now mounting pressure in Germany for Nagelsmann and his team to start delivering with the Euros less than 100 days away.Ukraine and Greece are two fighting, passionate teams and we had problems with such opponents lately."},"Kroos relaxed about new deal with Real Madrid and Germany comeback":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/Y23H6IS7RZNAJLWFVZDJOUKMEY.jpg","link":"https://www.reuters.com/sports/soccer/kroos-relaxed-about-new-deal-with-real-madrid-germany-comeback-2024-03-19/","content":"FRANKFURT, Germany, March 19 (Reuters) - Germany midfieder Toni Kroos, who has returned to the national team after coming out of a three-year international retirement, did not rule out staying on past Euro 2024 while also eyeing a new deal with club Real Madrid.\"It helps a team when three of four people who have played tournaments are there but they still have to be good.\"\"The midfielder's contract with Real runs out at the end of the current campaign but Kroos said he had also extended his previous deal late in the season and there were no problems with the club.\"The club is having a good season and so am I.My relationship with the club is too good to have any issues."},"Asian champions Qatar shift focus as World Cup preliminaries resume":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/N4VZ3BDAMNMQLCOBWSLUECVFZI.jpg","link":"https://www.reuters.com/sports/soccer/asian-champions-qatar-shift-focus-world-cup-preliminaries-resume-2024-03-19/","content":"Group G leaders Saudi Arabia play second-placed Tajikistan with Roberto Mancini's side holding a two-point lead over the surprise Asian Cup quarter-finalists.On Thursday, the Japanese face the first of two meetings with North Korea, playing in Tokyo before a tricky trip to Pyongyang on Tuesday for Hajime Moriyasu's side in their first internationals since underperforming at the Asian Cup.Qatar hosted the 2022 World Cup but have never qualified for the finals, with Japan, South Korea, Australia, Iran and Saudi Arabia claiming the Asian berths at the most recent edition.HONG KONG, March 19 (Reuters) - Qatar will resume their quest for a first-ever qualification for the World Cup against Kuwait on Thursday with stability in the dugout but change on the pitch six weeks after retaining the Asian Cup on home soil.South Korea go into their meeting with Thailand under Hwang Sun-hong, the interim replacement for Juergen Klinsmann following the German's post-Asian Cup sacking."},"Real Madrid slam referee for not reporting abuse against Vinicius Jr":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/CUOJ6LETWRJRFEFZ6SRNW3I2AM.jpg","link":"https://www.reuters.com/sports/soccer/real-madrid-slam-referee-not-reporting-abuse-against-vinicius-jr-2024-03-18/","content":"March 18 (Reuters) - Real Madrid have filed a complaint against the referee who handled their game at Osasuna on Saturday for not including alleged racist insults aimed at their forward Vinicius Jr in his match report, the club said in a statement on Monday.\"Real have also extended the complaint they filed with the state prosecutor's office on Friday over hate and discrimination offences after alleged racist chanting by Atletico Madrid and Barcelona fans directed at the Brazil forward.\"\"Our club has filed a complaint with the Disciplinary Committee of the Spanish Football Federation (RFEF) against the referee of the match Juan Martinez Munuera,\" Real said.\"Real Madrid once again condemns these violent attacks of racism, discrimination and hatred, and demands that the necessary measures be taken, once and for all, to eradicate the violence that our player Vinicius Junior has been suffering.The 23-year-old Brazil international, who scored twice as La Liga leaders Real won 4-2 at the El Sadar Stadium, has been subjected to racial abuse on several occasions in Spain."},"Messi sidelined for Argentina friendlies with injury":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/DP6VTJIY45NKFPWVBBTTNQAJNQ.jpg","link":"https://www.reuters.com/sports/soccer/messi-sidelined-argentina-friendlies-with-injury-2024-03-18/","content":"due to a minor right hamstring injury sustained in the Inter Miami game against Nashville,\" the AFA said on its official X account.The 36-year-old forward missed Inter Miami's Major League Soccer game at DC United on Saturday after coming off injured in their midweek CONCACAF Champions League win against Nashville.March 18 (Reuters) - Argentina captain Lionel Messi is out of this month's friendlies in the United States due to a hamstring injury, the country's FA (AFA) said on Monday.Messi is the latest absence for Lionel Scaloni's side following injuries to AS Roma forward Paulo Dybala, Bayer Leverkusen midfielder Exequiel Palacios and Bournemouth defender Marcos Senesi.Argentina will face El Salvador on Friday at Lincoln Financial Field in Philadelphia before playing Costa Rica four days later at the Los Angeles Coliseum."},"F1 driver Gasly invests in French third-tier soccer club":{"img":"https://cloudfront-us-east-2.images.arcpublishing.com/reuters/H7EYSOMGGNJK3DDBO66KCHYYIQ.jpg","link":"https://www.reuters.com/sports/formula1/f1-driver-gasly-invests-french-third-tier-soccer-club-2024-03-19/","content":"PARIS, March 18 (Reuters) - Formula One driver and Paris St Germain fan Pierre Gasly has become an investor in third-tier French semi-professional soccer club FC Versailles.\"I am delighted to get involved with FC Versailles because I have always wanted to get involved in professional football,\" said the 2020 Italian Grand Prix winner.\"\"Versailles once had France great Thierry Henry as a youth player as well as former France midfielder Hatem Ben Arfa.Go Versailles.The 28-year-old, who drives for Renault-owned Alpine, was announced on the club's website on Monday as the third partner owner."},"Mbappe's reduced playing time with PSG may benefit France, Deschamps says":{"img":null,"link":"https://www.reuters.com/sports/soccer/mbappes-reduced-playing-time-with-psg-may-benefit-france-deschamps-says-2024-03-19/","content":"France under-23 coach Thierry Henry said on Monday that Real had turned down a request to release players for the Games.March 19 (Reuters) - Kylian Mbappe's reduced playing time with Paris St Germain in recent weeks could be good news for the France national team as it may keep him fresh for the European Championship and Olympic Games, manager Didier Deschamps said.\"If that fatigue can be reduced a little (all the better),\" the French coach added ahead of a friendly against Germany on March 23.Mbappe, who has been linked with a move to Real Madrid, has said he hopes to participate at this summer's Paris Olympics but a move to the LaLiga leaders may prevent him from doing that.14, a 2-1 Champions League win at Real Sociedad, a 3-1 French Cup win over Nice and a 6-2 league win over Montpellier on Sunday."},"Russia government becoming more aggressive towards Olympic movement, Bach says":{"img":null,"link":"https://www.reuters.com/sports/russia-government-becoming-more-aggressive-towards-olympic-movement-bach-says-2024-03-19/","content":"\"In the Olympic world, we have had for 30 years what the political world calls a two-state solution: we have an Israeli National Olympic Committee and a Palestinian National Olympic Committee.\"We will be able to rely on our Olympic solidarity programme, which stipulates that at least six athletes per National Olympic Committee are required,\" he said.Unlike the Russian Olympic Committee, the Israeli Olympic Committee has not violated the Olympic Charter,\" the German said.PARIS, March 19 (Reuters) - Russia's government is becoming increasingly aggressive towards the International Olympic Committee as the Paris Games draw near, IOC President Thomas Bach said on Tuesday.The IOC will allow Russian and Belarusian athletes who qualify to take part as neutrals without their countries' flags, emblems or national anthems."},"British government to introduce independent football regulator":{"img":null,"link":"https://www.reuters.com/sports/soccer/premier-league-study-football-governance-bill-2024-03-18/","content":"\"The government announcement comes after the Premier League last week failed to agree a new financial settlement with the English Football League (EFL), which runs the professional game in lower tiers.\"If over the coming seasons the Premier League ceases to be the best league in the world, it will be down to an interfering government.\"This means we will be competing with teams from leagues in Europe who give a fraction of the money Premier League clubs give to both the EFL and grassroots football.This bill is a historic moment for football fans – it will make sure their voices are front and centre, prevent a breakaway league, protect the financial sustainability of clubs, and protect the heritage of our clubs big and small.The regulator will be independent of government and football authorities with the power to fine clubs up to 10% of their turnover for non-compliance with financial regulations, the government said in a press release, opens new tab."},"Anthony Edwards leads Wolves to season-series sweep of Jazz":{"img":null,"link":"https://www.reuters.com/sports/basketball/anthony-edwards-leads-wolves-season-series-sweep-jazz-2024-03-19/","content":"Naz Reid finished with 17 points before leaving the game early because of a head injury, and former Jazz guard Nickeil Alexander-Walker hit three 3-pointers en route to 13 points off the bench in the Timberwolves' third straight victory.March 19 - Anthony Edwards scored 13 of his 32 points in the fourth quarter to lift the Minnesota Timberwolves to a 114-104 win over the Utah Jazz on Monday night in Salt Lake City.Utah, which led by as many as 16 points in the first half, took a short-lived lead early in the fourth quarter after a three-point play from Markkanen.Collin Sexton paced Utah (29-39) with 24 points in a reserve role, while Lauri Markkanen, back after a six-game absence due to a quad injury, finished with 22 points and 12 rebounds.Edwards temporarily left the court after injuring his finger while violently dunking over John Collins in the third quarter, but he came back to finish off a three-point play from the free-throw line after a timeout."},"Malik Monk's OT explosion lifts Kings over Grizzlies":{"img":null,"link":"https://www.reuters.com/sports/basketball/malik-monks-ot-explosion-lifts-kings-over-grizzlies-2024-03-19/","content":"Monk scored four straight baskets, fed Sabonis for a dunk and made two technical free throws during a 12-0 run in which the Kings turned a two-point overtime deficit into a 117-107 lead with 1:09 remaining.Bane's left-hand layup gave Memphis a two-point lead with 33.March 19 - Malik Monk scored 12 of his 28 points in overtime and added six rebounds and six assists to lead the Sacramento Kings to a 121-111 victory over the visiting Memphis Grizzlies on Monday night.De'Aaron Fox added 23 points, 10 assists, seven rebounds and three steals, Keegan Murray had 15 points and 10 rebounds and Harrison Barnes tallied 11 points for the Kings.Monk later made two free throws with 23."}}