{" Columbia University Cancels Main Graduation Ceremony Over Gaza Protests ":{"img":"https://c.ndtvimg.com/2024-05/phhn0drg_columbia-university_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/columbia-university-cancels-main-graduation-ceremony-over-gaza-protests-5601958","content":"New York City police cleared a Columbia campus building last weekColumbia University on Monday cancelled its university-wide commencement ceremony scheduled for May 15 in favour of smaller, school-based events after weeks of pro-Palestinian protests roiled the Ivy League School.New York City police cleared a Columbia campus building last week that had been barricaded by pro-Palestinian protesters, arresting more than 100 people and dismantling an encampment.\"We have decided to make the centerpiece of our commencement activities our Class Days and school-level ceremonies, where students are honored individually alongside their peers, rather than the University-wide ceremony that is scheduled for May 15,\" Columbia said in a statement, calling the past few weeks \"incredibly difficult for our community.\"The majority of the ceremonies, which had been set to take place on the Morningside Heights campus where most of the protests have taken place, will be moved to the university's main athletic complex, the statement said."}," Israel Strikes 2 Rafah Areas Where It Ordered Evacuation: Gaza Officials ":{"img":"https://c.ndtvimg.com/2024-05/u64huhig_rafah-reuters_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/israel-strikes-2-rafah-areas-where-it-ordered-evacuation-gaza-officials-5601607","content":"Benjamin Netanyahu has vowed to send ground troops in against Hamas (File)Gaza civil defence and aid officials said Monday that Israeli jets struck two areas in eastern Rafah the Israeli military had ordered to be evacuated, ahead of a possible ground invasion of the Palestinian city.\"The areas targeted by the Israeli occupation are near the perimeter of Gaza International Airport, the Al-Shuka area, the Abu Halawa area, the Salaheddin street area and the Salam neighbourhood,\" Gaza civil defence agency spokesman Ahmed Ridwan told AFP.The Israeli military did not offer an immediate comment, but earlier on Sunday it ordered residents of Al-Shuka and Al-Salam to evacuate and move to a humanitarian area.Osama al-Kahlut from the emergency operations department of the Red Crescent Society told AFP that the bombing was targeting eastern areas of Rafah."}," Hezbollah Says Launches Dozens Of Rockets At Israeli Base In Retaliation ":{"img":"https://c.ndtvimg.com/2024-04/m82ddhoo_israel-hezbollah_625x300_23_April_24.jpeg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/hezbollah-says-launches-dozens-of-rockets-at-israeli-base-in-retaliation-5601556","content":"In recent weeks Hamas-ally Hezbollah has stepped up its attacks on northern Israel, and the Israeli military has struck deeper into Lebanese territory.Hezbollah later claimed a drone attack on troops in northern Israel, with the Israeli army saying \"a UAV (drone) was identified crossing from Lebanon into the area of Metula\".(File)Lebanese official media said an Israeli strike Monday wounded three people in the country's east, with Hezbollah saying it launched \"dozens of Katyusha rockets\" at an Israeli base in retaliation.On Sunday official media in Lebanon said an Israeli strike on a southern village killed four family members, with Hezbollah announcing retaliatory attacks."}," Student Stabbed To Death By Fellow Indian In Australia: Was Mediating In Row ":{"img":"https://c.ndtvimg.com/2024-05/tc9g4rug_indian-student-murder-accused_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/indians-abroad/student-22-stabbed-trying-to-break-up-fellow-indians-fight-in-australia-5601546","content":"(Representational)A 22-year-old Indian student, studying MTech in Australia, was allegedly stabbed to death when he tried to intervene in a fight between a group of Indian students, said the victim's uncle today.According to the victim's uncle, Navjeet Sandhu was \"fatally stabbed in the chest\" with a knife by another student when he was trying to mediate a confrontation in a rent related dispute between a group of Indian students.com/CmKlCtXz6r\"A search is currently underway for brothers Abhijeet and Robin Gartan, both of Indian descent\" says the Victoria Police department\"Abhijeet is 26-years-old and described as being 170 cm tall with a solid build and black hair, Gartan is 27-years-old and is also described as being 170 cm tall with a solid build and black hair\", they added.Navjeet was on a one-and-a-half-year work visa in Australia, according to Yashvir."}," Officials At US Airport Find Bag Of Snakes Hidden In Passenger's Pants, Share Pics ":{"img":"https://c.ndtvimg.com/2024-05/ent4qbpo_snakes-hidden-in-passengers-trousers_625x300_06_May_24.jpg","link":"https://www.ndtv.com/world-news/officials-at-us-airport-find-bag-of-snakes-hidden-in-passengers-pants-share-pics-5601383","content":"@TSA called our @CBPSoutheast and Miami-Dade Police partners in to assist, and the snakes were turned over to the Florida Fish and Wildlife Conservation Commission,\" the post on X read.See the tweet here:Officers at @iflymia detected this bag of snakes hidden in a passenger's pants at a checkpoint on Fri, April 26.@TSA called our @CBPSoutheast and Miami-Dade Police partners in to assist, and the snakes were turned over to the Florida Fish and Wildlife Conservation Commission.\"Officers at @iflymia detected this bag of snakes hidden in a passenger's pants at a checkpoint on Fri, April 26."}," Cannes Film Festival Workers Call For Strike Over Pay A Week Before Event ":{"img":"https://c.ndtvimg.com/2024-05/drrr1vu8_cannes_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/cannes-film-festival-workers-call-for-strike-over-pay-a-week-before-event-5601273","content":"The forthcoming opening of the Cannes Film Festival has a bitter taste for us this year,\" it added.(File)Workers at the Cannes Film Festival called for a strike over pay and conditions on Monday, just a week before the event was due to start.\"The strike will not put the opening of the festival at risk but there could be disruptions as it goes on,\" a spokesperson told AFP.This year's festival is due to run from May 14 to 25, with icons including Francis Ford Coppola, Georges Lucas and Meryl Streep set to attend."}," Meghan Markle Got \"Rare Honour\" From King Charles Before Leaving UK, Says Royal Expert ":{"img":"https://c.ndtvimg.com/meghan-markle-prince-charles_625x300_1526727345322.jpg","link":"https://www.ndtv.com/world-news/meghan-markle-got-rare-honour-from-king-charles-before-leaving-uk-says-royal-expert-5601269","content":"Meghan Markle, Duchess of Sussex, was given a \"rare honour\" from King Charles, then Prince, before she along with her husband Prince Harry stepped back from their duties, according to a royal expert.BBC royal correspondent Micheal Cole told GBN America about how it went \"so badly wrong\" for Ms Markle and putting it all together is \"really hard\".\"In 2020, Prince Harry and his wife Meghan Markle announced that they would be stepping away from royal duties and since then the couple has been living with their two children in the United States.She could not have been welcomed more into this country or the Royal Family,\" he said on GBN America."}," US Teen Who Slapped Teacher In Classroom Faces Kidnapping, Assault Charges ":{"img":"https://c.ndtvimg.com/2024-05/qc4sjff_us-teen-slaps-teacher_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/us-teen-who-slapped-teacher-in-classroom-faces-kidnapping-assault-charges-5601132","content":"Watch the video:NEW: North Carolina high school student who went viral for hitting his teacher has been smacked with felony charges & is being charged as an adult.A US high school student, who attacked two teachers in school premises, has been hit indicted on assault and kidnapping charges, according to a report in Fox News.17-year-old Aquavis Hickman has been indicted on assault and kidnapping charges for two separate… pic.A video of 17-year-old Aquavis Hickman hitting one of the teachers in the classroom in April had gone viral on social media, leading to a barrage of comments."}," 'Where Can We Go?': Gazans In Rafah As Israel Demands Evacuation ":{"img":"https://c.ndtvimg.com/2024-05/1k6ecrdo_israel-gaza-war_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/palestinians-in-rafah-prepare-to-flee-ahead-of-possible-ground-assault-5601123","content":"For your safety, the IDF (Israeli military) tells you to evacuate immediately towards the expanded humanitarian zone of al-Mawasi,\" it said, with a map indicating the location to the north of Rafah.Palestinian civilians in the southern Gazan city of Rafah voiced despair on Monday as Israel dropped fliers urging them to evacuate for their own \"safety\" ahead of a \"limited\" military operation.\"Gaza's bloodiest-ever war broke out following Hamas's unprecedented October 7 attack on Israel which resulted in the deaths of more than 1,170 people, mostly civilians, according to an AFP tally of Israeli official figures.\"An Israeli military spokesman told reporters that the evacuation \"is part of our plans to dismantle Hamas ..."}," One Year On, A Low-Key Coronation Anniversary For Britain's King Charles ":{"img":"https://c.ndtvimg.com/2024-05/t47r62eo_charles-coronation-anniversary_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/one-year-on-a-low-key-coronation-anniversary-for-britains-king-charles-5601033","content":"Britain's King Charles III on Monday marked the first anniversary of his coronation following a difficult year that has seen a cancer diagnosis and continuing tensions with his estranged son Prince Harry.The double blow of both King Charles and Catherine's ill health has left the royal family with a shortage of frontline royals with William also stepping back for a while to help care for his wife and family.But King Charles and Catherine's absence was felt even more keenly as the king's younger son Harry is no longer a working royal.The Archbishop of Canterbury Justin Welby who crowned King Charles a year ago at Westminster Abbey praised his \"sense of duty\"."}," Ukraine Restores Power To Households After Overnight Russian Strikes ":{"img":"https://c.ndtvimg.com/2024-05/h7e7bipo_ukraine-power-generic_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/ukraine-restores-power-to-households-after-overnight-russian-strikes-5600988","content":"Moscow has intensified strikes on Ukraine's energy facilities (Representational)Ukraine on Monday restored power to most of the households that lost electricity during overnight Russian strikes on the northern region of Sumy, the regional operator said.In the neighbouring Kharkiv region \"repeated strikes caused new damage to the power grids\" leaving 32,600 households without electricity in the morning, the energy ministry said.\"As of 12:00 pm (1000 GMT) on May 6, there are 15,240 (households) in the Sumy region without electricity as a result of the Russian attack,\" the regional electricity operator said.The regions of Sumy and Kharkiv bordering Russia have seen intensified strikes, amid speculation of an upcoming Russian offensive in these areas."}," Israel Army Says \"Encourages\" Gazans In East Rafah To Head To \"Humanitarian Area\" ":{"img":"https://c.ndtvimg.com/2024-05/bdad59e_rafah-assault_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/israel-army-says-encourages-gazans-in-east-rafah-to-head-to-humanitarian-area-5600927","content":"The Israeli army Monday called on Gazans living in eastern Rafah to head to an \"expanded humanitarian area\" in the Palestinian territory, ahead of an expected military operation in the southern Gaza city.\"The IDF has expanded the humanitarian area in Al-Mawasi to accommodate the increased levels of aid flowing into Gaza,\" the military statement said, referring to a coastal area near Rafah.\"\"IDF (military) encourages the residents of eastern Rafah to advance towards expanded humanitarian area,\" the military said in a statement.In its statement, the military added that messages \"to temporarily move to the humanitarian area will be conveyed through posters, SMS messages, phone calls and media broadcasts in Arabic."}," Russian Man Accused Of Trying To Blow Up Courts On Ukraine's Behalf Detained ":{"img":"https://c.ndtvimg.com/2022-11/iof8givc_arrest-generic_625x300_30_November_22.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/russian-man-accused-of-trying-to-blow-up-courts-on-ukraines-behalf-detained-5600860","content":"(Representational)A Russian man accused of trying to blow up two court buildings on behalf of Ukraine has been detained and charged with terrorism, Russia's FSB security services said on Monday.Moscow has reported dozens of sabotage attacks on Russian territory since sending troops into Ukraine more than two years ago, blaming most of them on Kyiv and its supporters.Later inspection of the objects revealed they were \"two homemade explosive devices\", which the man planned to detonate near two court buildings in the city, it alleged.According to the FSB, the suspect regularly visited pro-Ukrainian websites and had been recruited by Ukrainian special services to carry out the attack earlier this year."}," Indian-Origin Astronaut Sunita Williams Set For Her 3rd Mission: A Look At Her Space Expeditions ":{"img":"https://i.ndtvimg.com/i/2016-02/sunita-williams_650x400_61456513868.jpg","link":"https://www.ndtv.com/science/indian-origin-astronaut-sunita-williams-set-for-her-3rd-mission-a-look-at-her-space-expeditions-5600811","content":"It is worth noting that on her second expedition, Ms Williams spent a cumulative total of 322 days in space.”Expedition 32/33About six years after her first space journey, Ms Williams took her second spacecraft on July 14, 2012, when she launched Expedition 32/33.As per the official page of the National Aeronautics and Space Administration (NASA), Ms Williams served as a Flight Engineer.The missing Expedition 14/15 was extra special as Ms Williams established a world record with four spacewalks totalling 29 hours and 17 minutes."}," Oil Climbs As Chances Of Gaza Truce Talks Appear Slim, Saudi Hikes Prices ":{"img":"https://c.ndtvimg.com/2024-05/3eaa1cd8_oil-generic_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/oil-climbs-as-chances-of-gaza-truce-talks-appear-slim-saudi-hikes-prices-5600734","content":"The geopolitical risk premium in oil prices also eased as talks for a Gaza ceasefire were underwayOil futures climbed on Monday after Saudi Arabia hiked June crude prices for most regions and as the prospect of a Gaza ceasefire deal appeared slim, renewing fears the Israel-Hamas conflict could still widen in the key oil-producing region.Also supporting oil was Saudi Arabia's move to raise the official selling prices (OSPs) for its crude sold to Asia, Northwest Europe and the Mediterranean in June, signalling expectations of strong demand this summer.The geopolitical risk premium in oil prices also eased as talks for a Gaza ceasefire were underway.Brent crude futures gained 73 cents, or 0."}}