{" Student, 22, Stabbed Trying To Break Up Fellow Indians Fight In Australia ":{"img":"https://c.ndtvimg.com/2024-05/tc9g4rug_indian-student-murder-accused_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/indians-abroad/student-22-stabbed-trying-to-break-up-fellow-indians-fight-in-australia-5601546","content":"(Representational)A 22-year-old Indian student, studying MTech in Australia, was allegedly stabbed to death when he tried to intervene in a fight between a group of Indian students, said the victim's uncle today.According to the victim's uncle, Navjeet Sandhu was \"fatally stabbed in the chest\" with a knife by another student when he was trying to mediate a confrontation in a rent related dispute between a group of Indian students.com/CmKlCtXz6r\"A search is currently underway for brothers Abhijeet and Robin Gartan, both of Indian descent\" says the Victoria Police department\"Abhijeet is 26-years-old and described as being 170 cm tall with a solid build and black hair, Gartan is 27-years-old and is also described as being 170 cm tall with a solid build and black hair\", they added.Navjeet was on a one-and-a-half-year work visa in Australia, according to Yashvir."}," Officials At US Airport Find Bag Of Snakes Hidden In Passenger's Pants, Share Pics ":{"img":"https://c.ndtvimg.com/2024-05/ent4qbpo_snakes-hidden-in-passengers-trousers_625x300_06_May_24.jpg","link":"https://www.ndtv.com/world-news/officials-at-us-airport-find-bag-of-snakes-hidden-in-passengers-pants-share-pics-5601383","content":"@TSA called our @CBPSoutheast and Miami-Dade Police partners in to assist, and the snakes were turned over to the Florida Fish and Wildlife Conservation Commission,\" the post on X read.@TSA called our @CBPSoutheast and Miami-Dade Police partners in to assist, and the snakes were turned over to the Florida Fish and Wildlife Conservation Commission.See the tweet here:Officers at @iflymia detected this bag of snakes hidden in a passenger's pants at a checkpoint on Fri, April 26.\"Officers at @iflymia detected this bag of snakes hidden in a passenger's pants at a checkpoint on Fri, April 26."}," Meghan Markle Got \"Rare Honour\" From King Charles Before Leaving UK, Says Royal Expert ":{"img":"https://c.ndtvimg.com/meghan-markle-prince-charles_625x300_1526727345322.jpg","link":"https://www.ndtv.com/world-news/meghan-markle-got-rare-honour-from-king-charles-before-leaving-uk-says-royal-expert-5601269","content":"Meghan Markle, Duchess of Sussex, was given a \"rare honour\" from King Charles, then Prince, before she along with her husband Prince Harry stepped back from their duties, according to a royal expert.BBC royal correspondent Micheal Cole told GBN America about how it went \"so badly wrong\" for Ms Markle and putting it all together is \"really hard\".\"In 2020, Prince Harry and his wife Meghan Markle announced that they would be stepping away from royal duties and since then the couple has been living with their two children in the United States.She could not have been welcomed more into this country or the Royal Family,\" he said on GBN America."}," US Teen Who Slapped Teacher In Classroom Faces Kidnapping, Assault Charges ":{"img":"https://c.ndtvimg.com/2024-05/qc4sjff_us-teen-slaps-teacher_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/us-teen-who-slapped-teacher-in-classroom-faces-kidnapping-assault-charges-5601132","content":"Watch the video:NEW: North Carolina high school student who went viral for hitting his teacher has been smacked with felony charges & is being charged as an adult.A US high school student, who attacked two teachers in school premises, has been hit indicted on assault and kidnapping charges, according to a report in Fox News.17-year-old Aquavis Hickman has been indicted on assault and kidnapping charges for two separate… pic.A video of 17-year-old Aquavis Hickman hitting one of the teachers in the classroom in April had gone viral on social media, leading to a barrage of comments."}," 'Where Can We Go?': Gazans In Rafah As Israel Demands Evacuation ":{"img":"https://c.ndtvimg.com/2024-05/1k6ecrdo_israel-gaza-war_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/palestinians-in-rafah-prepare-to-flee-ahead-of-possible-ground-assault-5601123","content":"For your safety, the IDF (Israeli military) tells you to evacuate immediately towards the expanded humanitarian zone of al-Mawasi,\" it said, with a map indicating the location to the north of Rafah.Palestinian civilians in the southern Gazan city of Rafah voiced despair on Monday as Israel dropped fliers urging them to evacuate for their own \"safety\" ahead of a \"limited\" military operation.\"Gaza's bloodiest-ever war broke out following Hamas's unprecedented October 7 attack on Israel which resulted in the deaths of more than 1,170 people, mostly civilians, according to an AFP tally of Israeli official figures.\"An Israeli military spokesman told reporters that the evacuation \"is part of our plans to dismantle Hamas ..."}," One Year On, A Low-Key Coronation Anniversary For Britain's King Charles ":{"img":"https://c.ndtvimg.com/2024-05/t47r62eo_charles-coronation-anniversary_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/one-year-on-a-low-key-coronation-anniversary-for-britains-king-charles-5601033","content":"Britain's King Charles III on Monday marked the first anniversary of his coronation following a difficult year that has seen a cancer diagnosis and continuing tensions with his estranged son Prince Harry.The double blow of both King Charles and Catherine's ill health has left the royal family with a shortage of frontline royals with William also stepping back for a while to help care for his wife and family.The Archbishop of Canterbury Justin Welby who crowned King Charles a year ago at Westminster Abbey praised his \"sense of duty\".But King Charles and Catherine's absence was felt even more keenly as the king's younger son Harry is no longer a working royal."}," Israel Army Says \"Encourages\" Gazans In East Rafah To Head To \"Humanitarian Area\" ":{"img":"https://c.ndtvimg.com/2024-05/bdad59e_rafah-assault_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/israel-army-says-encourages-gazans-in-east-rafah-to-head-to-humanitarian-area-5600927","content":"The Israeli army Monday called on Gazans living in eastern Rafah to head to an \"expanded humanitarian area\" in the Palestinian territory, ahead of an expected military operation in the southern Gaza city.\"The IDF has expanded the humanitarian area in Al-Mawasi to accommodate the increased levels of aid flowing into Gaza,\" the military statement said, referring to a coastal area near Rafah.\"\"IDF (military) encourages the residents of eastern Rafah to advance towards expanded humanitarian area,\" the military said in a statement.In its statement, the military added that messages \"to temporarily move to the humanitarian area will be conveyed through posters, SMS messages, phone calls and media broadcasts in Arabic."}," Russian Man Accused Of Trying To Blow Up Courts On Ukraine's Behalf Detained ":{"img":"https://c.ndtvimg.com/2022-11/iof8givc_arrest-generic_625x300_30_November_22.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/russian-man-accused-of-trying-to-blow-up-courts-on-ukraines-behalf-detained-5600860","content":"(Representational)A Russian man accused of trying to blow up two court buildings on behalf of Ukraine has been detained and charged with terrorism, Russia's FSB security services said on Monday.Later inspection of the objects revealed they were \"two homemade explosive devices\", which the man planned to detonate near two court buildings in the city, it alleged.Moscow has reported dozens of sabotage attacks on Russian territory since sending troops into Ukraine more than two years ago, blaming most of them on Kyiv and its supporters.According to the FSB, the suspect regularly visited pro-Ukrainian websites and had been recruited by Ukrainian special services to carry out the attack earlier this year."}," Indian-Origin Astronaut Sunita Williams Set For Her 3rd Mission: A Look At Her Space Expeditions ":{"img":"https://i.ndtvimg.com/i/2016-02/sunita-williams_650x400_61456513868.jpg","link":"https://www.ndtv.com/science/indian-origin-astronaut-sunita-williams-set-for-her-3rd-mission-a-look-at-her-space-expeditions-5600811","content":"It is worth noting that on her second expedition, Ms Williams spent a cumulative total of 322 days in space.”Expedition 32/33About six years after her first space journey, Ms Williams took her second spacecraft on July 14, 2012, when she launched Expedition 32/33.As per the official page of the National Aeronautics and Space Administration (NASA), Ms Williams served as a Flight Engineer.Expedition 14/15Sunita Williams began her first space journey on December 9, 2006."}," Oil Climbs As Chances Of Gaza Truce Talks Appear Slim, Saudi Hikes Prices ":{"img":"https://c.ndtvimg.com/2024-05/3eaa1cd8_oil-generic_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/oil-climbs-as-chances-of-gaza-truce-talks-appear-slim-saudi-hikes-prices-5600734","content":"The geopolitical risk premium in oil prices also eased as talks for a Gaza ceasefire were underwayOil futures climbed on Monday after Saudi Arabia hiked June crude prices for most regions and as the prospect of a Gaza ceasefire deal appeared slim, renewing fears the Israel-Hamas conflict could still widen in the key oil-producing region.Also supporting oil was Saudi Arabia's move to raise the official selling prices (OSPs) for its crude sold to Asia, Northwest Europe and the Mediterranean in June, signalling expectations of strong demand this summer.The geopolitical risk premium in oil prices also eased as talks for a Gaza ceasefire were underway.Brent crude futures gained 73 cents, or 0."}," Hamas Says Will Continue Truce Talks \"Positively\" Despite Rafah Evacuation ":{"img":"https://c.ndtvimg.com/2024-05/qlp41ldg_rafah-evacuation_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/hamas-says-will-continue-truce-talks-positively-despite-rafah-evacuation-5600580","content":"Israel has publicly rejected a permanent ceasefireA Hamas spokesman said Monday that the Palestinian group would continue negotiations towards a truce in Gaza, despite Israel's order to begin evacuating people from Rafah in the south.Hamas's demand for a full Israeli withdrawal is something \"no Israeli government can accept\", a statement from Netanyahu's office said, maintaining that \"would allow Hamas to once again militarily control the Strip\" and prepare for another \"October 7, as it has promised to do\".Senior officials of Hamas accused Netanyahu of sabotaging the truce talks out of \"personal interests\".After the latest round of truce talks in Cairo failed to produce a breakthrough over the weekend, Hamas's delegation headed back to Qatar where its political chief, Ismail Haniyeh, is based."}," Nuclear Drills Response To West Comments On Sending Troops To Ukraine: Kremlin ":{"img":"https://c.ndtvimg.com/2024-03/6thck91o_putin-1200_625x300_18_March_24.jpeg","link":"https://www.ndtv.com/world-news/nuclear-drills-response-to-west-comments-on-sending-troops-to-ukraine-kremlin-5600311","content":"\"Macron said in an interview last week that the question of sending troops to Ukraine would \"legitimately\" arise if Russia broke through the Ukrainian front lines, and Kyiv made such a request.\"The Kremlin said on Monday that Russia's forthcoming nuclear drills were intended as a response to \"unprecedented\" comments -- including by French President Emmanuel Macron -- about sending NATO troops into Ukraine.Ukrainian forces have been dependent on Western military aid to battle Russia but NATO has said it will not send troops into Ukraine.They are talking about the readiness and even the intention of sending armed contingents to Ukraine -- that is, in fact, to put NATO soldiers in front of the Russian military,\" he added."}," UCLA Classes Back Offline Amid Ease Of Campus Protests ":{"img":"https://c.ndtvimg.com/2024-05/5h9biq38_campus-protest-us_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/ucla-classes-back-offline-amid-ease-of-campus-protests-5599899","content":"(File)In-person classes will resume Monday at the University of California, Los Angeles, college officials said, after they were moved online following clashes on campus between pro-Palestinian protesters and police.\"It is clear that UCLA needs a unit and leader whose sole responsibility is campus safety to guide us through tense times,\" he said in a statement on Sunday.Demonstrations against Israel's war on Hamas in Gaza have rocked US campuses across the country for weeks, prompting crackdowns, mass arrests, and a White House directive to restore order.The Gaza war started when Hamas militants staged an unprecedented attack on Israel on October 7 that resulted in the deaths of more than 1,170 people, mostly civilians, according to an AFP tally of Israeli official figures."}," Xi Jinping In Paris To Meet Emmanuel Macron, With Trade, Ukraine Talks Planned ":{"img":"https://c.ndtvimg.com/2024-05/tv58app_xi-and-macron_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/xi-jinping-in-paris-to-meet-emmanuel-macron-with-trade-ukraine-talks-planned-5599718","content":"Chinese President Xi Jinping awoke in Paris on Monday on his first visit to the region in five years, with trade and Russia's war with Ukraine on the agenda in talks with France's Emmanuel Macron and European Commission chief Ursula von der Leyen.In a statement released on his arrival, Xi praised ties between the two nations, despite trade tensions over a European Union probe into Chinese electric vehicle exports, and Beijing's investigation into mostly French-made imports of brandy.After Paris, Macron will take Xi to the Pyrenees, a mountainous region dear to the French president as the birthplace of his maternal grandmother, before Xi heads to Russia-friendly Serbia and Hungary.\"In Europe, we are not unanimous on the subject because certain players still see China as essentially a market of opportunities,\" Macron said in an interview with French newspaper La Tribune ahead of Xi's two-day visit."}," Sea Trials Begin Of China's New Aircraft Carrier. What It Means For India ":{"img":"https://c.ndtvimg.com/2024-05/j1critpo_fujian-aircrafts-carrier-_625x300_06_May_24.jpg","link":"https://www.ndtv.com/world-news/sea-trials-begin-of-chinas-new-aircraft-carrier-fujian-what-it-means-for-india-5599654","content":"The US Department of Defence, in its latest report on Chinese naval modernization, said China is reportedly building a fourth aircraft carrier similar to Fujian and is expected to be nuclear-powered.The Fujian carrier is expected to weigh 79,000 tons, carrying the most potent fighter jet launch system - Electromagnetic Aircraft Launch System (EMALS).The Fujian aircraft carrier will be the first conventional-energy-powered platform with the EMALS system.The US DoD suggests that although these carriers have value for China, its operations in Taiwan do not require such platforms since it is within the land-based reach of Chinese aircraft."}}