{" White House Slams Trump Veep Contender's Call For Biden's Dog To Be Shot ":{"img":"https://c.ndtvimg.com/2024-02/sb3ieccg_joe-biden-dog_625x300_22_February_24.jpg","link":"https://www.ndtv.com/world-news/white-house-slams-trump-veep-contenders-call-for-bidens-dog-to-be-shot-5606634","content":"\"Commander was sent to live with family members after the two-year-old German Shepherd, who came to the White House as a cute pup in 2021, had trouble settling in and bit at least 11 Secret Service agents.South Dakota Governor Kristi Noem, a potential Donald Trump 2024 running-mate, said Biden's dog Commander should meet a similar fate as her own pup for biting several Secret Service agents.Commander, the dog, had trouble settling in and bit at least 11 Secret Service agents.(File)The White House bared its teeth Monday at a \"disturbing\" political opponent who called for President Joe Biden's dog to be put down, days after she revealed she had shot her own family's pet."}," US Soldier Arrested In Russia On Theft Charges: Report ":{"img":"https://c.ndtvimg.com/2022-03/1gsbh8do_red-square-kremlin-moscowafp-_625x300_04_March_22.jpg","link":"https://www.ndtv.com/world-news/us-soldier-arrested-in-russia-on-theft-charges-report-5606554","content":"A US official said the soldier had been based in South Korea.A US official, speaking on condition of anonymity, said the soldier had been based in South Korea.(representational)A US soldier who was detained in Russia on charges of criminal misconduct was arrested by a Vladivostok court on theft charges, Russia's RIA state news agency reported on Tuesday.Another US official said the soldier was accused of stealing from a woman."}," Israel Bombards Gaza's Rafah Ahead Of Talks To Seal Peace Deal ":{"img":"https://c.ndtvimg.com/2024-05/dma4l7eo_rafah-bombing-afp_625x300_07_May_24.jpeg","link":"https://www.ndtv.com/world-news/israel-bombards-gazas-rafah-ahead-of-talks-to-seal-peace-deal-5606392","content":"An Israeli incursion into the city would be \"intolerable\", UN Secretary-General Antonio Guterres said Monday, calling on Israel and Hamas \"to go an extra mile\" to reach a ceasefire deal.Israel carried out strikes on the Gazan city of Rafah overnight as it sought to put \"pressure\" on Hamas ahead of talks in Egypt on Tuesday aimed at sealing a truce proposal endorsed by the Palestinian group.Hamas said Israel was planning a large-scale offensive \"without regard for the ongoing humanitarian catastrophe\" in the besieged Gaza Strip or the fate of hostages held there.Renewing the call for people to leave Rafah late Monday, Israeli military spokesman Daniel Hagari said \"aircraft targeted more than 50 terror targets in the Rafah area\" throughout the day."}," Sunita Williams Was Strapped In Seat When Space Mission Was Aborted ":{"img":"https://c.ndtvimg.com/2024-05/t5id3eu_sunita-williams-_625x300_07_May_24.jpg","link":"https://www.ndtv.com/world-news/sunita-williams-was-strapped-in-seat-when-space-mission-was-aborted-5606326","content":"The first crewed flight of Boeing's Starliner spaceship was dramatically called off around two hours before launch after a new safety issue was identified, officials said Monday, pushing back a high-stakes test mission to the International Space Station.Elon Musk's SpaceX achieved the feat with its Dragon capsule in 2020, ending a nearly decade-long dependence on Russian rockets following the end of the Space Shuttle program.But other problems that came to light -- including weak parachutes and flammable tape in the cabin that needed to be removed -- caused further delays to the crewed test flight, necessary for the capsule to be certified for NASA use on regular ISS missions.Wilmore and Williams, both Navy-trained pilots and space program veterans, have each been to the ISS twice, travelling once on a shuttle and then aboard a Russian Soyuz vessel."}," Pro-Palestine Protesters Rally Outside Met Gala Event, Several Arrested ":{"img":"https://c.ndtvimg.com/2024-05/3bqd9mt_new-york-israel-protests-_625x300_07_May_24.jpeg","link":"https://www.ndtv.com/world-news/pro-palestine-protesters-rally-outside-met-gala-event-several-arrested-5605565","content":"Columbia University, at the forefront of student protests against the Gaza conflict, cancelled its main graduation ceremony on Monday amidst ongoing demonstrations that have rattled campuses nationwide.Columbia, where over 100 pro-Palestinian protesters were arrested the previous week, cited security concerns for the cancellation of the May 15 graduation ceremony, opting for smaller events instead.These demonstrations come against a backdrop of broader student-led movementsAs stars and celebrities ascended the steps of the Metropolitan Museum of Art in New York for the Met Gala event, another scene unfolded on the streets surrounding the iconic venue.These demonstrations come against a backdrop of broader student-led movements, with universities such as Columbia University becoming hubs for activism."}," Boeing Probed In US Over Possible Falsified Records On 787 ":{"img":"https://c.ndtvimg.com/2019-04/rgdq50p8_boeing-787-dreamlinerafp650_625x300_18_April_19.jpg","link":"https://www.ndtv.com/world-news/boeing-probed-in-us-over-possible-falsified-records-on-787-5605533","content":"An audit by an FAA advisory panel released in February pointed to significant shortcomings in Boeing's safety culture, describing a \"disconnect\" between senior company management and other Boeing employees and skepticism that safety complaints by workers would not result in retaliation.The FAA said it opened the investigation after Boeing notified it that the company may not have completed required inspections, which are needed to ensure a safe and functional electrical flow between aircraft components.US air safety authorities are investigating whether embattled aviation giant Boeing completed required inspections on its 787 aircraft and whether employees falsified records, officials said Monday.\"The FAA is investigating whether Boeing completed the inspections and whether company employees may have falsified aircraft records,\" the agency said."}," \"Will Wait To...\": US On India's Probe Into Khalistani Terrorist's Murder Plot ":{"img":"https://c.ndtvimg.com/2022-10/l8063v1o_gurpatwant-singh-pannun-twitter_625x300_12_October_22.jpg","link":"https://www.ndtv.com/world-news/us-on-indias-probe-into-khalistani-terrorist-gurpatwant-singh-pannuns-murder-plot-5605495","content":"Slamming the report by the US daily, India has strongly rejected the claims, saying that the report made \"unwarranted and unsubstantiated\" imputations on a serious matter and that an investigation into the case was underway.The United States is waiting to see the results of the Indian investigations on allegations related to a plot to assassinate Khalistani terrorist Gurpatwant Singh Pannun in the US, a State Department official has said.Miller was responding to a question on the allegations that Indian government officials were involved in a plot to assassinate Pannun, a US citizen and a separatist Sikh leader.But we made it very clear that it's something that we are taking seriously and we think they, too, should take this seriously,\" State Department Spokesperson Matthew Miller told reporters at his daily news conference."}," Factbox: Three-Phase Ceasefire Deal Hamas Backs, But Israel Does Not ":{"img":"https://c.ndtvimg.com/2024-04/taai0eeo_israelgaza-war_625x300_29_April_24.jpeg","link":"https://www.ndtv.com/world-news/factbox-three-phase-ceasefire-deal-hamas-backs-but-israel-does-not-5605388","content":"Palestinian Islamist group Hamas said on Monday it had agreed to a three-phased deal for a ceasefire and hostages-for-prisoners swap, although an Israeli official said the deal was not acceptable to Israel because terms had been \"softened\".Palestinian Islamist group Hamas said on Monday it had agreed to a three-phased deal for a ceasefire.Based on details announced so far by Hamas officials and an official briefed on the talks, the deal that the Palestinian group said it had agreed to included the following:PHASE ONEPHASE TWOPHASE THREE(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.The United States, which alongside Qatar and Egypt has played a mediation role in the talks, said it was studying the Hamas response and would discuss it with Middle East allies."}," UK Military Personnel's Data Accessed In Hack: Report ":{"img":"https://c.ndtvimg.com/2024-05/hcoqongg_uk-military-data-leaking_625x300_07_May_24.jpeg","link":"https://www.ndtv.com/world-news/uk-military-personnels-data-accessed-in-hack-report-5605273","content":"Information like names and bank details of military personnel was compromise, according to the report.Information like names and bank details of current and some former members of the Royal Navy, Army and Air Force was compromised, according to the report.Some personal information in a payroll system used by Britain's defence department has been accessed in a data breach, the BBC reported on Monday.The system was managed by an external contractor and no operational Ministry of Defence data was obtained, the broadcaster said, adding that the department took the system off-line immediately."}," 5 Killed In Israeli Strikes In Gaza's Rafah ":{"img":"https://c.ndtvimg.com/2024-05/n8hd8ns8_gaza-rafah_625x300_07_May_24.jpeg","link":"https://www.ndtv.com/world-news/5-killed-in-israeli-strikes-in-gazas-rafah-5605236","content":"Israeli strikes left at least five people dead in the southern Gaza city of Rafah, a local hospital said early Tuesday, as Israel vowed to launch a vast ground operation there.The city's Kuwaiti hospital said it had received \"five martyrs and several injured\" after Israeli strikes overnight.The area is currently the site of intense Israeli military strike activity, according to witnesses and Palestinian security sources.Israel on Monday launched strikes on Gaza's southern city Rafah despite United States' warnings."}," The New York Times, Reuters Win Pulitzer Prizes For Coverage Of Gaza War ":{"img":"https://c.ndtvimg.com/2024-05/kdkufmdc_gaza-war-reuters_625x300_07_May_24.jpeg","link":"https://www.ndtv.com/world-news/the-new-york-times-reuters-win-pulitzer-prizes-for-coverage-of-gaza-war-5604924","content":"\"Reuters meanwhile won the award for breaking news photography for its \"raw and urgent\" coverage of the October 7 attack and Israeli response, while a special citation recognized \"journalists and media workers covering the war in Gaza.\"Reuters won the award for breaking news photography for its coverage of October 7 attack and war on Gaza.The New York Times won a Pulitzer in international reporting for its \"wide-ranging and revelatory coverage of Hamas's lethal attack in southern Israel on Oct.The war in Gaza featured prominently in Monday's Pulitzer Prizes, which included a special citation for journalists covering the Israel-Hamas conflict."}," Biden Again Warns Netanyahu As Israel Starts Gaza's Rafah Operation ":{"img":"https://c.ndtvimg.com/2023-10/s4dkmhi_israeli-army_625x300_13_October_23.jpg","link":"https://www.ndtv.com/world-news/joe-biden-again-warns-benjamin-netanyahu-as-israel-starts-gazas-rafah-operation-5604865","content":"The warning, which followed the killing of seven aid workers in an Israeli drone strike, was the first hint of possible conditions to Washington's military support for Israel.US President Joe Biden, seeking to push a Gaza ceasefire, on Monday warned Prime Minister Benjamin Netanyahu against invading Rafah as Israel defiantly issued evacuation orders and carried out intense air strikes on the crowded Gaza city.The king asked Biden to intervene with Israel, saying that an Israeli attack on Rafah \"threatens to lead to a new massacre,\" according to a Jordanian statement.In one area of progress, the United States said Netanyahu agreed to keep aid flowing through Kerem Shalom, the key crossing between Gaza and Israel."}," US Soldier Detained In Russia For 'Criminal Misconduct' ":{"img":"https://c.ndtvimg.com/2022-03/1gsbh8do_red-square-kremlin-moscowafp-_625x300_04_March_22.jpg","link":"https://www.ndtv.com/world-news/us-soldier-detained-in-russia-for-criminal-misconduct-5604597","content":"\"On May 2, 2024, Russian authorities in Vladivostok, Russia, detained an American soldier on charges of criminal misconduct,\" US Army spokeswoman Cynthia Smith said.An American soldier was detained in Russia last week on charges of \"criminal misconduct,\" the US Army said on Monday.Russia notified the US State Department, which is \"providing appropriate consular support to the soldier in Russia,\" and the Army notified his family, Smith said.According to NBC News, the soldier traveled to Russia on his own and was not on official business."}," Hamas Agreed To Latest Israeli Proposal, Says Official Briefed On Talks ":{"img":"https://c.ndtvimg.com/2024-02/rqc4pskg_gaza-ceasefire_625x300_23_February_24.jpeg","link":"https://www.ndtv.com/world-news/hamas-agreed-to-latest-israeli-proposal-says-official-briefed-on-talks-5604320","content":"Hamas agreed to the latest proposal that Israel had made on April 27.Hamas agreed to the latest proposal that Israel had made on April 27 and there were no major changes since then, an official briefed on the ceasefire talks said, adding the Qatari mediators had spoken to Hamas about this on Sunday and Monday.\"What happens next depends on Israel to accept or reject Hamas' response."}," US \"Reviewing\" Hamas Response On Ceasefire, Urges Israel Not To Attack Rafah ":{"img":"https://c.ndtvimg.com/2024-05/qlp41ldg_rafah-evacuation_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/us-reviewing-hamas-response-on-ceasefire-urges-israel-not-to-attack-rafah-5604245","content":"The United States said Monday it was reviewing a response from Hamas to a ceasefire proposal as it renewed calls on Israel not to attack the packed Gaza city of Rafah.He declined to characterize the Hamas response, which the militants said was an acceptance of a ceasefire, but said the United States backed a deal to halt the fighting and free hostages.As the United States reviews the Hamas reply, President Joe Biden's administration renewed calls on Israel not to attack Rafah after it issued evacuation orders.\"We continue to believe that a hostage deal is in the best interests of the Israeli people; it's in the best interests of the Palestinian people\" Miller said."}}