{" From Hanging Coffins To Snake Island: World's 10 Most Terrifying Places ":{"img":"https://c.ndtvimg.com/2024-06/ai517s2_terrifying-places_625x300_22_June_24.jpeg","link":"https://www.ndtv.com/world-news/from-hanging-coffins-to-snake-island-worlds-10-most-terrifying-places-5943408","content":"One might even see smoke coming out from the subterranean fires, which, as per scientists, will continue to burn for another 250 years.If you are one of those, we have a list of 10 spine-chilling places that you might want to explore.The name of this place is enough to send shivers down anyone's spine.In the village, there are about 350 dolls and 27 humans -- something enough to describe the place as a terrifying toyland.Cerro Negro, NicaraguaClimbing up an active volcano is thrilling enough, but imagine an activity where you have to sit or stand on a piece of plywood and slide your way down the slopes."}," Japan's Royal Family In UK For 3-Day State Visit Hosted By King Charles ":{"img":"https://c.ndtvimg.com/2024-06/v15chse8_japanese-royals-visit-to-uk-afp_625x300_22_June_24.jpeg","link":"https://www.ndtv.com/world-news/japan-emperor-in-uk-for-3-day-state-visit-amid-britains-election-campaign-5943501","content":"The trip will be the emperor's second official state visit since his accession to the throne in 2019, following a visit to Indonesia last year.The trip will be the emperor's second official state visit since his accession to the throne in 2019.The highlight will be a state banquet at Buckingham Palace, with all eyes on a possible appearance by the heir to the throne Prince William's wife Catherine, rarely seen in recent months due to cancer treatment.For Charles, 75, it will be the third state visit he has hosted since he ascended to the throne following the death of his mother.Naruhito, 64, will also go to Windsor Castle west of London to lay a wreath on the tomb of Queen Elizabeth II, whose state funeral he and the empress, 60, attended in September 2022."}," Gunman Opens Fire At Supermarket In US' Arkansas, 3 Killed, 10 Injured ":{"img":"https://c.ndtvimg.com/2024-06/1mmq7on8_arkansas-shooting-reuters_625x300_22_June_24.jpeg","link":"https://www.ndtv.com/world-news/gunman-opens-fire-at-supermarket-in-us-arkansas-3-killed-10-injured-5943578","content":"The wounded police officers and the suspect were expected to survive, said Arkansas State Police.The suspect was also wounded in a shootout with police, Arkansas State Police Director Mike Hagar told reporters.The wounded police officers and the suspect were expected to survive, he said.A shooter opened fire at an Arkansas supermarket on Friday, killing three civilians and wounding 10 other people, including two police officers, Arkansas State Police said.The suspect was also shot and taken into custody,\" Hagar said."}," Wagner Chief Prigozhin Remembered As \"Great Man\", Year After Russia Mutiny ":{"img":"https://c.ndtvimg.com/2023-10/0k18sojo_yevgeny-prigozhin-mourners-reuters_625x300_01_October_23.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/yevgeny-prigozhin-remembered-as-great-man-year-after-mutiny-in-russia-5943413","content":"Almost a year since Yevgeny Prigozhin sent his Wagner mercenaries marching towards Moscow in a rebellion against Russia's military leadership, residents in the capital spoke of respect and admiration for the late renegade.But \"Teddy Boy\", a 41-year-old American citizen from Los Angeles and member of the \"Espanola\" battalion fighting for Russia in Ukraine, praised the mercenary boss.\"He did a lot for Russia at a difficult moment,\" said 60-year-old caretaker Alexander Ulyanov, calling the late mercenary boss a \"great man\".Wagner spearheaded some of the Kremlin's longest and bloodiest military campaigns in Ukraine, including the fight for the mostly destroyed city of Bakhmut in the east.\"I'm not 100 percent with him, but if I had met him, I would have shook his hand,\" said Teddy Boy, who wore a military uniform and sported tattoos of pro-Russian army symbols.\""}," 45 Palestinians Killed In Israeli Attacks In Rafah Amid Truce Talks ":{"img":"https://c.ndtvimg.com/2024-06/j3mtfp6o_israel-attacks-rafah-reuters_625x300_22_June_24.jpeg","link":"https://www.ndtv.com/world-news/45-palestinians-killed-in-israeli-attacks-in-rafah-amid-truce-talks-5943071","content":"Israeli forces pounded Rafah in southern Gaza on Friday, as well as other areas across the enclave, killing at least 45 Palestinians as troops engaged in close-quarter combat with Hamas group operatives, residents and Israel's military said.On Friday, an Israeli air strike on a Gaza City municipal facility killed five people, including four municipal workers, the territory's Civil Emergency Service said.\"The entire city of Rafah is an area of Israeli military operations,\" Ahmed Al-Sofi, the mayor of Rafah, said in a statement carried by Hamas media on Friday.\"Palestinian health officials said at least 45 Palestinians were killed in Israeli strikes across Gaza on Friday.Palestinian health officials said at least 45 Palestinians were killed in Israeli strikes across Gaza."}," NASA Delays Boeing Starliner's Return From Space Station, No New Date Yet ":{"img":"https://c.ndtvimg.com/2024-06/v5bspqi8_starliner_625x300_07_June_24.jpg","link":"https://www.ndtv.com/world-news/nasa-delays-boeing-starliners-return-from-space-station-no-new-date-yet-5943039","content":"While just one thruster remains dead in Starliner's current flight, Boeing encountered four thruster problems during the capsule's uncrewed return from space in 2022.Boeing Starliner's return to Earth from the International Space Station with its first crew of astronauts has been postponed, NASA said on Friday.According to flight rules established jointly by Boeing and NASA, Starliner's maneuvering thrusters must, at a minimum, allow for \"6-degrees of freedom of control,\" and each has one backup thruster, a NASA spokesperson told Reuters.NASA officials have said they want to better understand the cause of the thruster failures, valve issue, and helium leaks before Starliner embarks on its roughly six-hour return journey.That could mean at least 12 of the 28 thrusters - most of which are backups - are required for a safe flight, or potentially fewer, as long as the remaining thrusters have one backup and can work together in a way that doesn't restrict Starliner's freedom of movement in space."}," Watch: Putin Waves Goodbye To Kim Jong Un Through Plane Window As He Departs N Korea ":{"img":"https://c.ndtvimg.com/2024-06/vsfmvdkg_putin-kim-jong-un-_625x300_19_June_24.jpeg","link":"https://www.ndtv.com/world-news/watch-putin-waves-goodbye-to-kim-jong-un-through-plane-window-as-he-departs-n-korea-5943161","content":"A video showing Russian President Vladimir Putin waving goodbye to North Korean leader Kim Jong Un through the window of his private jet has gone viral on social media.Also Read | Watch: Putin Takes Kim Jong Un On Drive In Limousine, Later Gifts Him CarIn return, the North Korean leader gave the Russian President a pair of Pungsan dogs, a local breed.In the video, shared on X (formerly Twitter), Vladimir Putin was seen peeping through the airplane window and waving at the North Korean leader.Russian President's visit was his first to North Korea in 24 years.According to reports, Putin had gifted Kim the Russian-built limousine in February this year and has again gifted him the same vehicle."}," \"Genocide Outweighs Domestic Policy\": Democrat Mayor Slams Biden Over Gaza ":{"img":"https://c.ndtvimg.com/2024-06/nsh54h8g_abdullah-hammoud-afp_625x300_22_June_24.jpeg","link":"https://www.ndtv.com/world-news/democrat-mayor-abdullah-hammoud-slams-biden-over-gaza-genocide-outweighs-domestic-policy-5943130","content":"Hammoud sidesteps the question of whether he could ultimately endorse Biden under the right circumstancesAbdullah Hammoud's election two years ago as the first Muslim mayor of Dearborn was a watershed moment for this city, an automaking hub home to the highest concentration of Arab-Americans in the United States.He was drawn towards the Democratic Party for its support of the labor movement, and equally repelled by Republicans, whom he says have a history of \"demonizing Arab Americans, Muslim Americans and other people of color.He has no doubt that Trump, who imposed a Muslim travel ban during his tenure, would be an utter disaster -- citing the Republican's arming of Saudi Arabia against Yemen, the backing of Israeli settlements in the West Bank, and shifting the US embassy to Jerusalem.\"I'll be the first to say that we don't want to see (Donald) Trump reelected to the White House,\" Hammoud told AFP in an interview.Hammoud's profile surged in January after he declined an invitation to meet with Biden campaign officials seeking to shore up the Muslim vote."}," Boeing May Avoid Criminal Charges Over Violations: Report ":{"img":"https://c.ndtvimg.com/2024-06/96o7suo4_boeing-ceo-dave-calhoun_625x300_22_June_24.jpeg","link":"https://www.ndtv.com/world-news/boeing-may-avoid-criminal-charges-over-violations-report-5943011","content":"The US Department of Justice is considering a deal with Boeing that would avoid criminal prosecution of the aerospace giant but may appoint a federal supervisor to oversee company progress on safety improvements, The New York Times reported Friday.A DOJ official involved in the case, Glenn Leon, chief of the fraud section criminal division, said in an email to a civil party lawyer seen by AFP that the department \"has not made a decision\" on the path it will take with respect to Boeing.Victims' families have called for the criminal prosecution of Boeing and its executives, and are seeking a nearly $25 billion fine.The DOJ's Leon emailed Paul Cassell, a lawyer for families in the criminal case against Boeing, saying the Times reporting \"was simply not correct.The DOJ says Boeing's violation of several provisions of the initial agreement, including measures requiring it to bolster its internal controls to detect and deter fraud, opened the company to prosecution."}," Man Who Attacked Nancy Pelosi's Husband With Hammer Convicted ":{"img":"https://c.ndtvimg.com/2022-08/ap3ebt68_nancy-pelosi_625x300_02_August_22.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/man-who-attacked-nancy-pelosis-husband-with-hammer-convicted-5942980","content":"A state jury has found David DePape guilty on all charges related to his home invasion and hammer attack on former US House of Representatives Speaker Nancy Pelosi's husband, Paul Pelosi, CBS News reported.David DePape was sentenced to 30 years in federal prison in May after a jury in November 2023 found him guilty of trying to hold then-Speaker Nancy Pelosi hostage and assaulting her husband at their residence in San Francisco, CBS News reported.DePape was found guilty of the five counts he faced in the stand trial, including aggravated kidnapping resulting in bodily harm or death, false imprisonment of an elder or dependent adult, threatening the family of public officials, first-degree residential burglary, and preventing or dissuading a witness by force or threat.The opening statements in the state trial started in May, a day after DePape's federal sentencing was reopened to permit him to speak after a procedural error during his original sentencing, CBS News reported.In his closing arguments, San Francisco Public Defender Adam Lipson said DePape had been living a solitary life and had gone \"down the rabbit hole of propaganda and conspiracy theories\" when he broke into Nancy Pelosi's residence on October 28, 2022, CBS News reported."}," Why The Hindujas, UK's Wealthiest Family, Face Jail Term In Switzerland ":{"img":"https://c.ndtvimg.com/2024-06/ekal4go8_prakash-hinduja_625x300_19_June_24.jpeg","link":"https://www.ndtv.com/indians-abroad/why-the-hindujas-uks-wealthiest-family-face-jail-term-in-switzerland-5942979","content":"A Swiss judge found four members of the family guilty of illegal employment, which they have challenged in a higher court.The court on Friday branded the Hindujas \"selfish\" after prosecutors alleged they meted out inhuman treatment to their staff, who were taken from India to work as domestic help at their family mansion.\"The family said in a statement they were \"appalled\" by the verdict and have filed a challenge in a higher court.\"The Hindujas, the wealthiest family in the UK, face around four-year jail terms for exploiting their Indian employees at their Geneva villa.Their expenses were around 8,584 Swiss francs (Rs 8 lakh) on their dog every year whereas some of their staff worked up to 18 hours a day, seven days a week, for just 7 Swiss francs (Rs 660) per day, Swiss prosecutor Yves Bertossa had stated."}," Original 'Harry Potter' Cover Art Up For Auction, Likely To Fetch Rs 5 Crore ":{"img":"https://c.ndtvimg.com/2024-06/l91ijoh_harry-potter-sothesby-x_625x300_22_June_24.jpeg","link":"https://www.ndtv.com/world-news/original-harry-potter-cover-art-up-for-auction-likely-to-fetch-rs-5-crore-5942978","content":"The original watercolor illustration for the first edition of \"Harry Potter and the Philosopher's Stone\" -- the book that introduced the world to the young bespectacled wizard -- will go up for auction in New York on Wednesday.The work by Thomas Taylor will go up for auction in New York on Wednesday.He was one of the first people to read the book, getting an early copy of the manuscript to inform his artwork, according to Sotheby's books specialist Kalika Sands.Rowling and Taylor were unknown when the book was released, and few expected it would become a global phenomenon.\"It's exciting to see the painting that marks the very start of my career, decades later and as bright as ever,\" Taylor, now a children's book author and illustrator, said in a statement released by Sotheby's.\""}," Taiwan Detects 36 Chinese Aircraft, 7 Naval Vessels Around Its Territory ":{"img":"https://c.ndtvimg.com/2022-08/2f9gk8ro_taiwan-china-afp_625x300_09_August_22.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/taiwan-detects-36-chinese-aircraft-7-shipping-vessels-around-its-territory-5942833","content":"Since September 2020, China has intensified its use of gray zone tactics by increasing the number of military aircraft and naval ships that operate near Taiwan's territory.com/TGOibZW1YBEarlier on Thursday, Taiwan tracked 11 Chinese military aircraft and eight naval vessels around the island nation during the last 24 hours till 6 am Thursday, reported Taiwan News.According to Taiwan's MND, out of 11 People's Liberation Army (PLA) aircraft, seven crossed the Taiwan Strait median line in the northern and southwestern sectors of the country's air defence identification zone (ADIZ) while one PLA helicopter was tracked in the southeast ADIZ.Since 2020, China has intensified its use of gray zone tactics by increasing aircraft and naval ships.China has increased its military activities around Taiwan, including regular air and naval incursions into Taiwan's Air Defense Identification Zone (ADIZ)."}," 2 Killed, Several Injured In Shooting In US' Arkansas: Report ":{"img":"https://c.ndtvimg.com/2022-11/3eb3kf1_us-police-generic_625x300_14_November_22.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/2-killed-several-injured-in-shooting-in-us-arkansas-report-5942804","content":"The shooting occurred at the Mad Butcher store in Fordyce, Arkansas, the news outlet Arkansas Online reported, citing local law enforcement officials.(Representational)At least two people were killed and several injured, including a police officer, in a shooting at a supermarket in Arkansas on Friday, local media reported.The shooting occurred at Mad Butcher store in Fordyce, Arkansas, the officials said.Dallas County Sheriff Mike Knoedel told a local CBS News Affiliate that the incident has been contained.Fordyce is a small community of 3,200 people in central Arkansas."}," Man Shot At Outside Central Jail In Punjab's Ferozepur: Cops ":{"img":"https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/man-shot-at-outside-central-jail-in-punjabs-ferozepur-cops-5942749","content":"(Representational)A man sustained bullet injuries after three motorcycle borne attackers opened fire towards him when he was waiting outside the central jail here on Friday evening, police said.The incident took place when Lalli and his two associates were waiting outside the Central Jail to receive their friend who was getting released on bail, they said.The incident took place when the victim was waiting outside the central jail on Friday.Suddenly, three unidentified attackers on a motorcycle arrived there and fired three rounds towards them in which Lalli got injured, police said.Police started their investigation and were checking the CCTV footage to get a clue about the three assailants."}}