{" Five Skiers Found Dead, One Missing In Swiss Alps Tragedy ":{"img":"https://c.ndtvimg.com/2024-03/g7oq6t98_swiss-alps_625x300_11_March_24.jpeg","link":"https://www.ndtv.com/world-news/five-skiers-found-dead-one-missing-in-swiss-alps-tragedy-5219976","content":"CNN reported that search-and-rescue operations were launched on Saturday after the skiers went missing near the 3,706-meter-high (12,159 feet) Tete Blanche pass, en route to the village of Arolla.\"A storm in the southern Alps and the danger of avalanches prevented helicopters and rescue columns from approaching the area,\" police continued, adding that a team of five experienced rescuers attempted an overland approach from Zermatt overnight, but they had to give up at an altitude of over 3,000 meters (9,843 feet) due to \"very poor weather conditions and the risks involved.\"The group, including a family of five from Valais, departed from Zermatt, a famous ski resort, on Saturday.Police said they were alerted by a family member who was meant to collect the group in the village of Arolla on Saturday afternoon and had become concerned when they failed to arrive.On Sunday, search parties recovered the bodies of five missing skiers."}," Woman Gives Birth To 'Miracle' Baby Mid-Flight With Help Of UK Doctor ":{"img":"https://c.ndtvimg.com/2024-03/o762pfj_wizz-air_625x300_11_March_24.jpeg","link":"https://www.ndtv.com/world-news/woman-gives-birth-to-miracle-baby-mid-flight-with-help-of-uk-doctor-5219741","content":"She was quite stressed about the whole situation but, through the translator, I managed to reassure her that I do have a bit of experience with newborns.\"It was a big sigh of relief, some positive closure to the whole situation,\" he added.His experience ensured the baby's well-being, even though she initially appeared slightly cyanotic (bluish)."}," Stressed Before Flight? Therapy Dogs To The Rescue At This Airport ":{"img":"https://c.ndtvimg.com/2024-03/es29i2g_therapy-dogs_625x300_11_March_24.jpeg","link":"https://www.ndtv.com/world-news/stressed-before-flight-therapy-dogs-to-the-rescue-at-this-airport-5219650","content":"Therapy dogs are now on hand at Istanbul Airport to help calm the nerves of tense travellers.The airport has been running the program for the past month to help reduce stress and anxiety among passengers passing through its terminals.Following positive feedback from passengers, airport operator IGA wants to expand the project, raising the number of dogs on hand to comfort travellers from five to 10, said Abdulkadir Demirtas, a customer experience manager.Murat Cengiz Koca, a dog behavioural expert and trainer who accompanies the canines around the airport, said the animals were trained not to react to sounds or people.According to research, interaction between animals and humans reduces stress levels and anxiety,\" Demirtas said."}," Zip, Sleeve, Hair: Key Problems With Kate Middleton's Edited Pic ":{"img":"https://c.ndtvimg.com/2024-03/m3vcnvo8_kate-middleton_625x300_10_March_24.jpeg","link":"https://www.ndtv.com/world-news/explained-key-problems-with-princess-kates-edited-mothers-day-pic-5219404","content":"The modified official photo of Catherine, Princess of Wales, and her children did not respect \"the ethical standards of the profession\", said Agence France-Presse (AFP), which withdrew the portrait.Analysis of the Mother's Day image, released on Sunday by Kate's Kensington Palace office, highlighted \"several inconsistencies in alignments\", AFP said.\"AFP felt compelled to remove the photo to preserve the trust of its subscribers and maintain transparency to the public, especially in a society where manipulated images are prevalent.\"The image said to have been taken by Kate's husband and heir to the throne Prince William last week, was released after weeks of rumours about her health after she underwent abdominal surgery in January.Keen photographer Kate has taken several official portraits of her family that were distributed by the palace to media outlets."}," Imran Khan's Wife Bushra Bibi \"Confined To A Small Room\", Claims Party ":{"img":"https://c.ndtvimg.com/2024-02/nnqp30eo_imran-khan-bushra-bibi_625x300_01_February_24.jpg","link":"https://www.ndtv.com/world-news/imran-khans-wife-bushra-bibi-confined-to-a-small-room-claims-party-5218676","content":"Bushra Bibi is imprisoned at Mr Khan's Bani Gala residence (File)Imran Khan's wife Bushra Bibi has been \"confined to a small room\" despite her Bani Gala residence here being declared a sub-jail, a senior leader of the jailed former Pakistan prime minister's party claimed on Monday.Mr Ayub, who was also the opposition's joint candidate who lost to Khan's rival Pakistan Muslim League-Nawaz (PML-N) party's Shehbaz Sharif in the prime ministerial election, said, Bushra Bibi has been \"confined to one small room\" despite her residence being declared a sub-jail.Bushra is imprisoned at Mr Khan's Bani Gala residence after an accountability court sentenced the couple to 14 years in jail in the Toshakhana corruption case last month.Last month, a Pakistani court was informed by the authorities of Adiala Jail that Bushra Bibi, 49, cannot be shifted to the prison due to a \"security threat\".The information was submitted to the Islamabad High Court while it was hearing a petition filed by Bushra seeking transfer from the Bani Gala sub-jail to Adiala, The Express Tribune newspaper reported."}," India Holds Agni-5 Missile Test, Chinese Vessel On Watch Off Vizag Coast ":{"img":"https://c.ndtvimg.com/2024-03/dpcphct_chinese-ship_625x300_11_March_24.jpg","link":"https://www.ndtv.com/india-news/as-india-preps-for-missile-test-chinese-vessel-on-watch-off-vizag-coast-5218406","content":"The Chinese ship is about 100 metres long and has advanced remote sensing equipmentWithin days of India issuing an alert for an impending missile test off the Odisha coast, a Chinese research vessel has raced up India's eastern seaboard and is currently anchored in international waters off the Indian coastline.The alert was for the Bay of Bengal area, which was seen as a clear indication India is planning a missile test that may take place anytime between March 11 and 16.\"Before the Chinese vessel docked in Male last month, the Maldives had said it would not conduct any research but will only come for \"rotation and replenishment\".The developments off the Indian coast come weeks after another Chinese ship of the same class set off alarm bells in New Delhi.The Chinese ship, Xian Yang Hong 01, is now less than 260 nautical miles - about 480 kilometres - off the coast of Visakhapatnam."}," Kate Middleton Apologises, Says She Edited Mother's Day Pic ":{"img":"https://c.ndtvimg.com/2023-05/3nqonj1_kate-middleton-afp_625x300_06_May_23.jpg","link":"https://www.ndtv.com/world-news/princess-of-wales-kate-middleton-apologises-over-edited-mothers-day-photo-5217946","content":"Close examination shows that Princess Charlotte's left hand is misalignedCatherine, Princess of Wales on Monday apologised and admitted to editing an official portrait of her released by the palace after AFP and other agencies withdrew the image.Her Kensington Palace office on Sunday sought to dispel rumours by distributing an official photograph said to have been taken by her husband Prince William of her with their three children.According to Kensington Palace, she was admitted to the hospital on January 16 for planned surgery, then left on January 29, to recuperate at home until at least Easter on March 31.Kate, 42, has not been seen in public since attending a Christmas Day church service, and underwent abdominal surgery in January, fuelling speculation about her health, particularly online.AFP, Getty, the Associated Press (AP) and Reuters all have policies about distributing manipulated images, and pulled it, despite initially publishing the photograph provided by Kensington Palace."}," 50 Injured As Latam Flight Suddenly Loses Altitude: \"Blood Was On Ceiling\" ":{"img":"https://c.ndtvimg.com/2024-03/cjlae86_latam-airlines-_625x300_11_March_24.jpeg","link":"https://www.ndtv.com/world-news/50-injured-as-latam-flight-suddenly-loses-altitude-blood-was-on-ceiling-5217546","content":"Fifty people were injured on board a Boeing 787-9 flight from Sydney to Auckland after the plane suddenly \"dropped\" mid-air, according to Forbes.The flight was operated by Chilean airline Latam and the plane experienced a technical issue, which caused \"strong movement\" on board the flight, the outlet further said.\"Flight LA800, operating the Sydney-Auckland route today, had a technical event during the flight which caused a strong movement,\" Latam said in a statement posted by CNN.Another passenger named Valentina, said that the plane \"just stopped,\" and that \"people were flying around.\"\"Blood was on the ceiling, people flew and broke the ceiling of the plane,\" she said."}," US Envoy Joins Consular Team To Interview 1,000 Indian Visa Applicants ":{"img":"https://c.ndtvimg.com/2024-03/9d18psj_eric-garcetti_625x300_11_March_24.jpg","link":"https://www.ndtv.com/world-news/us-envoy-joins-consular-team-to-interview-1-000-indian-visa-applicants-5217499","content":"Indians now represent one out of every 10 US visa applicants around the worldUS Ambassador to India Eric Garcetti on Monday joined the Embassy's consular team to interview over 1,000 visitor visa applicants, according to a press release from the US Embassy.The US Embassy in New Delhi had the first of its four \"Super Saturday\" visa processing events, which were planned for 2024 and the US envoy came to assist the embassy team.Ambassador Garcetti joined the Embassy team to support the surge and assist in the fingerprint verification process,\" the US Embassy said in a release.Embassy in New Delhi opened its doors on Saturday, March 9, 2024, to interview over 1,000 visitor visa applicants.Notably, Indians now represent one out of every 10 US visa applicants around the world."}," Elon Musk Compares Oscars To \"Woke Contest\", Vivek Ramaswamy Reacts ":{"img":"https://c.ndtvimg.com/2024-02/frr9q5p_elon-musk-reuters_625x300_02_February_24.jpeg","link":"https://www.ndtv.com/world-news/elon-musk-compares-oscars-to-woke-contest-vivek-ramaswamy-reacts-5217437","content":"Winning an Oscar now just means you won the woke contestIn another post, he said, \"When an award is diluted, everyone knows, including those who received it, and it no longer commands respect.\"\"Winning an Oscar now just means you won the woke contest,\" he said on the microblogging platform.In one of his posts on X (formerly Twitter), he compared receiving an Oscar to winning \"the woke contest.\"Most watched documentary of the year and zero chance they'd ever consider a nomination for our documentary because we aren't woke,\" one user stated.Oppenheimer triumphed winning seven of the 13 Oscars it was nominated for."}," 50 Injured As \"Technical Event\" Causes Turbulence On Sydney-Auckland Flight ":{"img":"https://c.ndtvimg.com/2024-03/cjlae86_latam-airlines-_625x300_11_March_24.jpeg","link":"https://www.ndtv.com/world-news/technical-event-causes-turbulence-on-sydney-auckland-flight-of-latam-airlines-13-hospitalised-5216999","content":"\"Technical event\" caused turbulence on the LATAM flight from Sydney to Auckland (Representational)Thirteen passengers have been hospitalised after a LATAM flight from Sydney to Auckland experienced a \"technical event\" that caused serious turbulence Monday, the airline and first responders told AFP.Chile-based LATAM Airlines said flight LA800 \"had a technical event during the flight which caused a strong movement.\"Our ambulance crews assessed and treated approximately 50 patients, with one patient in a serious condition and the remainder in a moderate to minor condition,\" Campbell said.Gerard Campbell of St John Ambulance New Zealand said medics were alerted to an incident at the airport and 13 patients had been taken to a local hospital by ambulance.The plane landed at Auckland Airport as scheduled\"."}," 25-Year-Old Adult Film Star Emily Willis Remains Critical After Suffering Cardiac Arrest ":{"img":"https://c.ndtvimg.com/2024-03/c4of72q8_emily-willis_625x300_11_March_24.jpeg","link":"https://www.ndtv.com/world-news/25-year-old-adult-film-star-emily-willis-remains-critical-after-suffering-cardiac-arrest-5216989","content":"She is currently on a ventilator to help with her breathing, according to her father, Michael Willis.In the update section of the page, the family said, \"Once again, thank you so much for all the kind words and donations.He wrote, \"Regarding the reports of an overdose, we want to clarify that they are not accurate as far as the doctors and my family know.Her family has warned fans to prepare for the worst, according to a TMZ report.Adult film star Emily Willis was hospitalised early last month and is now in a coma."}," Scientists Say Tiny Sea Creatures Can Reveal MH370 Crash Site ":{"img":"https://c.ndtvimg.com/2019-04/g6haansk_malaysia-airline-mh370_625x300_25_April_19.jpg","link":"https://www.ndtv.com/world-news/scientists-say-tiny-sea-creatures-can-reveal-mh370-crash-site-5216938","content":"It is thought to have crashed somewhere in the Indian Ocean, but despite 10-year multi-national search in which 46,300 square mile area was scanned and more than 100 million pounds spent, the plane remains missing.Satellites and radars have scanned the suspected area of crash for years, but have been unable to pinpoint the exact location of the plane.The plane, on its way from Kuala Lumpur to Beijing, disappeared from radar on March 8, 2014, with 239 people on board.The disappearance of Malaysia Airlines plane MH370 remains the biggest aviation mysteries in recent times.Flaperons are the metal flaps running along the wing's tail edge which can be seen from the window moving up and down as the plane manoeuvres."}," Adult Film Star Emily Willis Critical After Cardiac Arrest: 5 Points ":{"img":"https://c.ndtvimg.com/2024-03/ea5134c_emily-willis-_625x300_11_March_24.jpg","link":"https://www.ndtv.com/world-news/adult-film-star-emily-willis-critical-after-cardiac-arrest-5-points-5216643","content":"\"Emily remains in a vegetative coma and is fighting for her life,\" her brother, Michael, said on Friday on GoFundMe, as he sought donations to help cover her medical bills.Emily Willis remains in a vegetative coma, her brother saidEmily Willis, who has more than 20 lakh followers on Instagram, had been at a celebrity rehab center in California when she reportedly suffered cardiac arrest last month and was rushed to a hospital.Michael also said that Emily had retired from the adult industry nearly two years ago and \"had aspirations of success in other fields of entertainment\".He also spoke on the reports that claimed that the 25-year-old adult film actress was brought in for an \"overdose\" and said that they are \"not accurate\".Emily was receiving the treatment and help she needed at the time of the incident to overcome her struggles, he said."}}