{" Pak Court Acquits Nawaz Sharif's Sons In 3 Corruption Cases ":{"img":"https://c.ndtvimg.com/2019-07/f3n8l6vg_court-generic_625x300_27_July_19.jpg","link":"https://www.ndtv.com/world-news/pak-court-acquits-nawaz-sharifs-sons-in-3-corruption-cases-5270170","content":"(Representational)A Pakistan anti-corruption court on Tuesday acquitted the two sons of PML-N supremo Nawaz Sharif in three cases of alleged corruption, nearly ending the legal problems faced by the former prime minister's family.With the cases against his two sons wrapped up with Tuesday's acquittal, the entire family of Nawaz Sharif has been exonerated in cases which were launched against him and his family members in 2017 when he was disqualified by the Supreme Court.He challenged his conviction in the two cases and the Islamabad High Court acquitted him.Judge Nasir Javed Rana after hearing the case, acquitted the two in all three cases.However, their trials were not held as they were abroad while their father Sharif, the main accused, was convicted in the Avenfiled and Al-Azizia corruption cases but acquitted in the Flagship case."},"Podcast On Interoception - The Sixth Sense We Use To Read Hidden Signals ":{"img":"https://c.ndtvimg.com/2024-03/h61dohg4_brain-generic-consciousness-generic-pixabay_625x300_19_March_24.jpeg","link":"https://www.ndtv.com/science/podcast-on-interoception-the-sixth-sense-we-use-to-read-hidden-signals-5270103","content":"In this episode of The Conversation Weekly, we speak to a cognitive neuroscientist and expert on interoception about how new research on this connection between our minds and bodies could lead to breakthroughs in mental and physical healthcare.To find out more about Garfinkel's research and how she's developing ways to train people's interoception to help them deal with anxiety, listen to the full episode of The Conversation Weekly podcast.(Author:Gemma Ware, Editor and Co-Host, The Conversation Weekly Podcast, The Conversation)(Interviewed: Sarah Garfinkel -  Professor of Cognitive Neuroscience, UCL)(Disclosure Statement: Sarah Garfinkel has received research funding from the Medical Research Council, Wellcome and the MQ Mental Health Research Charity.Listen to The Conversation Weekly via any of the apps listed above, download it directly via our RSS feed or find out how else to listen here.This episode of The Conversation Weekly was written and produced by Katie Flood, with assistance from Mend Mariwany."}," The Hidden Racist History Of Hair Loss ":{"img":"https://c.ndtvimg.com/2022-09/56npgi9g_ayurvedic-remedies-for-hair-loss_625x300_08_September_22.jpg","link":"https://www.ndtv.com/world-news/the-hidden-racist-history-of-hair-loss-5269997","content":"The researchers found 68% of white men reported hair loss compared to 64% of South Asian men and 59% of black men.However, as in many areas of medical research, studies and clinical trials into hair loss predominantly focus on white people, ignoring or excluding other racial groups.Black people are more likely to develop traction alopecia, a hair loss type related to constant pulling of the hair follicles including through tight hairstyles.Meanwhile, dermatologists and other hair-loss practitioners continue to routinely study medical textbooks that only include images of white scalps and straight-textured hair.There are also forms of hair loss that are known to be more common in people of colour."}," Explained: Hong Kong's New National Security Law And How It Impacts Freedom ":{"img":"https://c.ndtvimg.com/2024-03/iqpuhtlo_hong-kong-reuters_625x300_19_March_24.jpeg","link":"https://www.ndtv.com/world-news/explained-hong-kongs-new-national-security-law-and-how-it-impacts-freedom-5269871","content":"Reflecting the priorities of President Xi Jinping, China updated its own state secrets laws in 2023, banning the transfer of any information related to national security and broadening the definition of espionage.The law includes sentences of up to life imprisonment for treason, insurrection, sabotage by colluding with external forces to damage public infrastructure and inciting members of Chinese armed forces to mutiny; 20 years for espionage and 10 years for crimes linked to state secrets and sedition while noting Hong Kong's freedom of expression and other rights.The law creates a new sabotage offence of unlawfully using a computer or electronic system to endanger national security, punishable by 20 years in prison.Some fear the laws could further restrict the city's freedoms while others are concerned the final laws could impact data security while state secrets provisions could hamper research and information gathering.The package, known as Article 23, updates or introduces new laws to prohibit treason, sabotage, sedition, the theft of state secrets and espionage."}," \"Planet On The Brink\": UN As 2014-2023 Recorded Hottest Decade Ever ":{"img":"https://c.ndtvimg.com/2023-06/ejdg1oc_global-warmingl_625x300_10_June_23.png","link":"https://www.ndtv.com/world-news/planet-on-the-brink-un-as-2014-2023-recorded-as-hottest-decade-ever-5269731","content":"The continued ocean warming combined with the rapidly melting glaciers and ice sheets also drove the sea level last year to its highest point since satellite records began in 1993, WMO said.Global heat records were \"smashed\" last year, the UN confirmed Tuesday, with 2023 rounding out the hottest decade on record, as heatwaves stalked oceans and glaciers suffered record ice loss.The United Nations' World Meteorological Organization issued its annual State of the Climate report, confirming preliminary data indicating that 2023 was by far the hottest year ever recorded.\"One especially worrying finding was that marine heatwaves gripped nearly a third of the global ocean on an average day last year.- Rising sea levels -In fact, it pointed out, its maximum extent at the end of the southern winter was around one million square kilometres below the previous record year -- equivalent to the size of France and Germany combined."}," Can Blood Test Detect Heart Failure Risk? What Indian-Origin Professor's Research Finds ":{"img":"https://c.ndtvimg.com/2021-05/s5gpeun4_blood-test-generic-unsplash_625x300_09_May_21.jpg","link":"https://www.ndtv.com/indians-abroad/can-blood-test-detect-heart-failure-risk-what-indian-origin-professors-research-finds-5268841","content":"(Representational)A blood test could help identify those at highest risk of dying from heart failure within the next five years, new Oxford University research conducted in collaboration with an Indian-origin professor has found.\"This new research suggests that a new, cheap and simple blood test, could help us in future to more accurately spot which patients with heart failure are at highest risk of early death,\" explained Professor Bryan Williams, Chief Scientific and Medical Officer at the British Heart Foundation.\"Measuring neuropeptide Y levels could in future offer healthcare professionals greater insights into how a patient's heart failure is likely to progress, in particular whether those with high levels of neuropeptide Y would benefit from additional treatment to reduce their higher risk,\" he said.The researchers suggest that measuring a protein called neuropeptide Y (NPY) alongside hormone B-Type Natriuretic Peptide (BNP) could help diagnose heart failure patients, pinpointing those who may be at higher risk of dying.A blood test could help identify those at risk of heart failure within next 5 years."}," Old Photo Of Tim Cook And Sundar Pichai At A Restaurant Goes Viral ":{"img":"https://c.ndtvimg.com/2024-03/klidjeik_cook-pichai-1200-_625x300_19_March_24.jpeg","link":"https://www.ndtv.com/world-news/old-photo-of-tim-cook-and-sundar-pichai-at-a-restaurant-goes-viral-5268753","content":"This was a picture of them eating in Palo Alto a few years ago at this Vietnamese fusion restaurantThe buzz started after Bloomberg reported that Apple is in advanced negotiations with Google to integrate its Gemini AI models into the iPhone.A user chimed in, “Two old guys trying to stay relevant by figuring out this new fangled AI thing.”Two old guys trying to stay relevant by figuring out this new fangled AI thing.Tim Cook and Sundar Pichai in a photo from 2017A picture, featuring Apple CEO Tim Cook and Google CEO Sundar Pichai dining together, has sparked widespread buzz on social media.Or they PICHing something to COOK( Ik it's a really bad joke )“Probably the Google AI going into iPhone discussions,” someone guessed."}," 6 US Cops Plead Guilty To Torturing Black Men. All About The Case ":{"img":"https://c.ndtvimg.com/2019-07/f3n8l6vg_court-generic_625x300_27_July_19.jpg","link":"https://www.ndtv.com/world-news/6-former-mississippi-officers-to-be-sentenced-for-torturing-2-black-men-know-more-5269421","content":"The Justice Department has charged the six officers with a total of 13 felonies related to \"the torture and physical abuse\" inflicted upon the two men and their sentencing schedule has been set, the report mentioned Hunter Elward and Jeffrey Middleton are to be sentenced on Tuesday, followed by Christian Dedmon and Daniel Opdyke on Wednesday, and Joshua Hartfield and Brett McAlpin on Thursday.The officials, who called themselves the “Goon squad” included former deputies Brett McAlpin, Christian Dedmon, Hunter Elward, Jeffrey Middleton, and Daniel Opdyke from the Rankin County Sheriff's Office (RCSO), along with Joshua Hartfield, a former officer with the Richland Police Department, reported CNN.(Representational)Six former law enforcement officers from Rankin County, Mississippi, are up for sentencing after pleading guilty to abusing two Black men in racially motivated attacks.During the incident, the officers subjected the two Black men, identified as Michael Jenkins and Eddie Parker, to brutal beatings, sexual assault, and taser shocks while they were handcuffed for approximately 90 minutes, Mississippi Free Press reported.The horrifying events unfolded when a white neighbour reported \"suspicious activity\" by some Black men at a nearby property, the report added."}," Explained: What Happens If Donald Trump Can't Post $464 Million Bond By Monday's Deadline? ":{"img":"https://c.ndtvimg.com/2024-03/ae6khilo_donald-trump_625x300_12_March_24.jpeg","link":"https://www.ndtv.com/world-news/explained-what-happens-if-donald-trump-cant-post-464-million-bond-by-mondays-deadline-5269348","content":"Mr Trump, 77, has denied wrongdoing and vowed to appeal the judgmentFormer US President Donald Trump is facing a precarious situation as he struggles to post a $454 million bond in a civil fraud case.If Donald Trump doesn't meet the deadline to post the mandated $454 million bond, New York Attorney General Letitia James will have the authority to commence the seizure of Mr Trump's properties and other assets to guarantee the secured judgment amount.Mr Trump must post the bond as part of his appeal process against a civil court judgment.Mr Trump's lawyers told a New York appeals court that the former US President is not able to find an insurance company to underwrite his bond to cover the massive judgment against him in the New York attorney general's civil fraud case.If the appeals court rules against him, Mr Trump asked the court to delay his posting the bond until his appeal to New York's highest court is heard."}," US Girl, 7, Undergoes Several Amputation Due To Rare Bacterial Disease ":{"img":"https://c.ndtvimg.com/2024-03/umi9aq5_victoria-pastenmorales_625x300_19_March_24.jpeg","link":"https://www.ndtv.com/world-news/us-girl-7-undergoes-several-amputation-due-to-rare-bacterial-disease-5269224","content":"It's going to be hard but, she's strong.\"It's not going to be easy for her."}," UK Teacher Who Had Sexual Relationship With Student Banned For Life ":{"img":"https://c.ndtvimg.com/2023-06/isckndt8_uk-police_625x300_04_June_23.jpg","link":"https://www.ndtv.com/world-news/uk-teacher-who-had-sexual-relationship-with-student-banned-for-life-5269033","content":"Hebblewhite was sentenced to two years in prison in 2021 after a court heard she had pressured the teenage girl into sex during an illicit relationship.The court was also told that the teacher first had sex with the girl in the toilet of a restaurant during a meal out for Valentine's Day.The other two charges were taking and possession of indecent photographs of a girl under the age of 17.Erin Hebblewhite, now 32, was jailed for two years and after an investigation by a misconduct panel, she has been banned from returning to the classroom.A UK teacher, who had a sexual relationship with a 16-year-old student, has been banned from teaching for life."}," Paris Olympics Lifts Intimacy Ban, To Hand Out 300,000 Condoms To Athletes ":{"img":"https://c.ndtvimg.com/2023-11/r0v1v79_paris-olympics_625x300_23_November_23.jpeg","link":"https://www.ndtv.com/world-news/paris-olympics-lifts-intimacy-ban-to-hand-out-300-000-condoms-to-athletes-5268913","content":"The intimacy ban had been in place for the 2020 Tokyo Olympics due to the COVID-19 pandemicOn Saturday, Olympic Village director Laurent Michaud said that for the 2024 Paris Games, they are lifting the intimacy ban and will have 300,000 condoms available for the 14,250 athletes staying in their quarters.\"The intimacy ban had been in place for the 2020 Tokyo Olympics due to the COVID-19 pandemic.While intimacy is allowed again at the Olympics, another vice will not be available to the athletes.Since the 1988 Seoul Olympics, organizers have handed out contraceptives to spread awareness of HIV and AIDS, CBS Sports reported.In an interview with Sky News, the Olympic Village director said, \"It is very important that the conviviality here is something big."}," Video: Narrow Escape For Zookeeper As 15-Foot Crocodile Attacks ":{"img":"https://c.ndtvimg.com/2024-03/0mm44huo_crocodile-attacks-zookeeper-1200_625x300_19_March_24.jpg","link":"https://www.ndtv.com/world-news/video-narrow-escape-for-zookeeper-as-15-foot-crocodile-attacks-5268886","content":"One of the tourists, who was present in the park at that time, told Reaction Unit South Africa that they were watching the show when the crocodile attacked the handler.There were two crocodiles in the enclosure and the second one, slightly smaller crocodile, ran to join the other reptile and attack the man.The attack took place on Sunday when the experienced reptile expert was giving a display to dozens of visitors at Crocodile Creek theme park in Ballito in Kwa-Zulu Natal, according to local outlets.The reptile was a Nile crocodile - the largest among the species with the most powerful bite force in the world.A zookeeper in South Africa had a narrow escape when a 15-foot crocodile attacked him inside an enclosure."}," Buckingham Palace Rubbishes Russian Report Of King Charles' Death ":{"img":"https://c.ndtvimg.com/2023-12/sndcbl_king-charles_625x300_25_December_23.jpeg","link":"https://www.ndtv.com/world-news/buckingham-palace-rubbishes-russian-report-of-king-charles-death-5268832","content":"The British Embassy in Ukraine and the Buckingham Palace were forced to announce that King Charles was very much alive after Russian media reported he had died.However, after a flurry of bogus stories from Russian media, the British Embassy in Ukraine issued a statement, stating that King Charles is alive.Notably, a host of Russian mainstream news outlets and popular pro-Kremlin Telegram channels falsely claimed King Charles was dead.British Embassy in Ukraine issued a statement stating that King Charles is alive.Initially, Russian internet channels, including Readovka, a pro-Kremlin Telegram channel, posted a document next to a photograph of King Charles."}," Israel Using Starvation As \"Method Of War\" Which Is A War Crime: UN ":{"img":"https://c.ndtvimg.com/2024-03/0vlg7p5_gaza-children_625x300_18_March_24.jpeg","link":"https://www.ndtv.com/world-news/israel-using-starvation-as-method-of-war-which-is-a-war-crime-un-5268831","content":"\"The situation of hunger, starvation and famine is a result of Israel's extensive restrictions on the entry and distribution of humanitarian aid and commercial goods, displacement of most of the population, as well as the destruction of crucial civilian infrastructure,\" he said in a statement.\"The extent of Israel's continued restrictions on the entry of aid into Gaza, together with the manner in which it continues to conduct hostilities, may amount to the use of starvation as a method of war, which is a war crime.Israel continues restrictions on entry of aid into Gaza, UN said.\"Everyone, especially those with influence, must insist that Israel acts to facilitate the unimpeded entry and distribution of needed humanitarian assistance and commercial goods to end starvation and avert all risk of famine.\"The United Nations warned Tuesday that Israel's severe restrictions on aid into war-ravaged Gaza coupled with its ongoing attacks could be seen as using starvation as a \"weapon of war\"."}}