{" 3 Wolves Brutally Attack 37-Year-Old Woman In Zoo Outside Paris: Report ":{"img":"https://c.ndtvimg.com/2024-06/0s1thgs_wolves-generic-pixabay_625x300_23_June_24.jpg?im=FitAndFill,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/3-wolves-brutally-attack-37-year-old-woman-in-zoo-outside-paris-report-5953458","content":"(Representational)Three wolves in a zoo outside Paris attacked a 37-year-old woman leaving her fighting for her life, a source familiar with the case and local prosecutors said.The woman was bitten \"on the neck, the calf and the back\" at the Thoiry zoo around 40 kilometres (25 miles) west of the French capital, the source familiar with the case told AFP.The source familiar with the case earlier said the woman must have got through \"security systems, a trench and an electric fence supposed to keep the animals in\".The woman is believed to have gone out alone for a jog after spending the night with her family in a safari-style lodge at the zoo, which it advertised on its website at between 220 and 760 euros ($235-810) per night.Thoiry zoo was founded in 1968 by Paul de la Panouse, owner of a local chateau that has been in his family since the 16th Century."}," Israeli Forces Tie Wounded Palestinian To Jeep In West Bank Raid ":{"img":"https://c.ndtvimg.com/2024-06/cnu4mqec_israeli-forces-1200_625x300_23_June_24.jpg","link":"https://www.ndtv.com/world-news/israeli-forces-tie-wounded-palestinian-to-jeep-in-west-bank-raid-5953391","content":"Israeli troops tied a wounded Palestinian to a military vehicle during a raid in the occupied West Bank city of Jenin, the army said Sunday, admitting that soldiers had violated operational procedures.At least 553 Palestinians have been killed in the West Bank by Israeli troops or settlers since the Gaza war broke out, according to Palestinian officials.During an exchange of fire between troops and militants in Burqin's Jabriyat neighbourhood, a Palestinian was wounded and apprehended, the military said in a statement.Attacks by Palestinians have killed at least 14 Israelis in the West Bank over the same period, according to an AFP tally of Israeli official figures.The military said a Palestinian man was wounded during a \"counterterrorism operation\" to arrest wanted suspects in the area of Wadi Burqin, between the town of Burqin and Jenin."}," Hindujas Not Imprisoned, Human Trafficking Charges Dismissed: Spokesperson ":{"img":"https://c.ndtvimg.com/2024-06/tg30klj_hindujas-afp_625x300_22_June_24.jpeg","link":"https://www.ndtv.com/world-news/hindujas-not-imprisoned-human-trafficking-charges-dismissed-spokesperson-5953187","content":"\"The four Swiss-national members of the Hinduja Family, Kamal and Prakash Hinduja, Namrata and Ajay Hinduja, have not been subjected to any imprisonment, conviction, sentence or detention,\" the spokesperson said in the statement.\"'\"The four family members have full faith in the Swiss judicial process and remain confident that the truth will prevail.\"In the statement, a spokesperson of the Hindujas said the family members have not been imprisoned and human trafficking charges against them has been dismissed.A spokesperson of the Hindujas said the family members have not been imprisonedFour members of Britain's richest family, the Hindujas, on Sunday said they have not been subjected to any imprisonment, conviction, sentence or detention.All of them further testified that the four Hinduja family members treated them with 'respect, dignity and like family."}," Israeli Defence Minister Heads To US For \"Critical\" Talks On Gaza War ":{"img":"https://c.ndtvimg.com/2024-06/7kvtbavs_yoav-gallant-1200_625x300_23_June_24.jpeg","link":"https://www.ndtv.com/world-news/israeli-defence-minister-heads-to-us-for-critical-talks-on-gaza-war-5952965","content":"- Lebanon tensions -The Gaza war broke out with Hamas's October 7 attack on southern Israel that resulted in the deaths of 1,194 people, mostly civilians, according to an AFP tally based on Israeli official figures.\"- 'War of annihilation' -In Gaza, Israeli forces kept striking targets and battling Hamas, the Islamist militant group Israel has vowed to destroy over its October 7 attack, in a war that has devastated much of the coastal territory.Israel's Defence Minister Yoav Gallant was headed to Washington on Sunday for \"critical\" talks on the Gaza war raging since October 7 and surging cross-border tensions with Lebanon's Hezbollah movement.A rally in Tel Aviv on Saturday evening drew more than 150,000 people, according to the organisation Israel Democracy HQ ~CHECK~ Hofshi B'Artzenu, which called it the biggest rally since the Gaza war began.As the Gaza war has raged on for over eight months, Israeli protesters have taken to the streets week after week demanding greater efforts to bring home the remaining hostages."}," Heavy Rain Triggers Floods And Landslides In Switzerland ":{"img":"https://c.ndtvimg.com/2024-06/9mkdlhl4_switzerland-rain-1200-_625x300_23_June_24.jpg","link":"https://www.ndtv.com/world-news/heavy-rain-triggers-floods-and-landslides-in-switzerland-5952872","content":"A search was still underway for three other people who police said could have been in their homes when the flooding took place.Emergency services with helicopters, drones and rescue dogs searched on Saturday for three people who were missing after violent downpours caused floods and landslides in southwestern Switzerland.Police urged people not to travel to the region as many roads were closed.Three houses and three cars were swept away by water in the village of Sorte, Grisons police said.In the western canton of Valais, 230 people were evacuated since Friday after heavy rainfall caused flooding and mudslides."}," Flights Cancelled At UK's 3rd-Busiest Airport After Power Cut ":{"img":"https://c.ndtvimg.com/2024-06/tm86m25o_manchester-airport-1200_625x300_23_June_24.jpeg","link":"https://www.ndtv.com/world-news/flights-cancelled-at-uks-3rd-busiest-manchester-airport-after-power-cut-5952843","content":"The Manchester Airports Group, which also operates London Stansted and the East Midlands airports, said Manchester Airport had been \"affected by a major power cut in the area earlier this morning.\"Power has now been restored at the international airport in the north of England, but passengers due to travel from Terminals One and Two were told to \"not come to the airport\" as all flights were cancelled \"until further notice\".Flights at the UK's third-busiest airport were being delayed or cancelled Sunday after a major power cut, the airport operator said.In August last year, the country faced its worst air traffic control disruption in almost ten years due to a technical fault.The UK's travel industry has been hit by a series of disruptions in the last few years, including technical problems and industrial action affecting rail and air passengers."}," Uproar After German Town Votes To Wipe Out Its Pigeon Population ":{"img":"https://c.ndtvimg.com/2023-01/su7fabg_pigeon-generic_625x300_20_January_23.jpg","link":"https://www.ndtv.com/world-news/german-town-votes-to-wipe-out-its-pigeon-population-heres-why-5951378","content":"(representational)A German town, Limburg an der Lahn, has voted to exterminate its entire population of pigeons, sparking a fight between the residents and animal rights activists.com/CZ2IZoxzeoAfter the referendum, Limburg's mayor Marius Hahn said the citizens had decided “that the pigeon population should be reduced over the next two years by a falconer who stuns and kills animals.In a post on X (formerly Twitter), DW added, “Animal rights activists are horrified that the cull is going ahead, while critics say that pigeon culls aren't really effective since any remaining birds will reproduce, replenishing the population.The report added that last year in November, the town's council decided that a falconer should be commissioned to kill Limburg's pigeon population.In one German town, however, pigeon-human relations have taken a macabre turn."}," Israeli Soldiers Tie Injured Palestinian To Jeep In West Bank, Video Viral ":{"img":"https://c.ndtvimg.com/2024-06/14eup9ns_palestinian-man-jeep_625x300_23_June_24.jpeg","link":"https://www.ndtv.com/world-news/israeli-soldiers-tie-injured-palestinian-to-jeep-in-west-bank-video-viral-5951073","content":"Israeli troops tied a wounded Palestinian man to a military vehicle during a raid in the occupied West Bank city of Jenin, the army said Sunday, admitting that soldiers had violated operational procedures.At least 549 Palestinians have been killed in the West Bank by Israeli troops or settlers since the Gaza war broke out, according to Palestinian officials.The incident will be investigated and dealt with accordingly,\" the military said, adding that the wounded man was transferred to the Palestinian Red Crescent for treatment.Attacks by Palestinians have killed at least 14 Israelis in the West Bank over the same period, according to an AFP tally of Israeli official figures.The military said the Palestinian was wounded during a \"counterterrorism operation\" launched to apprehend wanted suspects."}," Pakistan Man Tortured, Burnt Alive Over Quran Desecration, 27 Arrested ":{"img":"https://c.ndtvimg.com/2024-06/ppu3a0no_pak-man-burnt-alive_625x300_23_June_24.jpeg","link":"https://www.ndtv.com/world-news/pakistan-man-tortured-burnt-alive-over-quran-desecration-27-arrested-5950985","content":"According to Swat District Police Officer (DPO) Zahidullah Khan, the police had moved the suspect of the alleged desecration incident to the police station but a charged mob \"attacked the police station and took the suspect away\".In a shocking incident that took place in Pakistan's Swat, a mob allegedly tortured a man to death by burning him alive over alleged desecration of the Holy Quran.Videos making the rounds on social media show a mob circling a body on fire in the middle of the road, along with a large number of people outside a police station.Last month, police saved a Christian man from enraged people in Sargodha on allegations of desecration of the Holy Quran, He died nine days later due to his injuries.Furthermore, the police teams are conducting raids for more arrests in the Madyan incident."}," \"In 4 Years, Don't Vote, I Don't Care\": Trump's Election Appeal ":{"img":"https://c.ndtvimg.com/2024-06/p3aqmncg_donald-trump_625x300_23_June_24.jpg?im=FitAndFill,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/trump-implores-christians-to-boost-turnout-courts-black-voters-5950360","content":"\"We will also work to lift up Black, Hispanic and other communities in Philadelphia and all across the United States,\" Trump said.\"Biden won Pennsylvania in 2020, and his hopes of carrying the state in November's rematch with Trump will hinge in part on his ability to turn out Black voters and hold on to working-class voters in the state.Former President Donald Trump told evangelical voters they needed to boost their turnout at the polls as he sought in a pair of Saturday campaign events to shore up - and expand - his base.Polls show Biden's standing among minority voters has softened, possibly providing an opening to Trump and Republicans who hope to draw just enough support to win close battleground states.Later, the presumptive Republican presidential held a rally in North Philadelphia as part of his effort to make inroads with Black voters in the pivotal swing state of Pennsylvania."}," Beyond Nvidia: The Search For AI's Next Breakthrough ":{"img":"https://c.ndtvimg.com/2024-02/c47af5b_nvidia-_625x300_23_February_24.jpeg","link":"https://www.ndtv.com/world-news/beyond-nvidia-the-search-for-ais-next-breakthrough-5950184","content":"Another opportunity will come from highly specialized AI that will provide expertise and know-how based on proprietary data which won't be co-opted by voracious big tech.Groq CEO Jonathan Ross told AFP that Nvidia won't be the best at everything, even if they are uncontested for generative AI training.\"I don't think that there's a great opportunity to start a foundational AI company at this point in time,\" said Mike Myer, founder and CEO of tech firm Quiq, at the Collision technology conference in Toronto.Nvidia is now Big Tech's newest memberFor a few days, AI chip juggernaut Nvidia sat on the throne as the world's biggest company, but behind its staggering success are questions on whether new entrants can stake a claim to the artificial intelligence bonanza.Providing more specialized processing for the many demands of AI is an opportunity seized by Groq, a hot startup that has built chips for the deployment of AI as opposed to its training, or inference -- the specialty of Nvidia's world-dominating GPUs."}," Elon Musk Had Another Secret Child With Neuralink Employee: Report ":{"img":"https://c.ndtvimg.com/2024-06/8trrs42_elon-musk_625x300_15_June_24.jpeg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/elon-musk-had-another-secret-child-with-neuralink-employee-report-5950152","content":"A recent report claimed that a SpaceX employee alleged that Mr Musk had asked her to have his babiesTesla and Neuralink CEO Elon Musk had another child with one of his employees earlier this year, reports suggest.A recent Wall Street Journal report claimed that a woman, who resigned from SpaceX in 2013, alleged that Mr Musk had asked her to have his babies, on multiple occasions.Mr Musk and Shivon Zilis, head of Neuralink's special projects, had a third child together earlier this year, Bloomberg reported.\"Mr Musk has 11 living children who are publicly known: five with his first wife author Justine Musk, three with the musician Grimes, and three with Ms Zilis.Mr Zilis has said Mr Musk encouraged her to have children and later offered to be the sperm donor."}," Elephant In Zambia Pulls US Tourist Out Of Safari Vehicle, Tramples Her To Death ":{"img":"https://c.ndtvimg.com/2024-06/56qa5vdg_elephant-_625x300_23_June_24.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/elephant-in-zambia-pulls-us-tourist-out-of-safari-vehicle-tramples-her-to-death-5949792","content":"In a terrifying incident, a US tourist from New Mexico was killed by an elephant in Zambia after it attacked her vehicle during a safari drive on Wednesday.The incident occurred near the Maramba Cultural Bridge in Livingstone when the group had stopped due to traffic caused by an elephant herd.50 pm ''after being knocked from a parked vehicle which had stopped due to traffic caused by elephants around the Maramba Cultural Bridge'', Southern Province Police Commissioner Auxensio Daka told Zambian station ZNBC on Friday.In March, Gail Mattson, a 79-year-old woman from Minnesota, was killed in a similar incident during a game drive in Zambia's Kafue National Park.This tragic event marks the second fatal elephant attack on a US tourist in Zambia this year."}," US Military Destroys 3 Houthi Vessels In Red Sea, Rebels Strike Back ":{"img":"https://c.ndtvimg.com/2024-01/pr4n5o3c_houthi-rebels_625x300_26_January_24.jpeg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/us-military-destroys-3-houthi-vessels-in-red-sea-rebels-strike-back-5949744","content":"Separately, the Houthis launched three anti-ship ballistic missiles into the Gulf of Aden but there were no injuries or significant damage reported by U.forces destroyed three Iranian-backed Houthi uncrewed surface vessels in the Red Sea in the past 24 hours, the U."}," Green Card After Graduation? Donald Trump's U-Turn Gives Hopes To Indians ":{"img":"https://c.ndtvimg.com/2024-06/3irh8p6g_trump_625x300_23_June_24.jpeg","link":"https://www.ndtv.com/world-news/donald-trumps-u-turn-gives-green-card-hopes-to-indian-students-5949725","content":"Former US President Donald Trump, vying to return to the top post in elections due this year, has softened his stand on immigration with a new proposal that will benefit Indian and other foreign students.He said in the \"All-In\" podcast that he plans to offer Green Cards automatically as part of a diploma to students who graduate from a US college, which will help them continue their stay in the country.The Republican leader known for his staunch remarks against immigrants has promised that if he's elected, foreign students who graduate from US colleges will automatically get Green Card, which allows permanent residency in the US.\"Anybody graduates from a college, you go in there for two years or four years, if you graduate or you get a doctorate degree from a college, you should be able to stay in this country,\" Trump said.\"We force the brilliant people, the people that graduate from college, the people that are number one in their class from the best colleges, you have to be able to recruit these people and keep the people,\" the former president asserted."}}