{" Israel Army Says Hezbollah Fired Rocket That Killed 10 In Annexed Golan ":{"img":"https://c.ndtvimg.com/2024-07/16nkdeig_golan-attack_625x300_27_July_24.jpeg","link":"https://www.ndtv.com/world-news/9-killed-as-rocket-hits-football-pitch-in-israel-occupied-golan-report-6203464","content":"Two security sources in Lebanon said the four fighters killed in the Israeli strike on Kfarkila in southern Lebanon were members of different armed groups, with at least one of them belonging to Hezbollah.Ten people, including children, were killed in a rocket attack on a football ground in the Israeli-occupied Golan Heights on Saturday, Israel's N12 News reported, the worst incident yet in months of violence between Israel and armed groups in Lebanon.The Israeli military said the rocket was fired by Lebanese group Hezbollah.The attack on the soccer pitch followed an Israeli strike in Lebanon that killed four operatives on Saturday.The Israeli emergency service said earlier that nine people were critically wounded by a rocket fired from Lebanon that hit a village football pitch in the Druze village of Majdal Shams."}," 4 Hezbollah Fighters Killed In Israeli Strike As Tensions Flare-Up: Report ":{"img":"https://c.ndtvimg.com/2021-10/6e8i71v_missile-generic_650x400_17_October_21.jpg?im=FitAndFill,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/4-hezbollah-fighters-killed-in-israeli-strike-as-tensions-flare-up-report-6203385","content":"Hezbollah has exchanged near-daily cross-border fire with the Israeli army (Representational)An Israeli strike on south Lebanon killed four fighters of Iran-backed operative group Hezbollah on Saturday, a security source told AFP.Hezbollah, which has exchanged near-daily cross-border fire with the Israeli army since the Gaza war erupted last October, confirmed the deaths of four of its fighters.\"Four Hezbollah fighters were killed in an Israeli strike on the village of Kfar Kila,\" the source said, speaking on condition of anonymity."}," UK Police Arrest Two Men After Assault On Anti-Fascism Protester ":{"img":"https://c.ndtvimg.com/2024-04/2hmhj068_uk-police_625x300_12_April_24.jpeg","link":"https://www.ndtv.com/world-news/uk-police-arrest-two-men-after-assault-on-anti-facism-protester-6203183","content":"UK police arrested two men on Saturday following an assault on a participant in an anti-fascism protest, held to counter another nearby demonstration organised by far-right agitator Tommy Robinson.Meanwhile the counter-protest staged by Stand Up To Racism and others also rallied in the heart of London, with the Met imposing so-called conditions on the two marches \"with the aim of preventing serious disruption\".Thousands gathered in the heart of the British capital from late morning for the demonstration organised by Robinson, a far-right firebrand and founder of the now defunct Islamophobic English Defence League organisation.The Met, as the London force is known, said around 1,000 officers were on duty Saturday as part of the policing operation to deal with the two rallies, as well as another protest.\"Our first priority is to keep the peace to ensure that those exercising their right to lawful protest can do so safely,\" Chief Superintendent Colin Wingrove said ahead of the weekend events."}," Trump Vows To Hold Outdoor Rallies With More Security Despite Assassination Attempt ":{"img":"https://c.ndtvimg.com/2024-07/pigc5cvo_donald-trump-_625x300_21_July_24.jpeg","link":"https://www.ndtv.com/world-news/trump-vows-to-hold-outdoor-rallies-with-more-security-despite-assassination-attempt-6203014","content":"The FBI confirmed on Friday that Trump was hit by a bullet (File)Presidential candidate Donald Trump said Saturday he will return to holding outdoor rallies with additional Secret Service protection, two weeks after he was injured in an assassination attempt at an open-air campaign event.His remarks came after the Secret Service reportedly encouraged Trump's campaign to stop scheduling outdoor campaign events following his assassination attempt, opting instead for large indoor arenas.She told a congressional committee that the Secret Service was alerted \"two to five times\" ahead of the attack about a \"suspicious individual\" at the rally, but was unable to locate him before he opened fire.Trump was wounded when a 20-year-old gunman shot at him during an outdoor rally in Butler, Pennsylvania on July 13, killing one person and injuring two others.\"I will continue to do outdoor rallies, and the Secret Service has agreed to substantially step up their operation."}," Tourists Duped Into Eating Dog Meat In Bali, Authorities Launch Crackdown ":{"img":"https://c.ndtvimg.com/2024-07/8il4cb48_dogs_625x300_27_July_24.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/tourists-duped-into-eating-dog-meat-in-bali-authorities-launch-crackdown-6202972","content":"Notably, Bali has enacted a stringent ban on the dog meat trade, imposing severe penalties on offenders, including a maximum prison sentence of three months and a hefty fine of up to 50 million rupiah (approximately 2,300 pounds), serving as a strong deterrent to those who would engage in this illicit activity.On Thursday, Bali officials seized hundreds of kilograms of raw dog meat and numerous skewers from vendors, despite a comprehensive ban on the trade of such meat on the popular resort island, the Independent reported.Two of the vendors had previously received warnings from Bali Police regarding their engagement in the trade of dog meat.Dewa Nyoman Rai Dharmadi, head of the Bali Public Order Agency, said that inspections conducted this week found three vendors still peddling dog meat, defying local regulations that prohibit its sale.Unlike regulated agricultural practices, the dog meat trade often relies on the inhumane seizure of dogs that are not raised for food, including stolen pets, community-owned dogs, and street dogs."}," 11-Year-Old Chinese Boy Writes 600 Lines Of Code To Build Rocket ":{"img":"https://c.ndtvimg.com/2024-07/stai7i2_code_625x300_27_July_24.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/11-year-old-chinese-boy-writes-600-lines-of-code-to-build-rocket-6202767","content":"The young prodigy has been documenting his rocket development journey on social mediaYan Hongsen, an 11-year-old from Zhejiang, China, has become an online sensation after writing 600 lines of code to build a rocket.The young prodigy has been documenting his rocket development journey on social media, gaining over 440,000 followers.''His parents are remarkable for unconditionally supporting their child's dreams,'' wrote one user, while another commented, ''This must be the youngest person to build a rocket in China.The boy's father shared his pride and excitement with SCMP recalling the maiden launch, ''Although the rocket crashed, I considered its first flight a triumph.His ultimate dream is to build a real rocket for China to explore the universe."}," How El Chapo's Son Helped US Arrest Famous Narco Chief El Mayo ":{"img":"https://c.ndtvimg.com/2024-07/gg6p3imo_el-chapo-and-el-mayo_625x300_27_July_24.jpeg","link":"https://www.ndtv.com/world-news/how-el-chapos-son-helped-us-arrest-famous-narco-chief-el-mayo-6202689","content":"The other passenger - legendary septuagenarian trafficker Ismael \"El Mayo\" Zambada - did not and was duped into getting on the plane by the younger man, according to two current and two former U.Guzman Lopez had convinced Zambada to board the plane by telling him that they were flying to see real estate in northern Mexico, according to the two current and one former U.The unexpected arrest of El Mayo, in his late 70s, and the way he appears to have been betrayed by Guzman Lopez, who is about 38 years old, has jolted the Mexican drug trafficking world, triggering fears of a bloody fissure in the Sinaloa Cartel between the two families that control the group's biggest power bases.Federal Bureau of Investigation (FBI) and the Homeland Security Investigations (HSI), the two agencies who carried out the operation, scrambled agents from their local El Paso offices and barely reached the airport by the time the private plane was landing, according to a fifth source, a U.agents raced to meet it at a small municipal airport near El Paso, Texas, and arrest two men who were part of Mexican drug trafficking royalty."}," Donald Trump Tells Christians They Won't Have To Vote After This Election ":{"img":"https://c.ndtvimg.com/2024-07/vqggd4j8_donald-trump-florida_625x300_27_July_24.jpeg","link":"https://www.ndtv.com/world-news/donald-trump-tells-christians-they-wont-have-to-vote-after-this-election-6202477","content":"In four years, you don't have to vote again, we'll have it fixed so good you're not going to have to vote,\" Trump said.\"I love you, get out, you gotta get out and vote,\" Donald Trump saidRepublican presidential candidate Donald Trump told Christians on Friday that if they vote for him this November, \"in four years, you don't have to vote again.In May, speaking at a National Rifle Association gathering, Trump quipped about serving more than two terms as president.If Trump wins a second term in the White House, he can serve only four more years as president.Four more years, you know what, it will be fixed, it will be fine, you won't have to vote anymore, my beautiful Christians."}," 170 Killed, Hundreds Wounded In Days-Long Israeli Operation In Gaza ":{"img":"https://c.ndtvimg.com/2024-07/vtksln98_khan-younis_625x300_27_July_24.jpeg","link":"https://www.ndtv.com/world-news/170-killed-hundreds-wounded-in-days-long-israeli-operation-in-gaza-6202313","content":"\"Since the beginning of the Israeli military operation in the Khan Yunis area, we are talking of approximately 170 martyrs and hundreds of wounded,\" agency spokesman Mahmud Bassal told AFP.The United Nations said more than 180,000 Palestinians have fled Khan YunisGaza's civil defence agency said Saturday that Israel's military operation around Khan Yunis has killed about 170 people and wounded hundreds since it started on Monday.The Israeli military said it launched the operation to halt rocket fire from the area, which already saw heavy fighting earlier this year.\"Earlier on Saturday the military issued new evacuation orders for residents of the southern city, after retrieving the bodies of five Israelis and warning of new operations.The United Nations said more than 180,000 Palestinians have fled Khan Yunis since the Israeli operation began on Monday."}," Antony Blinken Raises Concern Over China's \"Provocative\" Actions Around Taiwan ":{"img":"https://c.ndtvimg.com/2024-07/tlr2l40g_antony-blinken_625x300_27_July_24.jpeg","link":"https://www.ndtv.com/world-news/antony-blinken-raises-concern-over-chinas-provocative-actions-around-taiwan-6202074","content":"The talks on the sidelines of a foreign ministers meeting of the Association of Southeast Asian Nations (ASEAN) lasted for one hour and twenty minutes, according to a senior State Department official.Blinken raised \"US concerns about provocative actions\" by China, the official said (File)The United States hailed \"open and productive\" discussions between China's foreign minister and Secretary of State Antony Blinken in Laos on Saturday in which Blinken raised US concerns over Beijing's \"provocative actions\" around Taiwan.- China, Russia talk security -Blinken arrived in Laos two days after the foreign ministers of China and Russia met with the 10-nation ASEAN bloc -- and each other on the sidelines of the meeting.Blinken raised \"US concerns about provocative actions\" by China, including a simulated blockade of Taiwan following the May inauguration of its new president Lai Ching-te, the official said.\"The US Army said in April it had deployed the Mid-Range Capability missile system in the northern Philippines for annual joint military exercises."}," Passengers Struggle As France Suffers Second Day Of Sabotage Train Delays ":{"img":"https://c.ndtvimg.com/2024-07/qgjtbsko_france-railways-afp-_625x300_27_July_24.jpeg","link":"https://www.ndtv.com/world-news/passengers-struggle-as-france-suffers-second-day-of-sabotage-train-delays-6202011","content":"Nearly one third of trains were cancelled in northern, western and eastern France.No claim of responsibility has been made for the meticulously planned night-time attacks on cabling boxes at junctions north, southwest and east of the French capital, just ahead of Friday's Olympics opening ceremony in Paris.Tens of thousands of rail passengers struggled through a second day of cancelled trains Saturday as investigators tracked saboteurs who paralysed the network just ahead of the Paris Olympics opening ceremony.One doesn't have any choice,\" commented Cecile Bonnefond, whose train from Lille to the western city of Nantes was cancelled.\"Everything will be back to normal for Monday morning,\" SNCF president Farandou told reporters at Paris Montparnasse station."}," As Racist, Sexist Attacks Fly, Republicans Grapple With How To Take On Kamala Harris ":{"img":"https://c.ndtvimg.com/2024-07/bg80adm8_kamala-harris-reuters-_625x300_24_July_24.jpeg","link":"https://www.ndtv.com/world-news/as-racist-sexist-attacks-fly-republicans-grapple-with-how-to-take-on-kamala-harris-6201977","content":"In interviews with nine Republican lawmakers and 11 Black Republican women who back Trump, eight said personal attacks on Harris should be avoided.Easley, the radio show host, said she suggested to Trump campaign officials they engage Black allies more to counter Harris \"without the veil of racism being attached to it.The tension suggests Trump campaign efforts to tie Harris to President Joe Biden's record - particularly on immigration, crime and the economy - risk being overshadowed by personal attacks that show no signs of slowing.Trump allies, including some members of the \"Black Americans for Trump\" coalition, warn that disparaging Harris could hurt him in his outreach to Black voters, a crucial demographic in the Nov.\"I'm going to oppose Vice President Harris because of what she's done, not who she is,\" said Representative Dusty Johnson, who chairs the 75-member Republican Main Street Caucus."}," Killer Whales Sink $128,000 Yacht In Mediterranean Sea In Harrowing 2-Hour Attack ":{"img":"https://c.ndtvimg.com/2024-07/kunbhvcg_killer-whales_625x300_27_July_24.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/killer-whales-sink-128-000-yacht-in-mediterranean-sea-in-harrowing-2-hour-attack-6201510","content":"The five orcas circled the boat and, in a coordinated assault, took turns ramming it to piecesA $128,000 yacht was attacked and sunk by a group of killer whales in the Mediterranean Sea, leaving the crew in shock.The five orcas circled the 39-foot sailing boat and, in a coordinated assault, took turns ramming it to pieces around 8 p.Their sole intention was to sink the boat, and that was it,'' Mr Powell, who was meant to be celebrating his birthday aboard the boat, said.According to New York Post, Robert Powell, 59, and his crew were just 22 hours into their 10-day trip from Vilamoura, Portugal, to Greece on Wednesday when they saw killer whales approaching them.Fortunately, a Spanish salvage vessel intervened, evacuating the crew just moments before the sailboat plunged 130 feet into the Mediterranean, disappearing beneath the waves."}," French Rail Chief Says Trains To Run Normally From Monday After Sabotage ":{"img":"https://c.ndtvimg.com/2024-07/joe8rf28_french-rail-sabotage_625x300_27_July_24.jpeg","link":"https://www.ndtv.com/world-news/french-rail-chief-says-trains-to-run-normally-from-monday-after-sabotage-6201502","content":"There has been no immediate claim of responsibilityTraffic on France's high-speed rail network should be back to normal by Monday, Transport Minister Patrice Vergriete said after sabotaged signal stations and cables caused travel chaos on Friday, the opening day of the Olympic Games.Friday's pre-dawn attacks on the high-speed rail network damaged infrastructure along the lines connecting Paris with cities such as Lille in the north, Bordeaux in the west and Strasbourg in the east.(0530 GMT) while on the North, Brittany and South-West high-speed lines, 7 out of 10 trains on average will run with delays of 1 to 2 hours,\" it said.\"On the Eastern high-speed line, traffic resumed normally this morning at 6:30 a.There has been no immediate claim of responsibility."}," Kamala Harris Cuts Down Donald Trump's Lead Sharply, Show Latest Polls ":{"img":"https://c.ndtvimg.com/2024-07/kqs5e0o4_kamala-harris-donald-trump_625x300_27_July_24.jpeg","link":"https://www.ndtv.com/world-news/kamala-harris-neck-and-neck-with-donald-trump-show-latest-polls-6201284","content":"US Vice President Kamala Harris, the most likely candidate to replace Joe Biden as the Democratic Party nominee for the November 5 presidential elections, has narrowed the margin against Donald Trump, according to latest polls.This came after US President Joe Biden, 81, on July 21 announced his exit from the presidential race and endorsed Harris as the nominee of the party.According to a New York Times/Siena College poll of 1,142 voters nationwide conducted between July 22-24, Trump leads Harris 48% to 47% among likely voters in a head-to-head match.According to Bloomberg, an unweighted average of the polls conducted after Biden left the presidential race shows Harris trailing Trump by 1.What polls sayThe latest Wall Street Journal poll shows Harris and Trump neck-and-neck at 49% to 47% in a two-person matchup."}}