{" Neuralink Says Its First Brain Chip Implant Has Encountered A Problem ":{"img":"https://c.ndtvimg.com/2024-03/k88hjr0g_noland-arbaugh_625x300_24_March_24.jpeg","link":"https://www.ndtv.com/world-news/neuralink-says-its-first-brain-chip-implant-has-encountered-a-problem-5624317","content":"Neuralink's system, called the Link, records neural signals using 1,024 electrodes across 64 threads that are \"thinner than the human hair\".Neuralink shared its blog post after the Journal asked the company about the issue, according to the outlet.It added that despite the retraction of threads, Mr Arbaugh is using the company's system for around eight hours a day during the week, and often as many as 10 hours a day on the weekends.Neuralink's implant allows a patient to use their thoughts to control a computer.But in a blog post on Wednesday, the company said the amount of data it was receiving from the device has reduced."}," Boeing Plane Skids Off Runway At Senegal Airport, Flights Suspended ":{"img":"https://c.ndtvimg.com/2024-05/boled3oo_senegal-airport_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/boeing-skids-off-runway-at-senegals-main-airport-many-flights-suspended-5624105","content":"Flights have been suspended at Senegal's main airport near the capital Dakar after a plane skidded off the runway, a source at Blaise Diagne airport told Reuters.A night-time video shared on social media showed a plane with the logo of Senegal-based airline Transair standing in grass with a wing covered in fire-suppressing foam.ALSO READ | Boeing Cargo Plane Lands Without Front Landing Gear In Istanbul, No CasualtiesReuters was not able to verify the video.Some media reports claimed that the plane was a Boeing 737-38J.A Transair Boeing 737-38J (6V-AJE) suffered a runway excursion at Dakar Airport, Senegal."}," After 193 Years, London's Male-Only Garrick Club Opens Doors To Women ":{"img":"https://c.ndtvimg.com/2024-05/obp6b4q8_londons-garrick-club_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/after-193-years-londons-male-only-garrick-club-opens-doors-to-women-5623992","content":"London's Garrick Club is a prestigious private members' club established in 1831.London's historic Garrick Club, a private members' club established in 1831, has voted to allow women to join for the first time.\"It will become a much better club with women in it,\" one member told The Guardian, asking not to be named.This move marks a significant shift for the prestigious club, long criticised for its lack of gender diversity.\"What is the Garrick Club?"}," Air Vanuatu Cancels International Flights As Insolvency Looms ":{"img":"https://c.ndtvimg.com/2024-04/l4ve38kg_flight-generic-bloomberg_625x300_25_April_24.jpeg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/air-vanuatu-cancels-international-flights-amid-insolvency-concerns-5623771","content":"The airline said it had been operating in a \"challenging environment\" (Representational)State-owned Air Vanuatu scrapped international flights Thursday as the Pacific island's government considered launching an insolvency procedure.Air Vanuatu is one of the few airlines servicing the South Pacific archipelago with international flights, and the company's demise could hit foreign tourism earnings.\"The Vanuatu Government is now considering placing Air Vanuatu, the national carrier of Vanuatu, into voluntary administration,\" the airline said in a statement.Vanuatu's tourism office said it was in contact with the airline and the government.Two of its aircraft, a Boeing 737 and an Airbus A320, are grounded and require engineering work at a time of limited international supply of spare parts, the airline said in an online update."}," Pics: Therapy Dogs At Istanbul Airport Help Flyers Release Stress ":{"img":"https://c.ndtvimg.com/2024-05/h61dbvfg_therapy-dogs_625x300_09_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/pics-therapy-dogs-at-turkeys-istanbul-airport-help-flyers-release-stress-5623408","content":"\"Travellers pet a therapy dog before they board their flight at the Istanbul AirportPhoto Credit: AFPThe two dogs -- part of a five-member team -- and their handlers have for past two months been roaming certain spots, mingling with passengers awaiting flights at the mega airport, a global hub that served more than 76 million passengers last year.\"\"A child pets a therapy dog at the Istanbul AirportPhoto Credit: AFPAlita's trainer Volkan Gul shared an anecdote from one of the moments at the airport.\"Therapy dog providing solace to stressed travellers before they board their flight at the Istanbul AirportPhoto Credit: AFPDozens of airports in the United States have therapy dog programmes -- a concept that originated after the 9/11 attacks with the goal of providing comfort and relief for passengers dealing with anxieties of air travel.Therapy dogs roam the Istanbul Airport with airport personnel searching for stressed travellersPhoto Credit: AFPFive dogs including Kuki and Alita went through serious training, roaming domestic and international terminals.The dogs are the only canines permanently stationed at the airportSix-year-old Kuki and one-and-a-half-year-old Alita recently joined the staff of Istanbul Airport, one of the busiest in the world, with a mission to provide solace for stressed travellers."}," \"Difficult, Very Disappointing Statement\": Israel On Joe Biden's Warning ":{"img":"https://c.ndtvimg.com/2024-05/oh8gta3g_joe-biden_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/israel-hamas-war-rafah-difficult-very-disappointing-statement-israel-on-joe-bidens-warning-5623279","content":"File photoIsrael's ambassador to the United Nations expressed disappointment Thursday at US President Joe Biden's threat to stop certain arms supplies to Israel if it invades the crowded Gaza city of Rafah.\"AFP journalists reported heavy shelling in Rafah early Thursday, and the Israeli military later said it was also striking \"Hamas positions\" further north in the centre of the Gaza Strip.\"This is a difficult and very disappointing statement to hear from a president to whom we have been grateful since the beginning of the war,\" Gilad Erdan told Israeli public broadcaster Kan radio, in Israel's first reaction to Biden's warning.On Tuesday, Israeli forces seized Rafah's border crossing into Egypt, which has served the main entry point for aid into besieged Gaza.to deal with the cities,\" Biden said in an interview with CNN, in his starkest warning to Israel since the start of the war."}," South Korea President Admits \"Shortcomings\" In Rare Press Conference ":{"img":"https://c.ndtvimg.com/2024-05/ul5esd8o_south-korea-president_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/south-koreas-president-yoon-suk-yeol-admits-shortcomings-in-rare-press-conference-5623260","content":"The press conference was South Korean President Yoon Suk Yeol's first in nearly two yearsSouth Korean President Yoon Suk Yeol held a rare press conference Thursday, admitting \"shortcomings\" after his party's recent electoral defeat, and laying out policies on issues from the country's low birthrate to Russia's war in Ukraine.\"In order to overcome the low birth rate, which can be considered a national emergency, we will fully mobilise all of the state's capabilities,\" he added.Yoon, who has taken a tough line with the nuclear-armed North, said his country's ties with Moscow had been strained by what Seoul and ally Washington say are arms shipments from North Korea to Russia.Yoon said he would ask lawmakers to cooperate \"to set up the Ministry of Low Birth Rate Counter Planning\",\"We will be creating a low-birth planning department in order to establish a more aggressive and powerful control tower,\" he said.On Ukraine, Yoon vowed to keep strong ties with Kyiv while maintaining a smooth relationship with Russia, ruling out direct weapons shipments and telling reporters that it was his \"firm stance\" not to send lethal arms to countries at war."}," Stormy Daniels To Return To Witness Stand At Trump's Historic Hush Money Trial ":{"img":"https://c.ndtvimg.com/2024-05/6r5uq6j_trump-trial_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/stormy-daniels-to-return-to-witness-stand-at-donald-trumps-historic-hush-money-trial-5623104","content":"\"Trump has denied having sex with Daniels and his lawyers asked the judge for a mistrial on the grounds her testimony was \"extremely prejudicial\" in what is essentially a financial records and election-related case.Speaking at a machine-gun pace that had the judge telling her to slow down at times, Daniels walked the New York jury through the one-night stand she said she had with Trump at a celebrity golf tournament.Speaking to reporters after the court adjourned on Tuesday, Trump called the case a \"disgrace\" and said he \"should be out campaigning right now.The X-rated film actress, who claims to have had sex with the married Trump in 2006, spent nearly five hours testifying on Tuesday, recounting the incident in often explicit detail as the real estate tycoon sat stewing just feet away.\"Merchan has imposed a gag order on Trump prohibiting him from publicly attacking witnesses and the ex-president -- who has traded insults with Daniels for years, calling her \"horseface\" and other crude slurs -- did not comment directly on her testimony."}," Women-Only Exhibit In Australian Museum To Become Toilet To Keep Men Out ":{"img":"https://c.ndtvimg.com/2024-05/2kn6ofjg_ladies-lounge-aus_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/women-only-exhibit-in-australian-museum-to-become-toilet-to-keep-men-out-5623094","content":"According to the BBC, Ms Kaechele said she will challenge the ruling by making the space \"compliant\" with regulations, and by turning it into a women's toilet and a church - allowing it to operate as a women-only space under legal exemptions.An Australian museum, fighting to keep its exhibition open only to women, is installing a toilet in the gallery to keep men out.\"There is a fabulous toilet coming to the Ladies Lounge, and so in that sense the Ladies Lounge will operate as a ladies' room,\" Ms Kaechele said.The toilet will be installed in the next 45 days, the outlet reported.The toilet will be installed in the next 45 days."}," Japan Grapples With 9 Million Empty Homes, More Than The Population Of New York ":{"img":"https://c.ndtvimg.com/2024-05/0e1s6lqg_-japan_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/japan-grapples-with-9-million-empty-homes-more-than-the-population-of-new-york-5623051","content":"Some houses are also left in administrative limbo because local authorities don't know who the owners are due to poor record-keeping, they said.But with Japan's plummeting fertility rate, many are left with no heir to pass to or are inherited by younger generations who have moved to the cities and see little value in returning to rural areas, experts told CNN.This phenomenon presents a significant challenge for the government, which is already grappling with an ageing population and a low birth rate.Japan is confronting a significant problem with vacant houses, reaching a record of nine million - exceeding the population of New York City.They aren't all left to ruin, like traditional akiya, whose growing number presents a range of other problems for the government and communities, experts told CNN."}," Saudi Forces \"Told To Kill\" To Clear Land For Futuristic City Neom: Report ":{"img":"https://c.ndtvimg.com/2022-07/ud9n83do_saudi-megacity-neom-afp_625x300_29_July_22.jpg","link":"https://www.ndtv.com/world-news/saudi-forces-told-to-kill-to-clear-land-for-futuristic-city-neom-report-5623040","content":"Authorities in Saudi Arabia have permitted the use of lethal force to clear land for Neom, a $500 billion smart city project planned by Crown Prince Mohammed bin Salman (MBS).The Saudi government and Neom management have refused to comment.According to official government figures, more than 6,000 people have been moved for the project, though UK-based human rights group ALQST estimates the number to be higher.Neom is part of Saudi Vision 2030.The futuristic megacity is touted to be 33 times the size of New York, with an area of 26,500 km square extending along the Aqaba Gulf and Saudi Arabia's Red Sea coastline."}," Explained: How Australia's New Student Visa Rule Change Affects Indians ":{"img":"https://c.ndtvimg.com/2020-07/t8d2vrek_australia-generic-sydney-generic-sydney-opera-house-pixabay_625x300_29_July_20.jpg","link":"https://www.ndtv.com/world-news/australia-student-visa-explained-how-australias-new-student-visa-rule-change-affects-indians-5617681","content":"Australia Student Visa: The required amount will now be 75% of the national minimum wage.According to Australia Visa News, the number of temporary student visas granted in the country reached a record high of 6,54,870 in July 2023, marking a significant increase from the previous year.The Skilled-Recognised Graduate visa, which previously allowed recent engineering graduates to stay, work, or study in Australia for up to 18 months, now has a limit on it from December 22, 2023.The required amount will now be 75% of the national minimum wage.The Australian government replaced the Genuine Temporary Entrant (GTE) requirement with a Genuine Student (GS) requirement to make sure students are genuinely coming to study, and not just to work."}," Israel Continues Rafah Operation Despite Joe Biden's Warning ":{"img":"https://c.ndtvimg.com/2024-05/rpflj5oo_israeli-army-rafah_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/israel-defies-international-objections-by-shelling-rafah-despite-warnings-5622924","content":"AFP journalists reported heavy shelling in Rafah early Thursday, and the Israeli military later said it was also striking \"Hamas positions\" further north in the centre of the Gaza Strip.Israel also said it was striking \"Hamas positions\" further north in the centre of the Gaza Strip (File)Israel shelled Rafah on Thursday as US President Joe Biden offered his starkest warning yet over the conduct of its war against Hamas, vowing to cut off arms transfers if an offensive into the southern Gaza city goes ahead.The war in Gaza was sparked by Hamas's unprecedented October 7 attack on Israel, which resulted in the deaths of more than 1,170 people, mostly civilians, according to an AFP tally of Israeli official figures.Israel in response vowed to crush Hamas and launched a military offensive that has killed at least 34,844 people in Gaza, mostly women and children, according to the Hamas-run territory's health ministry.Israel's seizure of the Palestinian side of the Rafah crossing came after Hamas said it had accepted a truce proposal -- one Israel said was \"far\" from what its own negotiators had previously agreed to."}," Sydney Council's Ban On Same-Sex Parenting Books In Libraries Sparks Uproar ":{"img":"https://c.ndtvimg.com/2024-05/q1bbc15g_lgbtq_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/sydney-councils-ban-on-same-sex-parenting-books-in-libraries-sparks-uproar-5622722","content":"The amendment, put forward by the former mayor and current councillor Steve Christou, proposed that the council take immediate action to remove same-sex parenting books and materials from its library services.\"I am greatly concerned at the decision of Cumberland council and believe that it may possibly risk breaching the guidelines for funding of libraries and may also be in breach of the Anti-Discrimination Act,\" she said, as per The Guardian.\"(Representative pic)A Sydney council has voted to ban same-sex parenting books from local libraries, sparking discrimination and censorship concerns.\"We are examining the consequences this decision may have for the council continuing to receive library funding from the NSW government,\" he added.The former mayor added that toddlers shouldn't be \"exposed\" to same-sex content and that the proposed amendment was \"for the protection and safety of our children\"."}," Explained: How Record-Breaking Heat Is Impacting Education In Asia ":{"img":"https://c.ndtvimg.com/2024-05/7fo5rgtg_heatwave-student_625x300_09_May_24.jpeg","link":"https://www.ndtv.com/world-news/explained-how-record-breaking-heat-is-impacting-education-in-asia-5622654","content":"(File)Record-breaking heat last month that prompted governments in Asia to close schools offers fresh evidence of how climate change is threatening the education of millions of children.\"The climate crisis is already a reality for children in East Asia and Pacific,\" the UN children's agency UNICEF warned last year.They may be left unsupervised by parents who cannot afford to stay home, and school closures put children at higher risk of child labour, child marriage and even trafficking, said Sengupta.Asia is warming faster than the global average, and climate change is producing more frequent, longer, and more intense heatwaves.Developing countries in the region need help to invest in upgrading infrastructure, said Sengupta, but the only real solution to the crisis lies in tackling the root cause: climate change."}}