{" China's Gen-Z Consumers Are Increasingly Investing In 'Gold Beans', What Are These? ":{"img":"https://c.ndtvimg.com/2024-01/cjohjg8g_gold-bars_625x300_07_January_24.jpeg","link":"https://www.ndtv.com/world-news/chinas-gen-z-consumers-are-increasingly-investing-in-gold-beans-what-are-these-5255006","content":"''Little one-gram beans of gold are particularly attractive to Gen Z customers, while young couples and middle-class women prefer gold bars – the 10-gram and 50-gram bars are especially popular,” Fred Qiu, a business-development manager for a jewellery brand in eastern China told South China Morning Post.These beans have particularly become very popular among China's Generation ZYoung Chinese people have recently developed an appetite for gold products and are increasingly purchasing 'gold beans' as a safe investment amid economic uncertainty.According to Reuters, analysts expect Chinese demand for gold to remain high as economic growth grinds lower in coming years and foreign investment outflows weigh on the yuan.Traditionally, China's middle-aged and elderly were the primary consumers of gold, but now, Gen Z is also moving towards these products and seeing them as viable long-term investments.8 per cent over the past three decades, and the global spot prices for gold hit all-time highs late last year, signaling its status as a reliable investment."}," X Post Shows Nations That Deny Entry To Israelis, Country Says ''We're Good'' ":{"img":"https://i.ndtvimg.com/i/2016-09/israel-flag-istock_650x400_71474453624.jpg","link":"https://www.ndtv.com/world-news/x-post-shows-nations-that-deny-entry-to-israelis-country-says-were-good-5254780","content":"'As of 2024, Israeli citizens have visa-free or visa-on-arrival access to 171 countries and territories, ranking the Israeli passport 20th in the world according to the Henley Passport Index.Israeli passport holders can travel to numerous countries without the hassle of arranging a visa, such as the majority of European nations, both inside and outside of the European Union, as well as most of Latin America and the Caribbean.The official X handle of the State of Israel has reacted to a post that lists the names of countries that deny entry to Israeli passport holders.The Israeli passport is currently ranked 20th place on the Henley Passport Index.However, to enter the remaining countries, Israeli passport holders must apply for a visa beforehand."}," \"Too Old, Mentally Unfit To Be President\": Joe Biden Jabs Donald Trump ":{"img":"https://c.ndtvimg.com/2024-03/svuvbrhc_trump-biden-split-reuters_625x300_06_March_24.jpg","link":"https://www.ndtv.com/world-news/joe-biden-donald-trump-2024-us-presidential-elections-one-candidate-is-too-old-mentally-unfit-to-be-president-biden-jabs-trump-5254629","content":"Joe Biden was making his first speech as president at the annual white tie galaUS President Joe Biden joked about Donald Trump and his own age at an annual media dinner on Saturday -- before unloading deadly serious criticisms of his rival in November's election.Democrat Biden was making his first speech as president at the annual white tie gala for the US media and political elite, an event that Republican former president Trump addressed in 2018.\"One candidate's too old and mentally unfit to be president,\" the 81-year-old Democrat quipped at the Gridiron Club in Washington.But Biden then returned to Trump, saying that the Democrats' election campaign would show how they rebuilt the US economy after the Covid-19 pandemic \"without encouraging the American people to inject bleach.\"In his own appearance at the Gridiron Club six years ago, Trump did trade unusually playful digs with the Washington press corps and also joked about North Korea and his own leadership style."}," Australia Foreign Minister Penny Wong Marries Longtime Partner, Shares Pic ":{"img":"https://c.ndtvimg.com/2024-03/66m1vh3_penny-wong_625x300_17_March_24.jpg","link":"https://www.ndtv.com/world-news/australia-foreign-minister-penny-wong-marries-longtime-partner-sophie-allouache-shares-pics-5254243","content":"A post shared by Penny Wong (@senatorpennywong)Wong and Allouache have been together for nearly two decades and tied the knot on Saturday at a winery in Adelaide, the capital of South Australia, The Sydney Morning Herald reported.Wong represents the state of South Australia in the senate.Penny Wong married Sophie Allouache in AdelaideAustralia's Foreign Minister Penny Wong, the country's first openly gay female parliamentarian, has married her partner Sophie Allouache, Wong said on Sunday.Same-sex marriage became legal in Australia in 2017, a watershed for a country where homosexuality was not decriminalised in all states until 1997.A Labor senator since 2002, Wong is the first Asian-born person to hold an Australian cabinet position."}," Kate Middleton's Senior Staff Have Not \"Seen Or Spoken\" To Her: Report ":{"img":"https://c.ndtvimg.com/2024-03/7hthfc4g_kate-middleton_625x300_17_March_24.jpeg","link":"https://www.ndtv.com/world-news/kate-middletons-senior-staff-have-not-seen-or-spoken-to-her-report-5254085","content":"According to Kensington Palace, the 42-year-old is recovering at home after a \"planned abdominal surgery\" in January, but some users believe the royal is in an \"induced coma\".According to the New York Post, some of them had no idea about the surgery until it was announced by Kensington Palace.\"Kate Middleton, Princess of Wales, has been away from the public eye since December, leaving social media users speculating about the UK royal.It added that the palace is keeping the royal's post-op recuperation \"very hush-hush.\"A few of Kate's senior staffers haven't been able to see or speak to her, and they didn't even know about the surgery until it was announced, so it's caught them off guard,\" a source told Us Weekly."}," Space-Dining For $500 Million: Top Chef's Latest Offering ":{"img":"https://c.ndtvimg.com/2024-03/0deefsv_spacevip-dine-in-space_625x300_17_March_24.jpeg","link":"https://www.ndtv.com/world-news/dinner-in-space-by-michelin-starred-chef-to-cost-half-a-million-dollars-5253970","content":"SpaceVIP, a luxury space travel company, has hired a Danish chef from a Michelin-starred restaurant for the six-hour high-tech space balloon trip, which is set to debut next year.But this is after all the first launch with these food experiences on board,\" said Munk, who will be joining the trip himself.Read | Elon Musk's SpaceX Building Spy Satellite Network For US Intel Agency: ReportDespite the expensive price tag, Munk said there are more people interested in the first trip than they can fit on the spacecraft.Last year, the France-based company Zephalto announced that they wanted to offer people the chance to eat on a balloon at the edge of the stratosphere for at least $132,000, starting in 2025.SpaceVIP isn't the first business to offer the chance to eat in space."}," Donald Trump Warns Of \"Bloodbath\" If He's Not Elected, Joe Biden Responds ":{"img":"https://c.ndtvimg.com/2024-01/ngj8p6f8_donald-trump-reuters_625x300_16_January_24.jpeg","link":"https://www.ndtv.com/world-news/if-i-dont-get-elected-its-going-to-be-a-bloodbath-donald-trump-warns-voters-ahead-of-2024-us-presidential-elections-5253833","content":"\"The date -- remember this, November 5 -- I believe it's going to be the most important date in the history of our country,\" the 77-year-old told rally-goers in Vandalia, Ohio, repeating well-worn criticisms that his rival, President Joe Biden, is the \"worst\" president.Donald Trump was addressing a rally in Ohio (File)Donald Trump told a rally in Ohio on Saturday that November's presidential election will be the \"most important date\" in US history, painting his campaign for the White House as a turning point for the country.\"He wants another January 6 but the American people are going to give him another electoral defeat this November because they continue to reject his extremism, his affection for violence, and his thirst for revenge,\" the campaign said, referring to the deadly attack on the US Capitol by Trump supporters in 2021.The rally came a day after Trump's former vice president, Mike Pence, said he would not endorse his old boss for a second White House term.Earlier this month Trump and Biden each won enough delegates to clinch their party nominations in the 2024 presidential race, all but assuring a rematch and setting up one of the longest election campaigns in US history."}," \"In The Name Of Humanity...\": WHO Appeals To Israel To Stop Planned Assault On Rafah ":{"img":"https://c.ndtvimg.com/2024-03/cg70vj08_gaza-children_625x300_13_March_24.jpeg","link":"https://www.ndtv.com/world-news/in-the-name-of-humanity-who-appeals-to-israel-to-stop-planned-assault-on-rafah-5253693","content":"Benjamin Netanyahu approved the military's \"plans for action in Rafah\" (File)The head of the World Health Organisation on Saturday appealed to Israel \"in the name of humanity\" not to launch an assault on Rafah, where most of Gaza's population is sheltering.Israel has carried out relentless bombardment and a ground invasion in response that has killed at least 31,553 people in Gaza, most of them women and children, according to the health ministry.Further escalation of violence in this densely populated area would lead to many more deaths and suffering, especially with health facilites already overwhelmed.\"I'm gravely concerned about reports of an Israeli plan to proceed with a ground assault on Rafah,\" WHO chief Tedros Adhanom Ghebreyesus wrote on X, formerly Twitter.\"I'm gravely concerned about reports of an Israeli plan to proceed with a ground assault on Rafah."}," Watch: Car Rally In UK To Show 'Unwavering Support' For PM Modi For Lok Sabha Polls ":{"img":"https://c.ndtvimg.com/2024-03/f6npq438_rally_625x300_17_March_24.jpeg","link":"https://www.ndtv.com/world-news/overseas-friends-of-bjp-car-rally-organised-in-uk-to-show-unwavering-support-for-pm-modi-for-lok-sabha-polls-5253352","content":"#WATCH | United Kingdom: Overseas Friends of BJP UK organized a spirited Car Rally in London, dedicated to showcasing their support for Prime Minister Narendra Modi and the BJP in the upcoming elections in India.\"The Conservative MP for Harrow East also praised British Prime Minister Rishi Sunak while urging people, including the Indian community, to support him for his re-election in the polls.\"Over 250 cars participated in the rally, showcasing widespread support for the BJP and PM Modi'Overseas Friends' of BJP UK organised a car rally in London to showcase 'unwavering support' for Prime Minister Narendra Modi and the ruling party at the Centre ahead of the Lok Sabha elections.Also taking part in the rally, UK Parliamentarian and Padmashri recipient, Bob Blackman, addressed members of the Indian community after the car rally culminated at the BAPS Swaminarayan Temple in London.Phase 4 of the elections will be held on May 13, with the last date for candidates to file nominations scheduled for April 25."}," Volcano Erupts Again On Iceland Peninsula, Fourth Time Since December ":{"img":"https://c.ndtvimg.com/2024-03/hkl65fv8_volcanco-iceland_625x300_17_March_24.jpeg","link":"https://www.ndtv.com/world-news/volcano-erupts-again-on-iceland-peninsula-fourth-time-since-december-5253334","content":"Iceland is home to 33 active volcano systems, the highest number in Europe (File)Lava spewed Saturday from a new volcanic fissure on Iceland's Reykjanes peninsula, the fourth eruption to hit the area since December, authorities said.But a fissure opened right on the town's edge, in January, sending lava flowing into the streets and reducing three homes to ashes, followed by a third eruption near the village on February 8.A \"volcanic eruption has started between stora Skogfell and Hagafell on the Reykjanes Peninsula,\" said a statement from the Icelandic Met Office (IMO).Iceland is home to 33 active volcano systems, the highest number in Europe.The quakes were followed by a volcanic fissure on December 18 that spared the village."}," Niger Breaks Off Military Cooperation With US With \"Immediate Effect\" ":{"img":"https://c.ndtvimg.com/2023-08/aukcjrug_niger-coup_625x300_31_August_23.jpg","link":"https://www.ndtv.com/world-news/niger-breaks-off-military-cooperation-with-us-with-immediate-effect-5253308","content":"Niger's military had in the past worked closely with the United States (Representational)Niger's government announced on Saturday that it was breaking off \"with immediate effect\" its military cooperation agreement with the United States.The declaration came just a day after a senior US delegation left Niger, following a three-day visit to renew contact with the military junta that ousted the president and moved closer to Russia.The statement said the government had decided to \"denounce with immediate effect\" the agreement relating to US military and civilian employees of the US Department of Defense inside Niger.Niger's military had in the past worked closely with the United States.But the junta has sought cooperation with Russia, while stopping short of the full-fledged embrace of Moscow by military-run neighbours Mali and Burkina Faso."}," Russia Election 2024: Why Putin Voters Are Convinced Re-Election Will Bring Peace ":{"img":"https://c.ndtvimg.com/2024-03/1lam6j78_putin-reuters_625x300_13_March_24.jpeg","link":"https://www.ndtv.com/world-news/russia-election-2024-why-putin-voters-are-convinced-re-election-will-bring-peace-5253254","content":"In the monastery city of Sergiyev Posad, northeast of Moscow, Russians taking part in this weekend's presidential elections told AFP they wanted to bring the military offensive launched by the Russian leader to an end -- by voting for him.Facing no real competition, Putin is guaranteed to extend his grip on power (File)To the sound of Russian pop music blasting from speakers at the polling station, Eduard Ishnazarov cast a ballot for the only candidate he thought could deliver peace: Vladimir Putin.Facing no real competition, Putin is guaranteed to extend his grip on power in an election he has presented as a show of support for his military campaign on Ukraine.The Kremlin has repeatedly claimed to have launched what it calls a \"special military operation\" to protect Russian speakers in eastern Ukraine.Putin is omnipresent on Russian state television, which broadcasts his meetings, speeches and events for hours on end almost every day."}," Gaza Family Reunion Turns Into Bloodbath On Ramadan Friday As Strike Kills 36 ":{"img":"https://c.ndtvimg.com/2024-03/qmnk8jq_nuseirat_625x300_17_March_24.jpeg","link":"https://www.ndtv.com/world-news/gaza-family-reunion-turns-into-bloodbath-on-ramadan-friday-as-strike-kills-36-5253148","content":"The strike in Nuseirat was one of 60 \"deadly air strikes\" reported overnightDisplaced by Israeli bombardment, the Tabatibi family gathered in central Gaza to eat together during the first Friday night of Ramadan, a reunion that soon turned into a bloodbath.The strike in Nuseirat was one of 60 \"deadly air strikes\" reported overnight by the press office of the Hamas-run government, from Gaza City in the north to Rafah in the south.Asked about the strike on Saturday, the Israeli military said it targeted two \"terror operatives\" in Nuseirat \"throughout the night\", without elaborating.An air strike hit the building where they were staying as women prepared the pre-fasting meal, killing 36 members of the family, witnesses told AFP on Saturday.The health ministry in Hamas-run Gaza, which provided the same death count, blamed Israel for the strike in Nuseirat, as did survivors."}," \"Extremely Dangerous\" US Suspect In Custody After Shooting 3 Family Members Dead ":{"img":"https://c.ndtvimg.com/2023-07/6835sp0g_us-police-generic_625x300_27_July_23.jpg","link":"https://www.ndtv.com/world-news/3-killed-in-fatal-us-shootings-suspect-remains-barricaded-in-house-cops-5253056","content":"The suspect then drove across the state line back to Trenton, where police believed he had barricaded himself in a three-story house.The suspect was believed to be armed with an AR-15 style assault rifle (Representational)An \"extremely dangerous\" suspect was taken into custody in New Jersey on Saturday after allegedly shooting dead three family members, authorities said, following an hours-long effort to detain him.There, police said, the suspect killed two people -- identified as his 52-year-old stepmother and his 13-year-old sister.Whitney had said the suspect was believed to be armed with an AR-15 style assault rifle and police described him as \"extremely dangerous.The suspect then drove to a nearby residence where he broke in before shooting and killing a 25-year-old woman -- who Schorn said was the mother of his two children -- before bludgeoning her mother with the butt of his rifle."}," Israel To Attend Fresh Truce Talks As UN Says Gaza Hunger Crisis Worsens ":{"img":"https://c.ndtvimg.com/2024-03/cg70vj08_gaza-children_625x300_13_March_24.jpeg","link":"https://www.ndtv.com/world-news/israel-to-attend-new-truce-talks-as-un-says-gaza-hunger-crisis-worsens-5252863","content":"aid agency operating in Gaza said on Saturday that acute malnutrition was accelerating in the north of the Palestinian enclave as Israel prepared to send a delegation to Qatar for new ceasefire talks on a hostage deal with Hamas.Israel says it puts no limit on humanitarian aid for civilians in Gaza and blames slow aid delivery on incapacity or inefficiency among U.Israel's ground and air campaign has killed more than 31,500 people, mostly women and children, according to the health ministry in Hamas-run Gaza.On Friday, Israel said it would send a delegation to Qatar for more talks with mediators after its enemy Hamas presented a new proposal for a ceasefire with an exchange of hostages and prisoners.\"Efforts failed repeatedly to secure a ceasefire before Islam's holy month of Ramadan started a week ago, with Israel saying it plans to launch a new offensive in Rafah, the last relatively safe city in tiny, crowded Gaza after five months of war."}}