{" Length Of A Day Might Change As Earth's Inner Core Slowing Since 2010: Study ":{"img":"https://i.ndtvimg.com/i/2017-03/earth-mantle_650x400_41488715210.jpg","link":"https://www.ndtv.com/science/length-of-a-day-might-change-as-earths-inner-core-slowing-since-2010-study-5888229","content":"Researchers said that the slowing down of Earth's inner core could change the length of one dayA new study has provided \"unambiguous evidence\" that the Earth's inner core began to slow down its rotation since 2010, compared to the planet's surface.The inner core had slowed down for the first time in many decades,\" said Vidale, also the corresponding author of the study published in the journal Nature.The slowing down of the inner core is hotly debated in the scientific community, with some studies even suggesting that it rotates faster than the Earth's surface.The author, Duncan Agnew, a geophysicist at the University of California San Diego, showed that the Earth's liquid core was slowing down in its rotation.A study published earlier this year, in the journal Nature, had found that climate change-driven melting of ice in Greenland and Antarctica was affecting global timekeeping by slowing down Earth's rotation."}," US First Lady Defends Joe Biden After Donald Trump's Jibe Over His Age ":{"img":"https://c.ndtvimg.com/2021-12/bi0si9c8_joe-biden-jill-biden-afp-650_625x300_26_December_21.jpg","link":"https://www.ndtv.com/world-news/healthy-wise-81-year-old-first-lady-jill-biden-defends-presidents-age-5894359","content":"Donald Trump has made Joe Biden's advancing age one of his main campaign rallying points, trying to position himself as an energetic alternative to the sometimes unsteady 81-year-old Democratic incumbent.The First Lady said she sees Joe Biden's “vigour, energy, passion every single day.The First Lady said she sees Joe Biden's \"vigour, energy, passion every single day.\"US First Lady Jill Biden claimed President Joe Biden's age was an asset during a visit to Green Bay, Wisconsin, on Thursday.In her speech on the ‘Seniors for Biden' campaign tour, Jill Biden said that the election “isn't about age,” noting that President Biden is 81 and Donald Trump is 78, making them \"essentially the same age\", CNN reported."}," PM Modi, Italy Counterpart Giorgia Meloni's Selfie At G7 Summit Goes Viral ":{"img":"https://c.ndtvimg.com/2024-06/mis1u85_pm-modi-giorgia-meloni_625x300_15_June_24.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/pm-narendra-modi-italy-counterpart-giorgia-melonis-selfie-at-g7-summit-goes-viral-5894431","content":"PM Modi's selfie with Italy's Giorgia Meloni was taken on Friday during the G7 summit in ApuliaA selfie of Prime Minister Narendra Modi and his Italian counterpart Giorgia Meloni on the sidelines of the G7 summit has gone viral on social media.Prime Minister Narendra Modi on Friday held talks with Italian Prime Minister Giorgia Meloni on the sidelines of the G7 Summit and discussed the bilateral relations.The picture, taken on Friday by Ms Meloni on the sidelines of the summit that is being held in Italy's Apulia, showed the two leaders smiling.According to the Prime Minister's Office, Ms Meloni congratulated PM Modi for his third consecutive term as Prime Minister.Watch: Italy PM Giorgia Meloni's Namaste Greeting At G7 Goes ViralPM Modi thanked Ms Meloni for the invitation to participate in the G7 Outreach summit and conveyed his appreciation for the successful conclusion of the event."}," G7 Nations Commit To Promoting India-Middle East-Europe Economic Corridor ":{"img":"https://c.ndtvimg.com/2024-06/hdqmp6k_pm-modi-with-world-leaders-at-g7-summit-italy_625x300_15_June_24.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/india-news/g7-nations-commit-to-promoting-india-middle-east-europe-economic-corridor-5894063","content":"The Group of Seven nations have committed to promoting concrete infrastructure initiatives such as the India-Middle East-Europe Economic Corridor (IMEC) in the G7 Summit Communique issued at the end of the three-day G7 Summit, attended by Prime Minister Narendra Modi.\"We will further promote concrete G7 PGII (Partnership for Global Infrastructure and Investment) initiatives, flagship projects, and complementary initiatives to develop transformative economic corridors for quality infrastructure and investment, such as the deepening of our coordination and financing for the Lobito Corridor, the Luzon Corridor, the Middle Corridor, and the India-Middle East-Europe Economic Corridor, also building on the EU Global Gateway, the Great Green Wall Initiative, and the Mattei Plan for Africa launched by Italy,\" reads the communique.The India-Middle East-Europe Economic Corridor or IMEC is also seen as an initiative by like-minded nations to gain strategic influence in the face of China's Belt and Road Initiative (BRI) which has faced increasing criticism over lack of transparency and disregard for sovereignty of the nations.Billed as a path-breaking initiative, the IMEC envisages a vast road, railroad and shipping network among Saudi Arabia, India, the United States and Europe to ensure integration among Asia, the Middle East and the West.PM Modi attended the G7 Summit at the invitation of Italian Prime Minister Giorgia Meloni, the host."}," Rishi Sunak Reacts As Kate Middleton Announces 1st Public Appearance ":{"img":"https://c.ndtvimg.com/2024-06/i9odpsrg_kate-middleton-rishi-sunak_625x300_15_June_24.jpg?im=FitAndFill,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/rishi-sunaks-shoutout-to-kate-middleton-after-public-appearance-update-on-cancer-news-ahead-of-king-charles-birthday-5894049","content":"Kate Middleton said she will make her first public appearance on SaturdayUK Prime Minister Rishi Sunak on Friday heaped praise on Kate Middleton, Britain's Princess of Wales, as she shared a health update on her ongoing cancer treatment.In what would mark her first public appearance in six months, Kate Middleton announced that she will attend King Charles's annual birthday parade on Saturday with other senior royals.Kate Middleton's appearance at the annual Trooping the Colour parade for King Charles's official birthday will be her first public appearance since she was seen gathering with other royals for Christmas in December last year.In a message, Kate said she was \"making good progress, but as anyone going through chemotherapy will know, there are good days and bad days\".\"I am making good progress, but as anyone going through chemotherapy will know, there are good days and bad days."}," Explained: What Is Tsav 9, Hardline Israeli Group Sanctioned By US ":{"img":"https://c.ndtvimg.com/2024-06/0qk2te6_israel-reuters-_625x300_15_June_24.jpeg","link":"https://www.ndtv.com/world-news/israel-hamas-gaza-explained-what-is-tsav-9-hardline-israeli-group-sanctioned-by-us-5893994","content":"The US State Department has levied sanctions against the group described as a \"violent, extremist Israeli group,\" for obstructing convoys delivering humanitarian aid to Gaza and for assaulting trucks.The US imposed sanctions on the far-right Israeli group Tsav 9 today in response to the group's aggressive actions against humanitarian aid convoys destined for Gaza.Its National Security Minister Itamar Ben Gvir has been accused of adopting a lenient approach towards settler violence, while some Israeli security forces are believed to be complicit in tipping off Tsav 9 activists about the locations of aid convoys.These individuals oppose the delivery of humanitarian aid to Gaza, believing that much of the aid is diverted to Hamas.Several polls indicate that a majority of Israelis favour limiting or halting humanitarian aid to Gaza."}," Musk's Neuralink Forced Employee To Work With Monkeys With Herpes, She Sued Them ":{"img":"https://c.ndtvimg.com/2024-06/g4qe82o8_neuralink-_625x300_15_June_24.jpeg","link":"https://www.ndtv.com/world-news/elon-musks-neuralink-forced-employee-to-work-with-monkeys-with-herpes-she-sues-them-5893833","content":"Short was fired the following day with the company saying the dismissal was for performance issues, according to the lawsuit.The employee, Lindsay Short, said that once she transferred to the company's Fremont, California, site in August 2022, she encountered \"a work environment fraught with blame, shame, and impossible deadlines.In the lawsuit, Short also said Neuralink didn't honor a promise for flexible work hours to accommodate her family, then demoted her in May 2023, two months after a promotion.forced an employee to work with monkeys that carried the Herpes B virus in conditions in which the animals scratched her bare skin, according to a complaint filed Friday in state court in California.Short sued the company for retaliation, wrongful termination and discrimination based on her gender among other issues."}," \"Significant Overpayment\": Elon Musk's X Wants Sacked Staff To Return Money ":{"img":"https://c.ndtvimg.com/2024-06/8trrs42_elon-musk_625x300_15_June_24.jpeg","link":"https://www.ndtv.com/world-news/elon-musks-x-wants-money-back-from-sacked-staff-says-they-were-overpaid-report-5893728","content":"The social media platform, formerly known as Twitter, acknowledged its error in currency conversion from the US to Australian dollars on the payments and asked its former employees to repay amounts of up to $70,000 in some cases, the report said on Wednesday.Earlier last year, thousands of former Twitter employees said they were cheated of severance pay when the billionaire laid them off after acquiring the social media platform.\"It has come to our attention that you received a significant overpayment in error in January 2023,\" the Sydney Morning Herald quoted X's Asia Pacific human resources department as saying, citing an email to several former employees this year.\"According to the report, at least six former X staff have received legal notices.Elon Musk-led company also said that the overpayment was related to \"deferred cash compensation\" in the form of employee shares issued to the staff when they joined Twitter."}," \"Always Pleasure...\": PM Modi After Meeting President Biden At G7 ":{"img":"https://c.ndtvimg.com/2024-06/u7ldo4vk_pm-modi-meets-joe-biden_625x300_15_June_24.jpeg","link":"https://www.ndtv.com/world-news/pm-modi-after-meeting-us-president-joe-biden-on-sidelines-of-g7-summit-5893567","content":"Prime Minister Narendra Modi met US President Joe Biden in Italy on the sidelines of the G7 Summit here on Friday night and said India and the US will keep \"working together to further global good.During their meeting, PM Modi and President Macron delved into the core issues shaping the strategic partnership between India and France.India and USA will keep working together to further global good,\" PM Modi said on X.\"At the G7, Prime Minister Narendra Modi and I discussed the main issues of the strategic partnership that unites India and France, in the fields of energy, defence, research, and culture, and I must say: what momentum!\"India and USA will keep working together to further global good."}," 1 Dead, Several Injured In Mexican President-Elect's Motor Convoy Accident ":{"img":"https://c.ndtvimg.com/2024-06/kmlan43s_-claudia-sheinbaum-raod-accident_625x300_15_June_24.jpeg","link":"https://www.ndtv.com/world-news/mexican-president-elect-claudia-sheinbaums-motorcade-suffers-accident-5893318","content":"Mexican president-elect Claudia Sheinbaum's motorcade suffered an accident on Friday, her team said in a statement, leaving one person dead and several injured, though the car Sheinbaum was traveling in was not involved.Mexican president-elect Claudia Sheinbaum's motorcade suffered an accident on Friday.\"We deeply regret that one person died in the other vehicle,\" the statement said.Sheinbaum stopped to check on the injured people, who were by then being attended to by emergency teams after the crash in Monclova, a city in northern Coahuila state, according to her team."}," Cyril Ramaphosa Re-Elected South African President After Coalition Deal ":{"img":"https://c.ndtvimg.com/2023-06/2isgta2_cyril-ramaphosa-_625x300_19_June_23.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/cyril-ramaphosa-re-elected-south-african-president-after-coalition-deal-5893261","content":"Last month's election marked a historic turning point for South Africa, ending three decades of dominance by the African National Congress of the late Nelson Mandela.South Africa's President Cyril Ramaphosa was re-elected for a second term on Friday, after his humbled ANC cobbled together an unprecedented coalition government.ANC Secretary General Fikile Mbalula said on Friday the broad coalition brings together a majority of the 18 parties that won representation in the 400-seat National Assembly.\"This is not a government of national unity, this is a grand coalition between the ANC and white monopoly capital.He will now have the arduous task to bridge conflicting views within government to turn around South Africa's economic fortunes."}," US Supreme Court Strikes Down Trump-Era Ban On Gun 'Bump Stocks' ":{"img":"https://c.ndtvimg.com/2024-06/og49vejc_us-gun_625x300_15_June_24.jpeg","link":"https://www.ndtv.com/world-news/us-supreme-court-strikes-down-trump-era-ban-on-gun-bump-stocks-5892932","content":"The US Supreme Court ruled on Friday that a ban introduced by ex-president Donald Trump's administration on bump stocks -- devices which allow semi-automatic rifles to fire like a machine gun -- is unconstitutional.The court voted along ideological lines, 6-3 in favor of the conservative justices, that the Trump administration did not follow the law after the shooting in extending a ban on machine guns to include bump stocks.- 'Quacks like a duck' -Brian Fletcher, deputy solicitor general in President Joe Biden's Justice Department, told the court when it heard oral arguments in February that bump stocks allow a user to \"empty a 100-round magazine like the ones used in the Las Vegas shooting in about 10 seconds.Oral arguments focused on the technical definition of a machine gun in the 1934 law, which was passed during the Prohibition era, well before the invention of the bump stock.But lawyers for Michael Cargill, a gun seller from Texas, challenged the move claiming the ATF had overstepped its bounds in classifying bump stocks with machine guns."}," No Evidence Sri Lankans Arrested In India Have ISIS Link: Foreign Minister ":{"img":"https://c.ndtvimg.com/2023-03/kbesmang_ali-sabry-twitter-_625x300_08_March_23.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/no-evidence-sri-lankans-arrested-in-india-have-isis-link-foreign-minister-5892389","content":"Foreign Minister Ali Sabry on Friday said there is no evidence to back claims that the four Sri Lankans arrested in India last month are linked to ISIS.\"There is no evidence to back claims that the four Sri Lankans arrested in India are linked to ISIS.The Gujarat Anti-Terrorism Squad had arrested the four men last month.The Gujarat Anti-Terrorism Squad had claimed that they arrested four Sri Lankans with links to ISIS at Ahmedabad airport.On May 31, the Criminal Investigation Department of Sri Lankan police had arrested one Pushparaja Osman, 46, in Colombo, who they had called the suspected handler of the four arrested in India."}," PM Modi, Italy's Giorgia Meloni Hold Talks On Sidelines Of G7 Summit ":{"img":"https://c.ndtvimg.com/2024-06/kt1nq7vg_pm-modi-meloni_625x300_14_June_24.jpeg","link":"https://www.ndtv.com/world-news/pm-modi-italys-giorgia-meloni-hold-talks-on-sidelines-of-g7-summit-5892331","content":"PM Modi arrived in Italy early Friday at the invitation of Prime Minister Meloni to participate in the G7 Outreach summit.Prime Minister Narendra Modi on Friday held bilateral talks with Italian Prime Minister Giorgia Meloni on the sidelines of the G7 Summit here.\"Prime Minister Meloni's two visits to India last year were instrumental in infusing momentum and depth in our bilateral agenda,\" PM Modi said in Delhi ahead of his departure on Thursday.\"Besides India, Italy has invited leaders from 11 developing countries in Africa, South America and the Indo-Pacific region to attend the summit.This is his first foreign trip after becoming prime minister for the third term earlier this month."}," US Attorney Recovers $50 Million For Defrauded Gemini Earn Crypto Investors ":{"img":"https://c.ndtvimg.com/2024-06/cqjim5co_gemini-trust-reuters_625x300_14_June_24.jpeg","link":"https://www.ndtv.com/world-news/us-attorney-recovers-50-million-for-defrauded-gemini-earn-crypto-investors-5892299","content":"Gemini Earn promised high interest rates to investors who lent crypto assets such as bitcoin to Genesis, a unit of Digital Currency Group, with Gemini taking fees that could exceed 4%.Gemini also agreed to cooperate in James' October fraud lawsuit against Digital Currency Group and its chief executive, Barry Silbert.(Representational)New York Attorney General Letitia James has recovered $50 million from the cryptocurrency platform Gemini Trust to repay investors defrauded in its Gemini Earn program, she said on Friday.Gemini, run by billionaire twin brothers Cameron and Tyler Winklevoss, will provide full recoveries to more than 230,000 Earn investors, including 29,000 in New York, and agreed to a ban on operating crypto lending programs in the state.The payout is in addition to James' related $2 billion settlement with crypto lender Genesis Global Capital, which she announced on May 20."}}