{" \"Miracle\": Man Rescued 5 Days After South Africa Building Collapse ":{"img":"https://c.ndtvimg.com/2024-05/0ulj6tj8_south-africa-building-collapse-reuters_625x300_11_May_24.jpeg","link":"https://www.ndtv.com/world-news/miracle-man-rescued-5-days-after-south-africa-building-collapse-5641141","content":"Rescue teams have been working against time ever since the structure came crashing down.\"When we went down to the side of the slab we had uncovered, we heard somebody inside and we stopped all the heavy operations,\" Colin Deiner, head of rescue operations, told reporters.\"He indicated to us that he's got weight on his legs, and we're very concerned about that after such a long period of time.\""}," This US Couple Shock World With Rs 1,223 Crore Art Heist ":{"img":"https://c.ndtvimg.com/2024-05/7qevi1j_willem-de-koonings-womanochre_625x300_11_May_24.jpeg","link":"https://www.ndtv.com/world-news/this-us-couple-shock-world-with-rs-1-223-crore-art-heist-5640856","content":"Investigators believe the couple may have been responsible for the theft of two other paintings from the Harwood Museum of Art in New Mexico in 1985.The FBI is now investigating their involvement in multiple art thefts and trying to track down two other paintings that were also found in their house, as per the news report.An elderly couple from New Mexico, Jerry and Rita Alter, who lived a seemingly ordinary life, are now suspected of being behind a daring art heist in the 1980s, according to The Metro.The Harwood Museum is urging anyone who may have information on the whereabouts of the two missing paintings to come forward.The other two paintings are believed to have been sold at an auction in Arizona."}," \"Time Running Out\": Hamas Armed Wing Releases Video Of Gaza Hostage ":{"img":"https://c.ndtvimg.com/2024-05/a8pgopg8_hamas-hostage-video_625x300_11_May_24.jpeg","link":"https://www.ndtv.com/world-news/time-running-out-hamas-armed-wing-releases-video-of-gaza-hostage-5640656","content":"Hamas's armed wing, the Ezzedine al-Qassam Brigades, on Saturday released a video of a man held hostage in Gaza by Palestinian operatives and seen alive in the footage.The video posted Saturday on the Telegram channel of Hamas's armed wing was the third time in less than a month that the group releases footage of captives held in Gaza.\"Every sign of life received from the hostages held by Hamas is another cry of distress to the Israeli government and its leaders,\" the families' group said in its statement on Saturday.\"In Israel's retaliatory military campaign in Gaza, at least 34,971 people have been killed so far, most of them women and children, according the Hamas-run territory's health ministry.\"Prime Minister Benjamin Netanyahu and his government are under immense pressure to strike a deal with Hamas, but the two warring sides have so far failed despite repeated rounds of indirect negotiations."}," Elon Musk's Starlink Satellites Experience \"Degraded Service\" After Major Solar Storm ":{"img":"https://c.ndtvimg.com/2024-05/ikaagl3_starlink-satellite-launch_625x300_11_May_24.jpeg","link":"https://www.ndtv.com/world-news/elon-musks-starlink-satellites-experience-degraded-service-after-major-solar-storm-5640532","content":"This storm is expected to continue over the weekend (Representational)Starlink, the satellite arm of Elon Musk's SpaceX, on Saturday, warned users of a \"degraded service\" as the biggest geomagnetic storm struck the Earth due to solar activity in a very long time.Earlier, in a post on X, the tech billionaire highlighted the severity of the storm, saying that it has put Starlink satellite fleet under intense pressure and described it as \"the biggest in a long time\".Meanwhile, Elon Musk has said that Tesla will be investing over $500 million in its Supercharger network to create thousands of new chargers in 2024.\"Tesla will spend well over $500 million expanding our Supercharger network to create thousands of new chargers this year,\" Elon Musk wrote on X.This storm is expected to continue over the weekend and poses potential risks to various systems such as navigation, power grids, and satellite navigation."}," Sci-Fi Writer JG Ballard Predicted ChatGPT Through Computer Poems 50 Years Ago ":{"img":"https://c.ndtvimg.com/2024-05/p5nmm3mc_ai-generic_625x300_11_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/sci-fi-writer-jg-ballard-predicted-chatgpt-through-computer-poems-50-years-ago-5640529","content":"” He compared this process to “looking for the hidden wiring and fuse box” behind a set of strange lights.Instead of focusing on distant futures or distant galaxies, he often wrote stories set in a \"visionary present\" – meaning his stories were set in worlds that were similar to our own but had subtle differences or exaggerated elements."}," UK Drug Dealer Tosses Rs 3 Crore Of Heroin From His Truck During Desperate Police Chase ":{"img":"https://c.ndtvimg.com/2018-11/psn53hc8_drugs-heroin-generic-pixabay-650_625x300_15_November_18.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/uk-drug-dealer-tosses-rs-3-crore-of-heroin-from-his-truck-during-desperate-police-chase-5640294","content":"Instead, he led them on a dangerous high-speed chase on the M56, weaving through traffic and even driving the wrong way around a roundabout.The chase culminated at Manchester Airport, where Corrigan reached a dead end.The chase culminated at Manchester Airport, where Corrigan reached a dead end after crashing through a parking barrier.A reckless chase involving a drug dealer throwing a fortune in heroin out his window ended with an arrest at Manchester Airport, according to The Metro.The manner of Corrigan's driving was extremely dangerous, showing no regard for the safety of innocent members of the public as part of his failed attempt to flee officers."}," British Tourist Arrested In Thailand For Giving False One-Star Reviews To Restaurant ":{"img":"https://c.ndtvimg.com/2022-11/iof8givc_arrest-generic_625x300_30_November_22.jpg","link":"https://www.ndtv.com/world-news/british-tourist-arrested-in-thailand-for-giving-false-one-star-reviews-to-restaurant-5639953","content":"21-year-old Alexander was arrested for supposedly posting fake negative reviews about a Phuket restaurant, according to The Metro.The trouble began when Alexander, according to reports, tried to use the restaurant as a shortcut to his home but was refused entry for not being a customer.Seeking payback, Alexander is accused of enlisting his friends to flood the restaurant with one-star reviews, causing its rating to plunge from a respectable 4.\"Alexander maintains his innocence but is now facing legal proceedings in Phuket after being transferred to the Sakhu Police Station there.The restaurant owner, understandably upset by the sudden influx of negativity and the potential impact on their business, filed a complaint."}," Video: Huge Protests In Pakistan-Occupied Kashmir, Cops Fire AK-47s ":{"img":null,"link":"https://www.ndtv.com/world-news/video-huge-protests-in-pakistan-occupied-kashmir-cops-fire-ak-47s-5639771","content":"A policeman fires in the air to control protesters in Pakistan-occupied KashmirThe Pakistani government is carrying out a massive crackdown on residents in Pakistan-occupied Kashmir, or PoK.The Pakistan Rangers and the local police responded with firing tear gas, pellets, and bullets in the air.The march began as a peaceful protest, but when the forces responded with firing in the air and other potentially lethal means, the civilians turned on the police and a clash broke out.Visuals of the clashes show policemen firing AK-47s in the air and even towards the crowds.Sources said electricity generated in PoK areas have been diverted to other bigger cities of Pakistan, angering the locals."}," Dead Bodies In This Colombian Town Keep Mummifying, And Nobody Knows Why ":{"img":"https://c.ndtvimg.com/2024-04/uc4r157o_colombian-mummies_625x300_26_April_24.jpeg","link":"https://www.ndtv.com/world-news/dead-bodies-in-this-colombian-town-keep-mummifying-and-nobody-knows-why-5639445","content":"There's a common occurrence at the town's municipal cemetery - deceased residents keep mummifying without preservatives, and their clothes, hair and even eyes often remain intact.Some of the corpses appear so decomposition-proof that even their most perishable features, like eyes, clothes and hair, remain intact.\"People were a little incredulous about what was happening,\" Rocio Vergara, a guide at the town cemetery's Museum of Mummies, said, as per Science Alert.Also Read | US Teens, Expelled From School For \"Blackface\", Get $1 Million After Revealing TruthAccording to Science Alert, the reason for these spontaneous mummifications remains unclear, however, numerous theories have been floated.By the late 1980s, the officials at San Bernardo municipal cemetery began removing bodies interred in vaults from decades past to make room for new burials."}," Man Behind Viral White-Gold Dress Post Admits He Tried To Strangle Wife ":{"img":"https://c.ndtvimg.com/2024-05/viac6apg_white-gold-dress_625x300_11_May_24.jpeg","link":"https://www.ndtv.com/world-news/man-behind-viral-white-gold-dress-post-admits-he-tried-to-strangle-wife-5639316","content":"Keir Johnston, 38, from the Isle of Colonsay in Scotland, and his wife, Grace, went viral in 2015 when the dress his mother-in-law wore at their wedding was a subject of much discussion on the internet for its colour.Remember the man who started the viral dress debate -- blue and black or white and gold -- nine years ago?Court documents reveal that on March 6, 2022, Mr Johnston pinned his wife to the ground, sat on top of her, “placed both knees on her arms, so she was unable to move” and “then began strangling her with both his hands”, making it impossible for her to breathe.The prosecutor claimed that Ms Grace “feared for her life and believed Johnston intended to kill her,” adding “he was very forceful.Now, years later, Mr Johnston has been sentenced to jail after he admitted to strangling his wife."}," Israel Orders Residents In More Areas Of Rafah To Evacuate Despite US Pressure ":{"img":"https://c.ndtvimg.com/2024-05/unlgu5fg_israelhamas-war_625x300_11_May_24.jpeg","link":"https://www.ndtv.com/world-news/israel-hamas-war-israel-orders-residents-in-more-areas-of-gazas-rafah-to-evacuate-despite-us-pressure-5639267","content":"About 300,000 Gazans have so far moved to humanitarian areaIsrael called on Saturday for Palestinians in more areas of Gaza's southern city of Rafah to evacuate and head to what it calls an expanded humanitarian area in Al-Mawasi, in a further indication that the military is pressing ahead with its plans for a ground attack on Rafah.The war was triggered by a Hamas-led attack on southern Israel in which some 1,200 people were killed and more than 250 people taken hostage, according to Israeli tallies.Israeli tanks captured the main road dividing Rafah's eastern and western sections on Friday, effectively encircling the eastern side in an assault that has caused Washington to hold up delivery of some military aid to its ally.Israel's military operation in Gaza, which it says aims to eliminate Hamas, has killed close to 35,000 Palestinians, according to Gaza's health ministry.In a post on social media site X, a military spokesperson also called on residents and displaced people in the Jabalia area of northern Gaza, and 11 other neighbourhoods in the enclave to go immediately to the shelters west of Gaza City."}," In Latest Gaffe, Biden Calls Kim Jong Un President Of South Korea ":{"img":"https://c.ndtvimg.com/2024-04/marrd138_joe-biden_625x300_24_April_24.jpeg","link":"https://www.ndtv.com/world-news/in-latest-gaffe-biden-calls-kim-jong-un-president-of-south-korea-5639034","content":"Biden was addressing a private fundraiser when he attacked his rival, former President Donald Trump, for his \"love letters\" to the North Korean leader and their meetings during the Republican's term at the White House.The US president made multiple jokes about remarks by his presidential rival Trump.The US president made multiple jokes about remarks by his presidential rival.In another fumble by US President Joe Biden, the 81-year-old confused the leaders of North and South Korea and called Kim Jong Un the president of South Korea.In his attack, he referred to Trump's pride in \"love letters from South Korean president Kim Jong Un."}," \"Do You Want Your Kids To Be Like Trump?\" Indian-American Backing Biden ":{"img":"https://c.ndtvimg.com/2024-05/e0ivsimo_vinod-khosla_625x300_11_May_24.jpeg","link":"https://www.ndtv.com/world-news/do-you-want-your-kids-to-be-like-trump-indian-american-vinod-khosla-backing-biden-5639017","content":"Indian-American billionaire Vinod Khosla made a strong pitch in favour of President Joe Biden on Saturday and sought to know if Donald Trump's supporters would want their children to be like the Republican presidential contender.The question I keep asking myself is would his supporters want their own kids to be like @realDonaldTrump and have #Trumpvalues?co/KXQS6yIMQd\"The question I keep asking myself is would his supporters want their own kids to be like @realDonaldTrump and have #Trumpvalues?Mr Khosla, the co-founder of Sun Microsystems, made the remarks in an online post hours after he hosted Biden at his Silicon Valley home for a fundraiser.This was the first fundraiser by an Indian-American in the 2024 election cycle attended by Biden."}," 6-Year-Old's Body Left Behind, Pak Flight Takes Off With Grieving Parents ":{"img":"https://c.ndtvimg.com/2023-05/59fovsso_pia-aircraft_625x300_08_May_23.jpg","link":"https://www.ndtv.com/world-news/6-year-olds-body-left-behind-pak-flight-takes-off-with-grieving-parents-5638901","content":"In a deeply distressing turn of events, the staffers of a Pakistan International Airlines (PIA) flight bound for Skardu from Islamabad forgot to put the body of a six-year-old boy on the fight while his grieving parents embarked on their journey, unaware that their beloved son's body was left behind, Dawn reported.Tragically, Mujtaba succumbed to his ailment on Thursday, leaving his grieving parents to navigate the painful process of arranging for his final journey homeWith the intent to transport their beloved son's body to their native village of Katshi for burial, Mujtaba's parents decided to take a PIA flight departing from Islamabad on Friday.The parents, overwhelmed by shock and disbelief, fainted upon learning that their son's remains had been inadvertently left behind at Islamabad's airport, a realisation that struck with devastating force upon their arrival at Skardu airport.In a cruel twist of fate, they were informed that their son's body had been left behind in Islamabad--a revelation that plunged them into a state of utter disbelief and despair.Allegations surfaced regarding the flight's delayed departure, purportedly to accommodate the travel plans of a federal minister, at the expense of Mujtaba's remains languishing at Islamabad airport, Dawn reported."}," Over 200 Dead In Afghanistan Flash Floods In A Single Day ":{"img":"https://c.ndtvimg.com/2024-05/poi790no_afghanistan-flash-floods_625x300_11_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/over-200-dead-many-houses-damaged-in-afghanistan-flash-floods-in-baghlan-province-report-5638695","content":"Multiple provinces across Afghanistan saw flash floodingFlash floods that have ripped through northern Afghanistan left more than 200 people dead in a single province, the United Nations said on Saturday.Multiple provinces across Afghanistan saw flash flooding, with officials in northern Takhar province reporting 20 dead on Saturday.More than 200 people were killed and thousands of houses were destroyed or damaged in Baghlan province when heavy rains on Friday sparked massive flooding, the UN's International Organization for Migration told AFP.In Baghlani Jadid district alone, up to 1,500 homes were damaged or destroyed and \"more than 100 people died\", an IOM emergency response lead said, citing figures from the Afghanistan National Disaster Management Authority.Spokesperson Zabihullah Mujahid said \"hundreds of our fellow citizens have succumbed to these calamitous floods\" in a statement on X, formerly Twitter, on Saturday, without differentiating the numbers of dead and injured, though he told AFP dozens had been killed."}}