{" North Korea's Kim Jong Un Demolishes Multiple Buildings At His Own Palace: Report ":{"img":"https://c.ndtvimg.com/2024-01/m375bsec_kim-jong-un_625x300_01_January_24.jpeg","link":"https://www.ndtv.com/world-news/north-koreas-kim-jong-un-demolishes-multiple-buildings-at-his-own-palace-report-5615012","content":"Notably, according to Newsweek, the Ryokpo Palace, located on the outskirts of the North Korean capital of Pyongyang, is Kim Jong Un's winter palace complex and serves as a stark reminder of his opulent lifestyle.North Korean leader Kim Jong Un has reportedly demolished several buildings at one of his luxurious residences, according to experts and satellite images.The aerial images of the Ryokpo Palace complex show a dirt lot where a blue-roofed mansion once stood, as first reported by anonymous North Korean analyst \"Nobody German\" on X.Sharing the satellite images on X, @NobodyGerman wrote, \"The latest satellite images show that Kim Jong Un's Ryokpo Palace residence is being removed or remodelled.The latest satellite images show that Kim Jong Un's Ryokpo Palace Residence is being removed or remodelled."}," Trump's Private Life Exposed in Intimate Stormy Daniels Testimony ":{"img":"https://c.ndtvimg.com/2024-05/327gijbg_donald-trump-bloomberg_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/stormy-daniels-testimony-on-donald-trump-encounter-made-fun-of-his-silk-pajamas-5614570","content":"Stormy Daniels is at the center of a case in which Trump is accused of falsifying business recordsDonald Trump's intimate moments with an adult film star spilled out into open court on Tuesday as Stormy Daniels described her alleged affair with the former president in a highly-anticipated moment of his hush-money trial.Trump lawyer Susan Necheles accused Daniels at one point of making up her testimony as she went along, pointing to evidence that she'd told a Los Angeles lawyer she didn't have sex with Trump, and that she told some entertainment news outlets that the story about the affair was false.The testimony everybody was waiting for arrived Tuesday morning in Manhattan as Daniels took the stand to tell her story of a 2006 sexual encounter with Trump in a Lake Tahoe hotel suite.Mistrial RequestMany of the details Daniels gave the jury Tuesday have been public for years, but her answers under questioning by prosecutors included new claims that angered the defense, including a suggestion that Daniels felt pressured to have sex with Trump due to a \"power imbalance.Her testimony is crucial because the Manhattan district attorney, who brought the case last year, must convince jurors that Trump tried to conceal Daniels's story before the election."}," This Indian City Is On \"Most Millionaires\" List. New York Is Number One ":{"img":"https://c.ndtvimg.com/2024-04/efpadrqo_new-york-generic_625x300_05_April_24.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/1-out-of-every-24-new-york-city-residents-is-a-millionaire-5614559","content":"New York still has a large share of the ultra-rich, too: the report found that it has 60 billionaires and 744 people with investable wealth of more than $100 million.New York has a large share of the ultra-rich, too: the report found that it has 60 billionairesFor all the talk of a big-money exodus from New York, the city's residents still have more wealth - in excess of $3 trillion - than those of any other metro in the world.Bengaluru, India; Ho Chi Minh City, Vietnam; and Scottsdale, Arizona in the US, have also seen their millionaire population more than double in the past 10 years.London lost 10% of its millionaire population in the past decade, which included the UK's decision to exit the European Union.New York has almost 350,000 millionaires, which is the most of any city and up 48% from a decade ago, according to a global ranking of the wealthiest cities by Henley & Partners, an immigration consultancy."}," Pfizer Pauses Gene Therapy Trial For Muscle Disease After Death ":{"img":"https://c.ndtvimg.com/2024-05/4vrdp1s_pfizer-generic-bloomberg_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/pfizer-pauses-gene-therapy-trial-for-muscle-disease-after-death-5614495","content":"Pfizer has paused administering the same gene therapy in a separate, final-stage study while it investigates the boy's death, the company said.Pfizer has paused administering the same gene therapy in a separate, final-stage study.That study is looking at the gene therapy, called fordadistrogene movaparvovec, to treat Duchenne muscular dystrophy, a rare and fatal muscle-wasting disease that primarily affects boys.paused a study of an experimental gene therapy for muscular dystrophy after a child who received it died suddenly.\"The final-stage trial enrolled boys between the ages of 4 and 8, testing whether the therapy could slow disease progression compared to a placebo."}," Video: Cops Use Bulldozers To Remove Pro-Palestine Protesters At Amsterdam University ":{"img":"https://c.ndtvimg.com/2024-05/ssar626o_amsterdam-university-protests_625x300_08_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/israel-hamas-war-video-cops-use-bulldozers-to-remove-pro-palestine-protesters-at-amsterdam-university-in-roeterseiland-5614397","content":"Pro-Israeli protestors at a pro-Palestinian protesters gathering at the University of AmsterdamPhoto Credit: AFPThe protesters have urged the administration at the University of Amsterdam to break ties with Israel because of its military offensive in Gaza.Pro-Palestinian protesters demonstrate on the campus of George Washington UniversityPhoto Credit: AFPAbout 2,000 people have since been detained across the US with police forcibly dismantling various student sit-ins.The police also used batons against protesters at the University of AmsterdamNetherlands authorities on Tuesday arrested more than 120 people and used bulldozers to remove pro-Palestine encampments at the University of Amsterdam.The demonstration, similar to protests that started on US campuses against Israel's war in Gaza, created a \"very unsafe situation\", police said.com/lLkG8Veu7eDutch police use BULLDOZERS to destroy anti-Israel encampment at the University of Amsterdam."}," US Pauses Bomb Shipment To Israel Over Rafah Attack Concerns ":{"img":"https://c.ndtvimg.com/2024-05/dl1tdeb_israel-palestine-war_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/us-pauses-bomb-shipment-to-israel-over-rafah-attack-concerns-5614394","content":"The United States halted a shipment of bombs to Israel last week after it failed to address Washington's concerns over plans to invade the southern Gaza city of Rafah, a senior US official said Tuesday.Israeli and US officials had been discussing alternatives but \"those discussions are ongoing and have not fully addressed our concerns,\" the senior US official said.It consists of 1,800 2,000-lb (907 kg) bombs and 1,700 500-lb (226 kg) bombs,\" the senior official in President Joe Biden's administration said on condition of anonymity.\"The US official said Washington was \"especially focused\" on the use of the heaviest 2,000-lb bombs \"and the impact they could have in dense urban settings as we have seen in other parts of Gaza.\"The US State Department is still reviewing other weapons transfers, including the use of precision bomb kits known as JDAMs, added the official."}," \"They Wanted A Woman\": French Women On Rapes By US Soldiers During WW II ":{"img":"https://c.ndtvimg.com/2024-05/8sor2g4g_jeannine-plassard_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/french-women-speak-out-on-rapes-by-us-soldiers-during-world-war-ii-5614313","content":"\"If a French woman accused a white American soldier of rape, he could easily get away with it because he never stayed near the rape scene.After her book \"What Soldiers Do: Sex and the American GI in World War II France\" appeared in 2013, Roberts said the reaction in the US was so hostile that the police would have to regularly check on her.\"The black American wanted to rape my older sister.Aimee Dupre had always kept silent about the rape of her mother by two American soldiers after the Normandy landings in June 1944.In truth, hundreds or even thousands of rapes between 1944 and the departure of the GIs in 1946 went unreported, said American historian Mary Louise Roberts, one of only a handful to research what she called \"a taboo\" of World War II."}," 100-Year-Old US Veteran To Marry Girlfriend, 96, At World War II Site ":{"img":"https://c.ndtvimg.com/2024-05/5duglm88_harold-terens-jeanne-swerlin_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/100-year-old-us-veteran-to-marry-girlfriend-96-at-world-war-ii-site-5614270","content":"US Air Force veteran Terens will be honored on June 6 at a commemoration of the 80th anniversary of the D-Day landings in Normandy, the historic Allied operation that changed the course of the war.Terens, wearing a World War II cap with \"100 Year Old Vet\" embroidered on the side, is over the moon about returning to France, where President Emmanuel Macron bestowed on him the nation's highest distinction, the Legion of Honor, in 2019.Americans Harold Terens and Jeanne Swerlin promise their courtship is \"better than Romeo and Juliet\": He is 100, she's 96, and they marry next month in France, where the groom-to-be served during World War II.Soon after, Terens volunteered to travel to that region of northern France to help transport German prisoners of war and liberated Allied troops to England.After the war he returned stateside and married Thelma, his wife of 70 years with whom he raised three children."}," Boeing Starliner's Crewed Mission To Take Off On May 17 ":{"img":"https://c.ndtvimg.com/2024-05/v3iflc3_boeing-starliner_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/boeing-starliners-crewed-mission-to-take-off-on-may-17-5614235","content":"The first crewed launch of Boeing's Starliner spaceship to the International Space Station has been pushed to May 17 after engineers said a faulty rocket valve needs to be replaced for the high-stakes mission, NASA said Tuesday.Wilmore and Williams will remain under quarantine in crew quarters at the NASA Kennedy Space Center, the post added.EDT Friday, May 17,\" the US space agency said in a blog post.United Launch Alliance, the Boeing-Lockheed Martin joint venture responsible for the rocket, initially said launch would be delayed to at least May 10.Ground teams had heard buzzing from a valve that regulates liquid oxygen pressure on the Atlas V rocket meant to propel Starliner into orbit."}," TV Host Slams Viewer Who Tried To Shame Her Clothing Choice ":{"img":"https://c.ndtvimg.com/2024-05/91527qtg_narelda-jacobs-_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/tv-host-slams-viewer-who-tried-to-shame-her-clothing-choice-5614201","content":"Yes, it went to the entire newsroom.Good thing the sound of their sad smallness is like a mozzie on helium and the sound of your radiance is the entire brass section of a whole goddamn orchestra.Yes, it is intended to shame and humiliate me.She wrote on Instagram, \"Yes, we still receive emails like this.Yes, I was on air at the time."}," April 2024 Hottest On Record As Global Heat Rises, Say Scientists ":{"img":"https://c.ndtvimg.com/2024-04/lu5ovbk8_heat-generic_625x300_01_April_24.jpeg","link":"https://www.ndtv.com/world-news/april-2024-hottest-on-record-as-global-heat-rises-say-scientists-5614126","content":"April marked another \"remarkable\" month of record-breaking global air and sea surface temperature averages, according to a new report by the EU's climate monitor published on Wednesday.Since June last year, every month has been the warmest such period on record, according to Copernicus.The natural El Nino pattern, which warms the Pacific Ocean and leads to a rise in global temperatures, peaked earlier this year and was headed towards \"neutral condition\" in April, Copernicus said.Last month was the second warmest April ever recorded in Europe, as was March and the entire winter period.Much of Europe saw a wetter April than usual, although southern Spain, Italy and the western Balkans were drier than average, Copernicus reported."}," \"He Said I Reminded Him Of His Daughter\": Stormy Daniels At Trump Trial ":{"img":"https://c.ndtvimg.com/2024-05/4btpobcg_trump-in-court_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/he-said-i-reminded-him-of-his-daughter-stormy-daniels-at-trump-trial-5614088","content":"Donald Trump, the former US president who has always prided himself on being in charge and in control, was forced to sit and listen to a porn star describe in open court a bedroom encounter that he denies ever took place.\"In the trial transcript, Merchan detailed that moment as one of the times Trump could be seen shaking his head.In testimony that was at times calm, and at times uncertain, she said they saw each other the next day, and met again at a function at Trump Tower in New York and in Los Angeles, but they did not have sex again.Trump had come into the bedroom,\" Stormy Daniels told the New York court.Trump stared ahead through Daniels' testimony, which often veered into graphic sexual detail despite the judge's best efforts."}," In Rapidly Ageing China, Millions Can't Afford To Retire ":{"img":"https://c.ndtvimg.com/2024-05/h2na361g_china-old-age_625x300_08_May_24.jpeg","link":"https://www.ndtv.com/world-news/in-rapidly-ageing-china-millions-cant-afford-to-retire-5614055","content":"The alternative for them and many of the 100 million rural migrants reaching retirement age in China over the next 10 years is to return to their village and live off a small farm and monthly pensions of 123 yuan ($17).Reuters interviewed more than a dozen people, including rural migrant workers, demographers, economists and a government adviser, who described a social security system unfit for a worsening demographic crisis, which Beijing is patching rather than overhauling as it pursues growth through industrial modernisation.'VESTED INTERESTS'Pensions in China are based on an internal passport system known as hukou, which divides the population along urban-rural lines, creating vast differences in incomes and access to social services.In March, China increased the minimum pension by 20 yuan, to 123 yuan per month, benefitting 170 million people.\"There aren't enough social services to solve the problems of these people, who are prone to falling back into poverty,\" said Dan Wang, chief China economist at Hang Seng Bank."}," Trump \"Shakes Head, Curses Audibly\" As Stormy Daniels Testifies In Hush Money Trial ":{"img":"https://c.ndtvimg.com/2024-05/josn7qeo_donald-trump_625x300_06_May_24.jpeg","link":"https://www.ndtv.com/world-news/trump-shakes-head-curses-audibly-as-stormy-daniels-testifies-in-hush-money-trial-5614023","content":"\"I understand that your client is upset at this point, but he is cursing audibly, and he is shaking his head visually, and that's contemptuous,\" Judge Juan Merchan told Trump attorney Todd Blanche during a sidebar conversation, according to excerpts of the official trial transcript posted online Tuesday evening.The judge in Donald Trump's hush money trial said the former president was \"cursing audibly\" during testimony on Tuesday by porn star Stormy Daniels and directed his lawyers to temper their client's behavior.He said he noticed Trump shaking his head in particular when Daniels discussed swatting the billionaire with a magazine.\"He said he was raising this during the sidebar, when lawyers huddle with the judge in conversations that are not meant to be audible to the jury or wider courtroom, because \"I don't want to embarrass him.\"She gave at times explicit details of the alleged affair, which Trump has denied."}," AstraZeneca Withdraws Covid Vaccine Globally, Cites Commercial Reasons: Report ":{"img":null,"link":"https://www.ndtv.com/world-news/astrazeneca-withdraws-covid-vaccine-globally-cites-commercial-reasons-report-5613955","content":"Experts expect all \"monovalent\" vaccines, that deal with the original Covid strain, to be withdrawnAstraZeneca has initiated a global withdrawal of its COVID-19 vaccine, days after it was reported that the British pharmaceutical company admitted that the jab can cause rare side effects.The vaccine maker has said the worldwide withdrawal was initiated because of commercial reasons due to a \"surplus of available updated vaccines\" for COVID-19, The Telegraph reported.As multiple, variant Covid-19 vaccines have since been developed, there is a surplus of available updated vaccines.However, the vaccine maker has denied that the decision to withdraw Covishield is linked to the court case.We will now work with regulators and our partners to align on a clear path forward to conclude this chapter and significant contribution to the Covid-19 pandemic,\" AstraZeneca said in a statement."}}