{" US Passenger, Who Was Duct-Taped For Violent Behavior, Faces Record Fine ":{"img":"https://c.ndtvimg.com/2024-06/mr9ml9q_us-woman_625x300_16_June_24.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/us-woman-who-kicked-spat-at-passengers-on-american-airlines-sued-over-unpaid-81-950-fine-5901362","content":"She continued the violent behaviour before she was sedated and removed from planeA 34-year-old US woman has been sued for failing to pay $81,950 fine for assaulting co-passengers on an American Airlines flight in 2021, a report said.The woman is being charged fine up to $45,000 for assaulting and threatening crew members and posing \"an imminent threat to the safety of the aircraft, crew and passengers,\" $27,950 for attempting to open the cabin door in-flight and $9,000 for interfering with the crew member's duties, the USA Today reported.Heather Wells was gagged and bound with duct tape to her seat after she tried to open the aircraft door mid-air.\"Heather Wells was restrained to her seat with duct tape and flex cuffs but \"continued to kick and spit and attempted to bite and head-butt a flight attendant and passengers,\" it said.The 34-year-old then tried to open the cabin front door while \"screaming and yelling profanities."}," ISIS Prisoners Take Prison Guards Hostage In Russia ":{"img":"https://c.ndtvimg.com/2023-02/c9cdh8ao_us-prison-generic-us-jail-generic-getty_625x300_24_February_23.jpg","link":"https://www.ndtv.com/world-news/isis-prisoners-take-prison-guards-hostage-in-russia-5901309","content":"Two prison officers have been taken hostage by Islamic State inmates in a jail in Rostov, southern Russia, the prison services announced Sunday.\"The inmates took two prison officers hostage\" in detention centre Number One of the Rostov region, they said in a statement."}," Israel Announces \"Tactical Pause\" In South Gaza To Allow Aid Deliveries ":{"img":"https://c.ndtvimg.com/2024-03/chuivtrc_gaza-aid-truck-incident_625x300_01_March_24.jpeg","link":"https://www.ndtv.com/world-news/israel-announces-tactical-pause-in-south-gaza-to-allow-aid-deliveries-5901195","content":"Israel's military said Sunday it would \"pause\" fighting around a south Gaza route daily to facilitate aid deliveries, following months of warnings of famine in the besieged Palestinian territory.The announcement of a \"local, tactical pause of military activity\" during daylight hours in an area of Rafah came a day after eight Israeli soldiers were killed in a blast near the far-southern city and three more troops died elsewhere, in one of the heaviest losses for the army in its war against Hamas militants.Egyptian, Qatari and US mediators have been pushing for a new truce since a one-week pause in November which also saw hostages released from Gaza in exchange for Palestinian prisoner held in Israeli jails, and increased aid deliveries into the Palestinian territory.The decision, which the military said was already in effect, was part of efforts to \"increase the volumes of humanitarian aid entering the Gaza Strip\" following discussions with the UN and other organisations, it said.The United States, which has been pressing close ally Israel as well as Hamas to agree to a ceasefire plan laid out by President Joe Biden, on Friday imposed sanctions on an extremist Israeli group for blocking and attacking Gaza-bound aid convoys."}," Elon Musk Asked X Employees To Justify Their Jobs. Then Fired 6,000: Report ":{"img":"https://c.ndtvimg.com/2023-07/57iokhh_elon-musk-twitter_625x300_03_July_23.jpg","link":"https://www.ndtv.com/world-news/elon-musk-asked-x-employees-to-justify-their-jobs-then-fired-6-000-report-5900862","content":"Now, as per a report by The Telegraph, Elon Musk has fired 6,000 (80 per cent) of the staff.”Meanwhile, in his first address after taking over, Elon Musk had warned his employees that “bankruptcy was a possibility if it doesn't start generating more cash, according to people familiar with the matter.Tech billionaire Elon Musk made a lot of noise when he bought Twitter (now X) for $44 billion in 2022.\"A source told The Telegraph, “Musk had been hoping to rebuild the business with a challenger mindset and a clean slate.However, Musk went further than anyone predicted."}," Video: 20 Robbers vs 1 Guard. Indian Jeweller In US Emptied Within Minutes ":{"img":"https://c.ndtvimg.com/2024-06/le60epgg_png-store_625x300_16_June_24.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/video-indian-jeweller-pune-based-png-jewellers-store-in-us-emptied-in-minutes-in-smash-and-grab-attack-5901057","content":"CCTV cameras at PNG Jewellers' store in California's Sunnyvale show the robbers, all of them masked and some in hoodies, rushing inside the store after breaking down the glass doors.Raw video: Smash & grab robbery at Bay Area jewelry store.Once inside, the robbers are seen spreading out across the store and breaking all the desks where the jewelleries are kept.Robbers loot the US store of Pune-based PNG JewellersIn what appeared like scenes from a heist film, twenty masked men stormed into a Pune-headquartered jewellery store in the US and emptied it.Every desk appeared to have a robber pre-assigned as they went about breaking the glass and putting the loot inside backpacks."}," Shoes Melted Due To Heat, 52-Year-Old Woman Runs 1,000 Km In 12 Days ":{"img":"https://c.ndtvimg.com/2024-06/u190r8l8_natalie-dau_625x300_16_June_24.jpeg","link":"https://www.ndtv.com/world-news/shoes-melted-due-to-heat-52-year-old-woman-natalie-dau-runs-1-000-km-in-12-days-5901025","content":"Despite facing extreme heat and a serious hip injury, Ms Dau persevered, running the equivalent of two marathons each day.Running in temperatures as high as 35 degrees Celsius, her shoes melted, and she battled a hip injury from the very first day, reports The Strait Times.Ms Dau's run raised over $50,000 for the global charity GRLS, which supports women and girls through sports, aiming to develop their leadership skills.This extraordinary accomplishment earned Ms Dau the Singapore record for the \"Fastest 1,000km Thailand-Singapore Ultramarathon.A 52-year-old ultramarathoner named Natalie Dau recently achieved a remarkable feat by running 1,000 kilometres across Thailand, Malaysia, and Singapore in just 12 days."}," Ahead Of Polls, Gaza A Test Of Loyalty For UK Muslims Towards Labour Party ":{"img":"https://c.ndtvimg.com/2024-06/kp31s5sg_gaza-reuters-_625x300_14_June_24.jpeg","link":"https://www.ndtv.com/world-news/ahead-of-polls-gaza-a-test-of-loyalty-for-uk-muslims-towards-labour-party-5900643","content":"but I'm quite hopeful as the election campaign goes on that I will retain a large part of the Muslim vote where it's a particular concern,\" said Labour candidate John Grogan at his Keighley campaign office, surrounded by boxes of \"Vote Labour\" posters and flyers.While Labour is expected to win a thumping national majority on July 4, leader Keir Starmer's refusal to back an unconditional ceasefire in Gaza has caused a split with once-loyal Muslim supporters.Labour strategists said the issue lost them votes during May's English local elections, but such is the disillusionment at the ruling Conservatives, the party is still expected to win in Keighley and Ilkley.Around four in five UK Muslims voted Labour in 2019, reinforcing the historic links that were forged after the mass migration of workers from Pakistan in the 1950s and 1960s.A robust doorstep debate on the campaign trail revealed the depth of feeling, with Grogan stressing to a local resident that Labour in power would \"respect the power of the international court\" and recognise a Palestinian state."}," Foreign-Born Giant Pandas Adapt To New Life In China ":{"img":"https://c.ndtvimg.com/2024-06/si0s8sk8_panda-afp-_625x300_16_June_24.jpeg","link":"https://www.ndtv.com/world-news/foreign-born-giant-pandas-adapt-to-new-life-in-china-5900605","content":"\"Our work is very intense and very urgent and we need to replenish the wild panda populations (with those) in captivity,\" Zhang Hemin, chief expert at the China Conservation and Research Center for the Giant Panda (CCRCGP), told reporters during a recent press tour.After years of charming millions of people around the world with their furry bodies and clumsy antics, foreign-born giant pandas are adapting to new lives in China.\"After the fourth national giant panda census, we found that our wild population has formed 33 giant populations, but 22 of these populations are relatively small in number,\" he explained.\"The fluffy envoys are loaned to overseas zoos as part of Beijing's \"panda diplomacy\", with the offspring returned to China within a few years of their birth to join breeding programmes.In Ya'an, Netherlands-born panda Fan Xing, who flew to China in September, napped in her exhibit as keeper Li Xiaoyan looked on."}," Shunned By The West, Russian Army Deserters Live In Constant Fear ":{"img":"https://c.ndtvimg.com/2024-06/r6eo2f78_ziganshin-russia-afp_625x300_16_June_24.jpeg","link":"https://www.ndtv.com/world-news/shunned-by-the-west-russian-army-deserters-live-in-constant-fear-5900314","content":"The 30-year-old reservist said he was \"harassed\" in the early months of the war, with Russian military personnel coming first to his home, then to his place of work and to his mother's home in an effort to enlist him.Last year, the country's National Court of Asylum (CNDA) threw a lifeline to military deserters and draft dodgers too, ruling that \"Russians fleeing mobilisation for the war in Ukraine and those mobilised who have deserted can obtain refugee status\".But like Kazakhstan, activists say the country hosting a Russian military base is also not a safe destination.Russian contract soldier Kamil Kasimov, who also fled to Kazakhstan, this spring was detained and taken to a Russian military base in the town of Priozyorsk in central Kazakhstan, according to activists.Two Russian deserters have been detained by Russian military personnel in Armenia over the past two years."}," Dog-Eating Crocodile That Terrorised Australian Village Killed And Cooked For Feast ":{"img":"https://c.ndtvimg.com/2024-06/jti126ig_giant-crocodile_625x300_16_June_24.jpg","link":"https://www.ndtv.com/world-news/dog-eating-crocodile-that-terrorised-australian-village-killed-and-cooked-for-traditional-feast-5900262","content":"''In consultation with Traditional Owners, Elders, community members and Parks and Wildlife, the crocodile was shot to ensure that it did not continue to pose a significant risk to the community.Once the crocodile was dead, it was transported to the nearby Aboriginal community where the massive reptile was prepared for a feast in the traditional manner.An opportunistic crocodile safety session was conducted by Parks and Wildlife with the children giving them an up-close look at the dangers within our waterways,'' Northern Territory police said in a statement.Speaking to public broadcaster ABC, Northern Territory Police Sergeant Andrew McBride said the animal was ''cooked up into crocodile tail soup, he was on the barbecue, a few of the pieces were wrapped up in banana leaves and cooked underground.A giant saltwater crocodile that terrorised a village in northern Australia was killed and eaten by locals during a traditional festival."}," Elon Musk Flags Risk Of Poll Rigging In EVMs, BJP Leader Responds ":{"img":"https://c.ndtvimg.com/2024-06/lrpu3os_elon-musk-rajeev-chandrasekhar_625x300_16_June_24.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400","link":"https://www.ndtv.com/world-news/we-should-eliminate-evms-elon-musk-flags-risk-of-poll-rigging-5900100","content":"\"This is a huge sweeping generalisation statement that implies no one can build secure digital hardware.\"This is a huge sweeping generalization statement that implies no one can build secure digital hardware.Former Union Minister Rajeev Chandrasekhar countered Mr Musk's statement terming it as a \"huge sweeping generalisation\" which holds no truth.Mr Musk's remark was in response to, Robert F Kennedy Jr, nephew of former US President John F Kennedy and an independent hopeful for the 2024 US Elections, who wrote, \"Puerto Rico's primary elections just experienced hundreds of voting irregularities related to electronic voting machines, according to the Associated Press.What happens in jurisdictions where there is no paper trail?"}," Pakistani Man Forces Minor Daughter To Marry 72-Year-Old, Cops Rescue Bride ":{"img":"https://c.ndtvimg.com/2024-02/1m2equdg_pakistan-police-anti-riot-force-afp_625x300_08_February_24.jpeg","link":"https://www.ndtv.com/world-news/pakistani-man-forces-minor-daughter-to-marry-72-year-old-cops-rescue-bride-5899967","content":"Before the 'Nikkah', the police intervened and arrested the 72-year-old groomPolice foiled an attempt to marry off a 12-year-old girl to a 72-year-old man in Charsadda town and arrested the groom, ARY News reported.However, the case has been registered against the girl's father, the 72-year-old man and the 'Nikkah Khwan' under the Child Marriage Act, according to the ARY News.On May 6, the police arrested a 70-year-old man for marrying a 13-year-old girl in SwatA 13-year-old girl was married to a 70-year-old man in Swat by her father.Separately, a young girl was forcibly married to a 50-year-old landlord in Thatta but fortunately, she was saved after the timely action of the police.In one case, an 11-year-old girl in Rajanpur, Punjab, was set to marry a 40-year-old man, as per Ary News."}," US Man Opens Fire At Children's Water Park, 8-Year-Old Among Injured ":{"img":"https://c.ndtvimg.com/2024-06/p66te67o_michigan-splash-pad_625x300_16_June_24.jpeg","link":"https://www.ndtv.com/world-news/us-man-opens-fire-at-childrens-water-park-8-year-old-among-injured-5899851","content":"The Oakland County Sheriff said that the suspect reached the splash pad around 5 pm on Saturday and opened fire after he got down from his vehicle.The police said that the suspect reached the splash pad around 5 pm on Saturday.Police said the \"nine, maybe 10\" victims were injured in the shooting at Brooklands Plaza Splash Pad in Rochester Hills and rushed to hospital.\"We had an active shooter at the splash pad on Auburn in Rochester Hills.The suspect reloaded his gun several times as he fired as many as 28 times, the sheriff said."}," Russian Military Aircraft Violates Swedish Airspace ":{"img":"https://c.ndtvimg.com/2022-02/0k8mt9pk_russia-plane-afp_625x300_27_February_22.jpg","link":"https://www.ndtv.com/world-news/russian-military-aircraft-violates-swedish-airspace-5899850","content":"A Russian military aircraft briefly violated Swedish airspace east of the Baltic island of Gotland on Friday and was met by Swedish fighter jets, the Nordic country's armed forces said on Saturday.The Swedish armed forces said in a statement that the Russian military aircraft, a SU-24, had been hailed with a warning but failed to respond after which two Swedish Gripen fighters were sent up to meet it.\"The Russian actions are not acceptable and show a lack of respect for our territorial integrity,\" Swedish air force chief Jonas Wikman said.Sweden's military said the airspace violation had been brief."}," Rifle Range, Golf Course: Inside King Charles' Old School In Scotland ":{"img":"https://c.ndtvimg.com/2024-06/rrtmoevo_king-charles-school_625x300_16_June_24.jpeg","link":"https://www.ndtv.com/world-news/rifle-range-golf-course-inside-king-charles-old-school-in-scotland-5899820","content":"But there is another reason why the institution in the far north of Scotland is well-known: one of its former pupils happens to be King Charles III.His school attendance was a first at the time for a future British monarch, who until that point had been educated by a tutor.Charles has often been quoted as describing his time at the school as like \"Colditz in kilts\", likening it to the World War II prisoner of war camp.One teenager sings in front of her classmates on the same stage where Charles once played Macbeth in William Shakespeare's Scottish play, watched by his mother in the audience.Some 500 children and teenagers from about 40 countries attend the school, including Amelia Lee, 17, from Hong Kong, who has Charles's old rooms."}}