{" Legendary Nepal Mountaineer Climbs Mount Everest For Record 29th Time ":{"img":"https://c.ndtvimg.com/2024-05/9oivmlu_everest-man-_625x300_12_May_24.jpg","link":"https://www.ndtv.com/world-news/legendary-nepal-mountaineer-kami-rita-sherpa-climbs-mount-everest-for-record-29th-time-5644279","content":"Nepal's Kami Rita Sherpa also known as 'Everest Man' on Sunday morning broke his record by climbing the world's highest peak, Mount Everest for the 29th time.Congratulations to Kami Rita Sherpa @kamiritasherpa a senior guide at Seven Summit Treks for the 29th successful ascent of Mt Everest this morning at 7:25 AM, 12 May 2024.\"As per the officials from the Department of Tourism, the record-setting climber reached the summit of Everest at 7:25 AM (NST) on Sunday while guiding an expedition organized by the 'Seven Summit Treks'.\"Mr Kami Rita is a record-setter climber for the highest number of ascents on the world's tallest peak in the 71-year-long history of Sagarmatha climbing.Before the summit, Mr Kami Rita had stated that he \"has no plan of climbing Sagarmatha (Nepalese name for Mount Everest) for any specified number of times."}," Apple's US Store Workers Vote To Authorize Strike, Cite Work-Life Balance ":{"img":"https://c.ndtvimg.com/2024-05/kb4d13e8_apple-store_625x300_12_May_24.jpeg","link":"https://www.ndtv.com/world-news/unionized-us-apple-store-votes-to-authorize-strike-amid-concerns-over-work-life-balance-5644085","content":"Employees at the Apple store in the town of Towson voted to unionize in 2022Unionized workers at a Maryland Apple store voted on Saturday to authorize a strike, which would mark the first such labor action against the retailer in the United States if it goes forward.Employees at the Apple store in the town of Towson, outside of Baltimore, voted to unionize in 2022 -- another first for the iPhone maker's US stores.In September, nearly a quarter of Apple store employees in France went on strike the day the iPhone 15 launched, demanding a pay raise at least equal to inflation.The National Labor Relations Board, the federal labor regulator, has received numerous complaints against Apple accusing it of trying to discourage staff from unionizing.Apple did not immediately respond to an AFP request for comment."}," NASA Shares Photos Of Massive Explosions On Sun That Unleashed Solar Flares ":{"img":"https://c.ndtvimg.com/2024-05/kn5l71l8_nasa-sun-_625x300_12_May_24.jpg","link":"https://www.ndtv.com/science/nasa-shares-photos-of-massive-explosions-on-sun-that-unleashed-solar-flares-5643851","content":"For skywatchers across the globe, this celestial drama unfolded in stunning auroras that painted the skies with vibrant hues of pink, green, and purple.For skywatchers across the globe, this celestial drama unfolded in stunning auroras.From northern Europe to Australia's Tasmania, sky-gazers were able to capture stunning photos courtesy of the rare phenomena."}," Trump Could Owe Over $100 Million In Taxes If He Loses Audit Case: Report ":{"img":"https://c.ndtvimg.com/2024-04/3jt8ehu_donald-trump-afp-_625x300_23_April_24.jpeg","link":"https://www.ndtv.com/world-news/trump-could-owe-over-100-million-in-taxes-if-he-loses-audit-case-report-5643813","content":"Former US President Donald Trump could owe more than USD 100 million in taxes if he loses years-long Internal Revenue Service (IRS) inquiry into his claims of huge losses on his Chicago skyscraper, the New York Times reported.According to an Internal Revenue Service inquiry uncovered by The New York Times and ProPublica, Trump used a \"dubious accounting maneuver\" to claim improper tax breaks from his troubled Chicago tower.But in 2010, Trump and his tax advisers sought to extract further benefits from the Chicago project, executing a manoeuvre that would draw years of inquiry from the IRS.Trump's tax records have been a matter of intense speculation since the 2016 presidential campaign, when he defied decades of precedent and refused to release his returns, citing a long-running audit, according to the New York Times.But when Trump sought to reap tax benefits from his losses, the IRS."}," \"Cohen's A Joke\": Trump Fans Ahead Of His Ex-Lawyer's Court Testimony ":{"img":"https://c.ndtvimg.com/2024-05/snhjhn7g_michael-cohen_625x300_12_May_24.jpg","link":"https://www.ndtv.com/world-news/donald-trump-stormy-daniels-hush-money-trial-michael-cohen-is-a-joke-trump-fans-ahead-of-his-ex-lawyers-court-testimony-5643783","content":"Donald Trump and his defense team have blasted Michael Cohen as a liarEmpty fairground rides twisted and spun Saturday on the New Jersey shore as thousands of Donald Trump supporters filled a pristine beach for a rally ahead of potentially damaging testimony in his criminal trial next week.The seaside resort venue for the rally, Trump's first since mid-April, was a far cry from the dingy Manhattan courthouse that has hosted Trump four days a week since the start of his trial for covering up hush-money payments.\"Dipietro, who has donated to the real estate mogul's campaign, said if Trump was convicted in the New York case it would give him \"even more desire to knock on a few more doors to get (people) to come out and vote\" in November.Diehard fans of Trump, who is seeking a White House comeback in the November elections, had traveled from as far afield as Hawaii, with some camping on the beach to secure a spot for the rally.\"As you know, I've come here from New York where I'm being forced to endure a show trial,\" Trump said to boos."}," Amid Tensions, Iran's Big Nuclear Bomb Warning To Israel ":{"img":"https://c.ndtvimg.com/2023-11/b3d2u2tg_ayatollah-ali-khamenei_625x300_01_November_23.jpeg","link":"https://www.ndtv.com/world-news/iran-hints-at-change-in-nuclear-policy-if-israel-threatens-its-existence-5643749","content":"Last year, Iran made commitments to assist in investigating uranium particles found at undeclared sitesAn adviser to Iran's Supreme Leader Ayatollah Ali Khamenei has reignited concerns over the country's nuclear ambitions, particularly in light of escalating tensions with Israel.Kamal Kharrazi, the adviser, hinted at a shift in Iran's nuclear doctrine if its existence is perceived to be under threat by Israel.Last year, Iran made commitments to assist in investigating uranium particles found at undeclared sites and reinstall monitoring equipment.\"In the case of an attack on our nuclear facilities by the Zionist regime (Israel), our deterrence will change,\" Kharrazi added.\"We have no decision to build a nuclear bomb, but should Iran's existence be threatened, there will be no choice but to change our military doctrine,\" Kharrazi said."}," Northern Lights Likely To Illuminate Night Sky Again Amid \"Extreme\" Solar Storm ":{"img":"https://c.ndtvimg.com/2024-05/srg8a3m8_northern-lights_625x300_12_May_24.jpeg","link":"https://www.ndtv.com/world-news/northern-lights-auroras-likely-to-illuminate-night-sky-again-amid-extreme-solar-storm-5643690","content":"\"However China's National Center for Space Weather issued a \"red alert\" Saturday morning, warning the storm will impact communications and navigation in most areas of the country, state news agency Xinhua reported.Northern lights dazzled Earthlings from the United States to Tasmania to the Bahamas on Friday nightAuroras lit up skies across swaths of the planet for the second night in a row on Saturday, after already dazzling Earthlings from the United States to Tasmania to the Bahamas the day before.The first of several coronal mass ejections (CMEs) -- expulsions of plasma and magnetic fields from the Sun -- came just after 1600 GMT Friday, according to the US-based National Oceanic and Atmospheric Administration (NOAA)'s Space Weather Prediction Center (SWPC).A powerful solar storm -- which could continue into Sunday -- has triggered spectacular celestial shows usually confined to the far northern reaches of the planet, hence their nickname of the \"northern lights.It was really charged, with solar particles and emotions,\" Eric Lagadec, an astrophysicist at the Observatoire de Cote d'Azur, wrote on social media after the first night."}," India's New York Consulate To Be Open 365 Days For \"Genuine Emergencies\" ":{"img":"https://c.ndtvimg.com/2018-09/q35u6gic_india-us-flags-reuters_625x300_18_September_18.jpg","link":"https://www.ndtv.com/world-news/indias-new-york-consulate-to-be-open-365-days-for-genuine-emergencies-5643405","content":"In a press release, the Consulate General of India, New York said that it will be open from 2 pm to 4 pm during all holidays, with effect from May 10.The Indian Consulate in New York has announced that it will remain open throughout the year, including weekends and other holidays, to address the \"emergency requirements\" of people.\"The Consulate will remain open during all holidays (including Saturday/Sunday and other public holidays) from 2 pm to 4 pm to address emergency requirements of the general public w.📣New announcementConsulate General of India, New York to remain open 365 days for emergency services.The applicant will be charged an emergency service fee for an emergency visa, as has been the practice, the Consulate General added."}," Russia Says Captured 5 Villages In Ukraine's Kharkiv During Surprise Ground Offensive ":{"img":"https://c.ndtvimg.com/2024-05/g8h1904_kharkiv_625x300_12_May_24.jpeg","link":"https://www.ndtv.com/world-news/russia-says-captured-5-villages-in-ukraines-kharkiv-during-surprise-ground-offensive-5643377","content":"There has been \"heavy fighting\" in the border area and 1,775 people have been evacuatedRussia on Saturday said it had captured five villages in Ukraine's northeastern Kharkiv region during a surprise ground offensive that prompted mass evacuations, as President Volodymyr Zelensky made an urgent call for military aid.Moscow's defence ministry said its troops had \"liberated\" five villages in Ukraine's Kharkiv region near the Russian border -- Borysivka, Ogirtseve, Pletenivka, Pylna and Strilecha -- as well as taking one village in the Donetsk region.Zelensky said in his nightly address on Saturday that Ukrainian troops had been carrying out counterattacks in border villages in Kharkiv region.Military expert Olivier Kempf told AFP Saturday that Russia's ground operation was most likely aimed at creating a buffer zone near its Belgorod region, recently raided by pro-Ukrainian units, or diverting Ukraine's resources from the Donetsk region.Washington announced a new $400 million military aid package for Kyiv hours after the offensive began, and said it was confident Ukraine could repel any fresh Russian campaign."}," Canada Makes Fourth Arrest In Khalistani Terrorist Hardeep Nijjar's Killing ":{"img":"https://c.ndtvimg.com/2024-05/22v1vpn8_hardeep-nijjars-killing_625x300_12_May_24.jpg","link":"https://www.ndtv.com/world-news/canada-makes-fourth-arrest-in-khalistani-terrorist-hardeep-nijjars-killing-5643350","content":"Hardeep Singh Nijjar was killed outside Guru Nanak Sikh Gurdwara in Surrey (File)Canadian authorities on Saturday arrested a fourth Indian national for his role in the killing of separatist Khalistan Hardeep Singh Nijjar, according to an official release.All three individuals are Indian nationals living in Edmonton and have been charged with first degree murder and conspiracy to commit murder.Twenty-two-year-old Amardeep Singh, a resident of Brampton, Surrey, and Abbotsford areas of Canada, has been charged with first degree murder and conspiracy to commit murder.IHIT investigators on May 3 arrested three Indian nationals -- Karan Brar (22), Kamalpreet Singh (22) and 28-year-old Karanpreet Singh -- for the murder of Hardeep Singh Nijjar.Hardeep Nijjar, 45, was killed outside Guru Nanak Sikh Gurdwara in Surrey, British Columbia on June 18, 2023."}," Switzerland's Nemo Wins 2024 Eurovision Song Contest, Israel Comes Fifth ":{"img":"https://c.ndtvimg.com/2024-05/k9k8fih8_namo-switzerland-eurovision_625x300_12_May_24.jpeg","link":"https://www.ndtv.com/world-news/switzerlands-nemo-wins-2024-eurovision-song-contest-israel-comes-fifth-5643270","content":"Several thousand protesters gathered in central Malmo ahead of Saturday's final, waving Palestinian flags and shouting \"Eurovision united by genocide\" - a twist on the contest's official slogan \"United by music\".The female solo artist on Thursday emerged as one of the leading contenders to win after qualifying for the final.Viewer votes made up half of Saturday's final result, while juries of five music professionals in each participating country made up the other half.Nemo performs at Eurovision, May 11, 2024Switzerland on Saturday won Eurovision 2024 in Swedish host city Malmo, beating runner-up Croatia, after having been among bookmakers' top-three to win the competition.25 countries competed in the final after Dutch artist Joost Klein was expelled earlier on Saturday due to a complaint filed by a production crew member."}," SpaceX's Starship To Have Fourth Flight In 3-5 Weeks, Elon Musk Says ":{"img":"https://c.ndtvimg.com/2024-05/ljk7el4_spacexs-starship-rocket_625x300_12_May_24.jpeg","link":"https://www.ndtv.com/world-news/spacexs-starship-to-have-fourth-flight-in-3-5-weeks-elon-musk-says-5643269","content":"SpaceX's Starship rocket, a futuristic vehicle designed to eventually carry astronauts to the moon and beyond, will probably have its fourth flight in 3-5 weeks, the company's Chief Executive Elon Musk said in a post on social media platform X on Saturday.com/cX5u17NHRQEarlier this year, SpaceX's Starship rocket completed nearly an entire test flight through space on its third try getting farther than ever before, but disintegrated on its return to Earth.\"Objective is for the ship to get past max heating or at least further than last time,\" Musk said in response to a question about Starship."}," In Nigeria, Prince Harry Speaks Of \"Brave Souls\" Losing Lives In Conflict ":{"img":"https://c.ndtvimg.com/2024-05/3jk3u9oo_prince-harry-in-nigeria_625x300_12_May_24.jpeg","link":"https://www.ndtv.com/world-news/in-nigeria-prince-harry-speaks-of-brave-souls-losing-lives-in-conflict-5643186","content":"The Duke of Sussex arrived with his wife Meghan on Friday in the capital AbujaPrince Harry spoke in Nigeria on Saturday of the tragic loss of the \"brave souls\" in the country's military who had lost their lives in conflicts, and said he felt \"goosebumps\" after seeing plans for a new centre to rehabilitate injured troops.Prince Harry, the 39-year-old Duke of Sussex, and his wife Meghan arrived in Africa's most populous nation on Friday in a trip linked to the Invictus Games, an international sporting event that the Duke of Sussex started a decade ago for troops injured in action.At a reception for military families in Abuja, Harry said he had on Friday met 50 wounded soldiers during a trip to northern Kaduna and could see that the injuries were defining their lives, but there were some who had smiles on their faces.\"What this proved to me, what this reminds me of, is the power of seeing what is possible post injury,\" said Harry, adding that \"seeing the plans for the new Invictus Centre gives me goosebumps.\"He served as a military helicopter pilot in Afghanistan."}," US \"Deeply Alarmed\" As Thousands Protest Georgia's \"Foreign Agent\" Bill ":{"img":"https://c.ndtvimg.com/2024-05/dg22slc_georgia-protest_625x300_12_May_24.jpeg","link":"https://www.ndtv.com/world-news/us-deeply-alarmed-as-thousands-protest-georgias-foreign-agent-bill-5643128","content":"Georgian Parliamentarians face a critical choice - whether to support the Georgian people's EuroAtlantic aspirations or pass a Kremlin-style foreign agents' law that runs counter to democratic values.\"Georgian Parliamentarians face a critical choice - whether to support the Georgian people's EuroAtlantic aspirations or pass a Kremlin-style foreign agents' law that runs counter to democratic values,\" he said.Georgian opponents of the bill have dubbed it \"the Russian law\"About 50,000 opponents of a \"foreign agents\" bill marched peacefully in heavy rain through the Georgian capital on Saturday, after the United States said the country had to choose between the \"Kremlin-style\" law and the people's Euro-Atlantic aspirations.The crowd on Saturday waved Georgian, European Union and some Ukrainian flags and in a break with the past, included more older protesters as well as the many young people who have thronged the streets over the past month.Sullivan said that Georgian Dream appeared to be deliberately trying to break with the West, even as both the ruling party and Georgian public opinion has traditionally been in favour of the country's joining the EU and the U."}," Thousands Protest In Israel, Demand Release Of Hostages Held In Gaza ":{"img":"https://c.ndtvimg.com/2024-05/0ov1bje_israel-protests_625x300_12_May_24.jpeg","link":"https://www.ndtv.com/world-news/thousands-protest-in-israel-demand-release-of-hostages-held-in-gaza-5643097","content":"Hamas' October 7 attack sparked the devastating war in GazaThousands of Israelis took to the streets on Saturday demanding that Prime Minister Benjamin Netanyahu's government do more to secure the release of hostages being held in the Gaza Strip by Islamist group Hamas.Hamas' October 7 attack sparked the devastating war in Gaza, now raging for nearly seven months.In a speech she referenced a video Hamas made public on Saturday, claiming that another of the Israeli captives had died.One of them was Naama Weinberg, whose cousin Itai Svirsky was abducted during Hamas' Oct.7 assault on Israeli towns and, according to Israeli authorities, was killed in captivity."}}